{
	"augmented_text": [
		"This film is one giant pant load.  Paul Schrader is utterly lost in his own bad screenplay.  And his directing is about as comatose as it can be without his actually having been sleepwalking during the process.  The worst though is Woody Harrelson, whom I ordinarily like when he is properly cast.  He plays the walker, a homosexual man in D.C. who plays social companion to the bored wives of the Washington elite.  He could not have been more one dimensional if he had been cut out of a magazine and bounced around in front of the camera on a popsicle stick.  His southern accent is that off the rack version that decrescendos from the beginning to the end of every line he delivers, as though the heat and humidity of the South is still draining him of every ounce of energy he has.  It is monotonous.  But, his is not the worst accent in the movie.  His boyfriend, played by Moritz Bleibtreau, attempts to affect some kind of a Mid East accent that is so clumsy he can barely deliver the bad lines written for him.  He is them Italian That is kind of a good reason to cast someone else do not ya think?  From the story, to the screenplay, to the directing, to the camera work, to the performances by the leads, this movie is bad from beginning to end.  The only tolerable moments in this film came from three supporting actresses Lily Tomlin, Lauren Bacall, and Kristin Scott Thomas.  Only these three managed to make it through this movie with their dignity in tact.  In fact, all three are excellent, in spite of being trapped in a really bad film.  Ufortunately, no one could ever be good enough to redeem this endless series of flaws.  If you like these three actresses, watch them in something else.  This movie is not worth your time.",
		"I rented this on DVD and I kind of feel bad since Dawson and Lugacy are so earnest about it in the DVD comments.  It is not a bad movie exactly, but it is one of those films that desperately wants to be a deep comment on human nature while not realizing that its story is practically a genre.  Plus, it is a little simplistic about the issue in a lot of ways, and the characters behavior often strains belief.  I say you honest Otherwise, its point has been made before and more artfully.  And that gets to the big problem, which is that it really does not have much of cinematic interest to it besides the point.  It ends up being a fairly bland movie overall that invests everything in the idea that the basic story will be shocking and compelling, and it does not really pay off.",
		"Summer season is here when the choices in the cinemas are limited to what is the hottest movie of the week, given 99.9 of the screens dedicated to screening it.  OK, so I may exaggerate on the percentage, but you get my drift.  Besides stuff from Hollywood, Bollywood too have their own share of highly anticipated blockbusters, and from some of the trailers shown, I am hyped to watch them too.  Tashan was billed as one of THE most highly anticipated for 2008, but I was quite surprised at the lower than low turnout at the cinemas.  When I watched Jodha Akbar, it was a full house, but it was not for Tashan.After watching it, I knew why.  It was entertaining, but it was fundamentally weak.  Just like it is literal English title, which means Style, Tashan is all style, but little substance.  Not that it does not have the usual star power, but scenes felt forced, and some bordered on a tad ridiculous, even for Bollywood standards I must say.  Which is quite surprising given that Tashan is directed and written by Vijay Krishna Acharya, who wrote Dhoom and Dhoom 2, both of which I enjoyed tremendously.  In his rookie directorial outing with Tashan, while you cannot fault his direction, you would probably scratch your head over the plot, which was clunky at best.  It tried it many And in a bid to include everything including the kitchen sink, you have an assortment of vehicles appearing, and the one that took the cake, in a Dhoom 2 homage, was the jetski boat in the middle of nowhere.At best, Tashan can be enjoyed as unintentional comedy, and this is attributed to how the cast hammed up with their characters.  Saif Ali Khan plays Jimmy Cliff, a call center executive who gives English tuition, only as a platform for fishing out new girlfriend material.  His playboy ways gets junked aside when he meets with Pooja Singh Kareena Kapoor, who is not exactly who she seems, the meek and sweet natured hottie.  She engages Jimmys services for her boss, mobster Bhaiyyaji Anil Kapoor, who probably gets most of the laughs as he speaks broken English and phrases must like how an ahbeng does it.  And to complete the quartet, Akshay Kumar plays Bachchan Pandey, an illiterate gangster for hire who got engaged by Bhaiyyaji to hunt down Jimmy and Pooja when they escape with money stolen from Bahiyyajis business.So begins a road trip of sorts, with friends who turned enemies, and enemies whom you know will become friends as the road trip wears on.  Jimmy Cliff is probably the most implausible of all, because he goes from zero to hero, executing moves that would shame Rambo, in absolutely no time, which is quite out of character.  Kareena Kapoor amps up the sex factor as she uses her charms to guile both men, and has plenty of opportunity to do so given the much touted bikini scenes, and other costumes that boast of plunging necklines or hemlines way above the knee.  Every character has a backstory created, and I thought Akshay Kumars Bachchan Pandey was probably the best, the most touching and the most fun of the lot, even though his character seemed a lot like a nongreen Incredible Hulk with his gravitydefying leaps and power packing punches.  His wounds also heal automatically, which impressively puts Wolverine to shame.  And the best part is his theme song, which is damn alphamale and played in rara mode each time he takes on adversaries.But sad to say, that is the only tune that is memorable, something that cheers Bachchan PandeyBachchanPandey.  For most Bollywood movies I watch, I will usually be able to, despite the obvious language gaps, emerge from screenings humming a tune or two.  I was not able to do that after Tashan, because the songs unfortunately just were not catchy at all.  Usually the songdance routine works well into the storyline without any necessity to bring the characters out of the current scene or location.  That I enjoy, versus plucking them out and plonking them into extreme settings high atop a mountain, or atop jagged rocks on the beach front.Tashan probably did not take itself too seriously, but coming from Vijay Krishna Acharyas story, you probably wanted something a little more decent rather than the ridiculous, and for continuity to be a little more careful as well.  Billed as a blockbuster, now I can start to understand why the crowds have already shunned this one.  Despite Akshay Kumr stealing the show, Tashan could have been better on the whole.",
		"Shame on Yash Raj films and Aditya Chopra who seems to have lost their intelligence over the years and providing steady fare of tripe in this piece of cinematic crap thats not even worth You Tube standards.  I was I ashamed Shame on the actors for taking this work and even commenting on it as some piece of work they can own up to.  Saif Ali Khan completely disappointed in your choice of film.  Kareen shows enough skin for the puberty stricken and Akshay comes up as the dimwit.  Anil another retard with a pubescent fascination for English.  His cronies were commendable in their acting and with the bizarre cinematography scattered in the last 15 minutes, it was enough to pop a blood vessel.  Do not WASTe any brain cells, energy or your money to go see this Go SEE  Rent AMU with Konkana Sensharma instead a beautiful piece of independent film thats ever come out of India.Intelligent, poignant and a wonderful storytale that will touch everyone with intelligent actors and gave me hope that all is not lost in Indian cinema making.",
		"If this is a 2008 product from one of the biggest production houses of Indian Film Industry Yash Raj then I am afraid it is a very long ahead for us to reach the right standards.If you can go wrong to this length with such an enormous star cast of Anil, Akshay, Saif and Kareena, then movie making is still to be studied much harder by everyone associated with this film.  The film lacks in almost all departments except cinematography and Akshay Kumar.  He has a few good dialogues to render but that alone cannot make you enjoy a flick with huge expectations.The first scene of a car going down into a river from the mountain has very cheap graphics like that of a cartoon film.  That itself was a clear indicator of the directors vision.  Every actor who otherwise is an asset to a movie is simply wasted.  Anil Kapoors gimmick of attempting good English falls flat most of the times.  And Saif will surely hit himself thinking why he signed this movie.In short It is THE BIGGEST WASTE OF RESOURSES AFTER JHOOM BARABAR JHOOM.  I would say that even Aaja Nachle was a better enjoyable movie than this.One cannot understand how and why this kind of script was written and approved.  The most unwanted was the flashback sequence of Akshays love story.  After the faulty script the weakest point of the movie is its music.  Vishal Shekhar have given just some filler tunes to each song.  The songs start off very well and suddenly the tunes drop drastically.  Only one song Falak Tak Chal is somehow good of all in the lot.  An opportunity wasted by Vishal Shekhar.Regarding the continuity intelligence of the makers just sample this  Akshay and Saif are on the road in the hilly area of a foreign Location probably Ladakh.  In the next scene they are searching for Kareena in Haridwar and then back in the hills with Kareena in the dicky of their car.  I am you silly You can see all the heroes walking through the storm of bullets not hurt as if they are GOD.  Are we still seeing a 2008 movie with all these technical heights achieved?  So no more words on this pathetic and downgrade movie but a sincere request to senior actors from their fan.Dear Anil Kapoor  Akshay Kumar, If possible please ask for a preview of your movies after their first copy is out.  As artists of such stature, you have certain responsibilities towards your fans and viewers.  People still clap for you as you enter the screen in your first scenes respectively.  I think this kind of movie should not see the daylight as it hampers the reputation of all associated with the movie, the actors and the production house both.",
		"I do not want to go too far into detail, because I cannot really justify wasting much time on reviewing this film, but I had to give an alternate opinion to hopefully help people avoid the movie.  The animation is crud and the story alternates between boringpointless to extremely irritating.  The humor was completely lost on the audience, and yes  Ghost in the Shell fans, this is NOT an action scifi or anything like that  its an attempt at slapstick comedy, and the humor just did not work after being translated.  It was I entertaining Yaaawwnnn...  Rent Kinos Journey instead.",
		"I just saw the movie in theater.  The movie has very few good points to talk about.  Kareenas beauty and a couple of songs may be.  Thats it.  The movie is a complete disappointment in all areas.  Anyone be Mumbai semifinal But the worst I feel about the movie is the action scenes.  Now days Bollywood is trying to copy action scenes from Hollywood.  But they forget that Hollywood directors takes a lot effect to make it look like real.  But unfortunately Bollywood directors do not have that much of time.  They spend their time on songs and publicity of the movie.  Now such too stupid action scenes may work in South as the audience just pay to watch their favorite actor killing bunch of people.  But in Bollywood this is certainly not going to work.  All the action scenes I wish I could have forwarded.  At the end even some Chinese people appear from nowhere to beat Akshay Kumar.  This is height of stupidity.  Audience is not paying to watch such stupidity.  I think Bollywood now should forget about the action movies.  They cant make it.  The last good action I have seen was from Ghatak and Khiladiyon ka Khialdi.  The current scene in Bollywood is really sad for action movie fans like me.  Does these people see their movie after completion?  Cannot they figure out that the slow motion action which is done using ropes is too unrealistic and childish?  Better not to have action scenes if you cant handle it.  I just want to go back to Amitabhs era where movie like Zanjeer and Deewar were having thrilling action scenes.  The sound effect was not very effective in those days, but visually it is much better than current era scenes.  This movie now should open the eyes of the Bollywood movie directors.  Please do not make any more action movies, until you acquire the art of making it realistic.",
		"OK, I am not Japanese.  I do know a little about Japanese culture, and a little less about Japanese pop culture.  Other than that, I am Spanish, I eat paella and I like black humor.Good, with that point set, I can comment on the movie I have no idea on how it is enjoyable to the Japanese audiences, Mamoru Oshii is quite a good director despite the overly pedantic postmodern stuff in the style of Talking Head, and even that was curious and somehow interesting and I am surprised he came up with this.  It thought it horrible The jokes seemed bad, the script was overcooked I mean, give the audience a break, and shut up a little you damn narrator to the point of almost making my head explode over an overkill of fastpaced speaking and absurd action.However, I thought the animation was really cool.  The idea is great, and it is well exploited in those animated scenes.  However, the eyecandy finishes as soon as the characters are left aside to start with an endless not funny at all mumbojumbo speech over still pictures.  It just makes you want to fast forward to the next cutout hysterical characters scene.I read Mamoru Oshii is actually planning on a sequel for this.  The idea was good but horribly exploited.  Maybe the second part will bring up the good parts of this first one and actually make an interesting movie, or maybe it will be more and more overnarrated scenes.  But hell, if you thought Talking Head was dense, Amazing Lifes of Fast Food Gifters will give cause you a stroke.Of course, all this comment is based on the experiences of someone who is European.  Probably this is totally useless to Japanese people, maybe it was a really funny film lost in cultural frontiers and translation.  Maybe.",
		"Masters of Horror The Screwfly Solution starts as America is being infected by an airborne virus that affects the male population, when aroused men indiscriminately kill any woman in sight apparently in the name of God.  Scientist Alan Jasn Priestley is brought in by the Government  knows more than most  senses the situation may have gone too far already so he tells his wife Anne Kerry Norton to take their teenage daughter Amy Brenna OBrien  try to survive as the future of the human race may depend on them...This Canadian American coproduction was episode 7 from season 2 of the Masters of Horrror TV series, directed by Joe Dante I thought The Screwfly Solution was pretty bad.  I takes I short I was not happy with the inconsistencies with the story either, if men only kill when sexually aroused why does the flight attendant casually break that womans neck on the plane?  Was he sexually aroused, I think not.  Why does every bloke then think he is killing in the name of God?  I just cannot see every single bloke on Earth suddenly knowing the Bible  starting to believe in God, I just found the notion ridiculous  the show also states clearly that there is nothing religious about what is going on so what is the deal with everyone thinking they have a divine to murder any woman they see?  Then there is the fact people get turned on by different things, what about gays for instance?  Will they kill guys instead of women?  I know there is a brief scene which makes a joke out of the gay issue but it is conveniently brushed to one side  then there is the thing which annoyed me the most.  The fact that presumably every bloke on earth has turned psycho  killed all the women they go about their everyday business like nothing ever happened, it just felt so stupid, the plotting is rubbish  to round things off there is a ending which looks like it was taken from a rejected episode of The XFiles 1993  2002 with a bright neon alien.Director Dante on this showing definitely does not qualify as a Master of Horror as far a I am concerned, the story is badly paced, it is just so stupid considering it is played deadly straight  instead of trying to make a proper horror show he turns in more of a thriller with it is deadly virus on the loose situation  the subsequent mother  daughter on the run because of it, there is very little here in the way of what I would call effective horror  even less gore.  There is a scene when a woman is stabbed with a broken bottle, a brief scene after when a guy stabs his own groin with said bottle  another woman is stabbed in the stomach but nothing else to write home about.Technically like the other episodes it is really good  it does not have the look of a cheap TV series, the special effects are great as usual  it is well made.  The acting is alright but noone really stood out.The Screwfly Solution is easily the worst Masters of Horror episode I have seen but bear in mind I have not seen all of them... yet.  As a stand alone piece of entertainment it did nothing for me  as a show made by a socalled Master of Horror it disappoints me even more.",
		"I love the frequently misnomered Masters of Horror series.  Horror fans live in a constant lack of nourishment.  Projects gave it bent I do not know how to spoil the spoiled but SPOILER AHEAD All of a sudden ... no, there was that light drifting across the night sky earlier ... we have long haired luminescent aliens huh?  ...  HUH?  brain drilling males and ... yeah, I get it but ... well ... the worst curse of storytelling  a rousing and promising set up without a rewarding denouement.Cue to storytellers ... your build up has to have a payoff that exceeds build up.  Not the other way around.  Storytelling math 101.End of Spoilers  Big Oops!",
		"A huge disappointment from writer Hamm and director Dante.  Their previous collaboration on the first seasons Homecoming was twisted and darkly hilarious in all the right ways.  This poor handling of an intriguing premise left me bewildered.  The supposed payoff showing generic aliens extracting something from the brains of the infected psychopaths was completely unsatisfying and explained nothing.  If the point of the story was an extraterrestrial cleaning of the planet of it is human infestation, why did they go about it in such a gratuitously sadistic and misogynistic fashion?  Why not just unleash a completely lethal virus a la Stephen Kings The Stand instead of having the male population butcher the females?  I kept I pretentious The religious subtext simply seemed forced but it was clear Sam Hamm must have thought it was profound by the weight he gave it.  I like a lot of both Dante and Hamms work but this was just unwatchable.",
		"I gave this 4 stars because it has a lot of interesting themes many here have already mentioned.  From the domestic violence, to sexuality and many of the taboos therein.  Outside of the gore I really would not call this horror so much as I would science fiction.It is bleak, depressing and hopeless.  While I do not mind a less than cheery ending, I am really very tired of the humans suck clich? that is central to every movie.  I know you different Right now, if you are reading this and believe that humanity deserves to die, just go out, find a lake and swim til your arms are tired.  This way you will not be around to direct the next film or write the next book telling me I deserve to die for being alive.  It is silly, not thoughtful, and boring.",
		"Superman II  The Richard Donner Cut should be a fans dream come true.  At long last, footage only seen in photos and scenes that only existed on the printed page would finally come to life.  A director that was unable to complete his vision would have the opportunity to have his vision restored.  It seems like a winning situation.  And then you start watching this assembly of footage and you realize this esoteric dream is a very real nightmare of sloppiness and incompetence.  While it is entirely possible that no movie could compete with the finished perfect version each of us has imagined over the years it really should have been a thrill to finally see this project.  And it is only a very few times.You know things are shaky when the very first bit of text on screen looks like home brew computer graphics.  But then we start seeing new footage alternates from Superman  The Movie for the trial and that first bit of hesitation fades away.  Hey, this is pretty neat!  Things are alright for these few fleeting moments until we see footage from STM intermixed with new effects for this project, and it does not convince at all.  And from this point on, it never ever lets up.  It Believe it difficult The best effects in this are from the original productions.Another issue with this recut.  A lot of it just does not make sense.  The only reason any of it really works is because we have all seen the theatrical version of Superman II, a movie that does make sense.  Lesters Superman II fills in the holes of this assembly.  Part of this could be because Donner did not get to complete shooting, the other part could be because the makers of this project were intent on using as little Lester material as possible.  What we end up with is an assembly of footage that makes Superman IV look airtight and coherent.After viewing this, one gets the sense that while Lester was faithful and comfortable using Donner material, Michael Thau and his team were extremely disrespectful towards anything filmed by Lester.  The best scenes in The Donner Cut are the ones lifted relatively intact from the released version of Superman II.  That includes the moon sequence and the diner sequence, not ironically, both were filmed by Donner.  But anything else from that movie filmed by Lester is reedited in such a hasty fashion, that it now makes Lester seem like a ham fisted know nothing.  While Lester honored the Donner material, Lester here is thrown under the bus.So is there anything good in this release?  Well Marlon Brando is in it, and that is neat to see.  In fact watching any of the material shot by Donner is neat since it was all filmed at the same time as Superman  The Movie.  But that only highlights the problems of this release.  Any of the major scenes really just Lois jumping and scenes with Marlon Brando would have been better served as completed scenes in a deleted scenes section.  Instead they are shoe horned into a nonsensical narrative with inferior performances many alternate takes from familiar scenes are used sloppy edits and bad decisions.Watch the opening scene at the Daily Planet.  Why are we looking at Jackie Coopers back as he calls for Lois and Clark?  At the end why do we have Lois walking into her dark apartment only to have that followed by Jackie Cooper walking into a dark bathroom turning the lights on?  I was initially confused by this, because I expected to see Lois.  The entire assembly is filled with questionable choices like this.Battle scenes are a mess too, with no geography between cuts.  It is just random action.  Of course, the major action scenes were shot by Lester and his material is only used as a bridge to the next set of Donner outtakes or alternates.  They should have used more of Lesters footage, but probably had too much pride to admit that.The sloppiness extends to the military missile as well.  As noted elsewhere, the missile shown in The Donner Cut bears the designation XK 10 while we all know it is the XK 101!  A blind man in STM knows that!  The producers of this assembly, who tried so hard to honor the original film, dropped the ball less than five minutes in and that mistake is indicative of the quality of the entire production.  For all the supposed care that was put into this, the final product has an air of shoddiness to it that is inescapable.The entire affair would probably be easier to digest if Warners did not make this a separate release here in the states.  As it is, we are expected to pay for what is essentially a bonus disc of deleted scenes with a Play All option.  It is really only worth one viewing so that we can finally see the legendary cut scenes, but after that initial viewing, I expect that this will be an excellent magnet for dust and little else.  I know after my experience of watching this, I had new respect for Lesters version.  It is by no means perfect, but Lester realized the deficiencies that were in the script that stand out here in bold relief.  He managed to make a movie that has entertained for many years and will continue to do so, while this new recut will most likely only be remembered as a footnote in that films history.",
		"I had to do a search on the actresses to find the board of this film because the title is now An Unexpected Love.  It is I unfamiliar Everythings pretty restrained and you do not really get an idea of who these characters are so, as a viewer, I was not able to become emotionally invested in the storyline.  I guess I am not the target audience for this but I am not sure who is.  Everythings muted and soft focus and earth tones...nothings very interesting.  I had a prurient interest in seeing two women make out but it is handled so discreetly that I was disappointed.  Rent Personal Best instead.",
		"This movie was okay, but it certainly defeats the claim that homosexuals are born that way, especially when a woman can exit out of an unhappy marriage and just fall into the arms of another woman.  It seems Kates common And there was no happy medium.  It was either Kates friends and relatives totally embraced her or they totally shunned her.  This is not typical of interactions between gay and nongay relatives and friends.  It is usually a mixture of emotions and values that come into play.  It is possible to love people and treat them with respect while not necessarily condoning the choices they make.  Sadly, the movie showed none of these types of interactions.  For a movie trying to portray tolerance and acceptance, it struck me as very intolerant movie!  Then at the end, Kate apparently decides after all these years she wants to be with Mac and everything is hunky dory  is that what being gay is really all about?  Come on!",
		"German filmmaker Ulli Lommel has managed a task many horror fans thought was impossible he is unseated fellow Teuton Uwe Boll for the crown of director of the worst horror film ever made.Lommel is truly the Ed Wood of the new millennium.  This film is as shoddy and laughable as the bestworst of EW.  I am both proud and embarrassed to say that I watched it in toto, morbidly fascinated to see just low the bar could be set.  The answer is subterranean; Lommel dug a pit and buried it.The fun begins with the cast of international nobodies.  Only someone who has lived in Los Angeles, where every auto mechanic, doctor and mailman is an actor or screenwriter waiting to be discovered, could easily understand how Lommel managed to find so many wannabe actors willing to spew his ridiculous dialog with a straight face.The main character, a villainous beat cop, is played by a German actor with a thick German accent.  Aside from being a serial killer, he is also the oldest beat cop in LA.  Despite the fact that he stops innocent women drivers and takes them into custody, then drags them into his home which inexplicably is the top floor of a furniture warehouse, and does all this in plain sight of his rookie partners, the LAPD refuses to investigate, going so far as to physically attack one of his accusers in a ninja style raid on his apartment.The sets are excruciatingly bad.  The production designers budget apparently included just enough money for a can of paint; enough to paint Precinct 707 on a cardboard wall.Since the actors were obviously unpaid nonprofessionalsa sad assortment of European emigres possibly deportees if they acted in their native lands, bimbos, mimbos, and desperate middleaged womenand since little if any money was spent on sets, special efx, locations or other production value, it is only fair to mention that they did spring for a few genuinelooking police uniforms.  Sadly, they could not afford a police car; the uniformed cops cruise the streets in a shiny new Mercury rental.More than half of the story focuses on the dirty deeds of our deranged German LAPD officer and the futile efforts of two young rookies to stop him.  One of these young actors is especially pitiable because he is the only actor in this whole mess with even a vague shot at a real career in the movies.  The other fits right in, with a rockabilly hairdo and tortured Brando posing that needs to be seen to be appreciated.The latter part of the film is where the title gets its zombie, as the victims of our killer are resurrected after he murders a girl who had just visited some voodoo priestesses to have a protective spell put on her.  Do not ask why a girl from Romania would resort to voodooism in anticipation of being murdered, just accept Lommels logic and enjoy the absurd ride.After much prolonged handclawing out of strawcovered roadside graves, the zombie girls manage to make their appearance.  They look exactly as they did before death, maybe even prettier, with black glamor makeup generously airbrushed around their eyes.  Looking nothing like zombies, they look more like high fashion models ready for the runway.At this point in the movie Lommel borrows a creative note from his lauded countryman Boll, and injects large doses of cheesy Eurotrash techno into the soundtrack.  We are talking prehistoric electronic bumblebee noise.  Stuff have Lommel young This gives our auteur ample opportunities to shower us with more of his golden dialog.  Yes, a golden shower it is.I will not spoil anything by revealing the shock ending.  All I can say is it is perfectly in tune with the rest of this masterpiece.  The spirit of Ed Wood lives on... or should I say his geist.",
		"Mt little sister and I are selfproclaimed horror movie buffs.  We have seen just about EVERYTHING, especially zombie flicks.  Now, we have seen a lot of good zombie movies, and a lot of bad ones.  This BY FAR is the WORST movie I have ever seen in my entire life.  Not only was the acting horrible, but the special effects, graphics and ever zombie makeup was the worst I have seen.  If you can even call it makeup  black eye shadow around the eyes This is totally proof that you should never judge a book by it is cover.  Cause the cover to the movie is the only sweet thing about. do your selves a favor and DO NOT WATCH THIS MOVIE!!!!!!!!!!!!!!!!!!  I was return hahahhaa i do not even know how it got the ratings that it did, t should be in the negative",
		" REVIEW MAY CONTAIN SOME SPOILERS  I will make this review short and sweet.  I bought it interested How bad could it be, right?  Well, it is pretty bad.  Justin Timberlake plays Pollack, a wannabe journalist who stumbles across a case that may lead to corrupt cops at Edisons Police Force.  LL Cool J is Deed, a cop within the force on a special force team called F.R.A.T.  First Response Assault Tactics.  He is teamed with an ontheedge bad cop named Lazerov Dylan McDermott.  In the opening scene we see Lazerov  Deed taking on some bank robbers, but at night they are busting a couple of guys doing drugs.  I do not want to give to much away, but things turn bad for the guys doing the drugs.  Pollack, who works for Ashford Morgan Freeman goes to a trial involving Deeds  Lazerov.  He suspect foul play and with the help of Ashford, does some investigate that turns ugly.  Wallace Kevin Spacey who is all within the F.R.A.T. team joins with Ashford to try to bring the corrupt cops to justice.You can tell from the beginning that Freeman and Spaceys performance are pretty lackluster.  The only person that give a all out performance is Dylan McDermott.  He is a complete nut case in this movie and made a believer out of me.  LL Cool J is terrible in this film.  He says every line the same way and shows pretty much the same emotion.  He was much better in movies like Deep Blue Sea  Any Given Sunday.  The film starts off with some nice action but then drags it feet through the rest of the film.  The ending is far from satisfying.Do not waste your time with this film.  I am putting it on Ebay this weekend.",
		"Notice I have given this 1 star if the option been given I would have given this zero.  As I put this DVD into my TV and sat down on my couch I was expecting some of the worst film making at its finest.  I looked it critical But it did not prepare me for the crap that was about to spew from my television screen.The box makes this movie out to look well OK at best.  DO NOT LET THAT FOOL YOU.  This movie needs to be banned from all shelves around the world.The best way I can describe this movie is like porn but without any sex scenes in it.  The acting if you can call it that, the plot so many holes must look like Swiss cheese, and the special effects really are just terrible.Please do not be like me and rent this movie because you think it will be funny to watch.In the end I am not saying I can make a better movie than this, but I am thinking it.",
		"Last weekend I bought this zombie movie from the bargain bin and watched it with some friends thinking it was going to be a budget version of Land of the Dead.Boy, was I wrong.  It seems as if they spent a good portion of their budget on the coverart, which is very misleading to fans of the zombie genre.We watched up to the point where the zombie chicks come alive and get in the car with some yuppie who is out in the middle of nowhere talking business on a cellphone.  They actually speak to the guy before one of the girls kills him; but once they started driving the car, I could not suspend my disbelief anymore.Some people actually consider this a so bad, it is good movie, they are liars.  I mention they glad",
		"German filmmaker Ulli Lommel has managed a task many horror fans thought was impossible he is unseated fellow Teuton Uwe Boll for the crown of director of the worst horror film ever made.Lommel is truly the Ed Wood of the new millennium.  This film is as shoddy and laughable as the bestworst of EW.  I am both proud and embarrassed to say that I watched it in toto, morbidly fascinated to see just low the bar could be set.  The answer is subterranean; Lommel dug a pit and buried it.The fun begins with the cast of international nobodies.  Only someone who has lived in Los Angeles, where every auto mechanic, doctor and mailman is an actor or screenwriter waiting to be discovered, could easily understand how Lommel managed to find so many wannabe actors willing to spew his ridiculous dialog with a straight face.The main character, a villainous beat cop, is played by a German actor with a thick German accent.  Aside from being a serial killer, he is also the oldest beat cop in LA.  Despite the fact that he stops innocent women drivers and takes them into custody, then drags them into his home which inexplicably is the top floor of a furniture warehouse, and does all this in plain sight of his rookie partners, the LAPD refuses to investigate, going so far as to physically attack one of his accusers in a ninja style raid on his apartment.The sets are excruciatingly bad.  The production designers budget apparently included just enough money for a can of paint; enough to paint Precinct 707 on a cardboard wall.Since the actors were obviously unpaid nonprofessionalsa sad assortment of European emigres possibly deportees if they acted in their native lands, bimbos, mimbos, and desperate middleaged womenand since little if any money was spent on sets, special efx, locations or other production value, it is only fair to mention that they did spring for a few genuinelooking police uniforms.  Sadly, they could not afford a police car; the uniformed cops cruise the streets in a shiny new Mercury rental.More than half of the story focuses on the dirty deeds of our deranged German LAPD officer and the futile efforts of two young rookies to stop him.  One of these young actors is especially pitiable because he is the only actor in this whole mess with even a vague shot at a real career in the movies.  The other fits right in, with a rockabilly hairdo and tortured Brando posing that needs to be seen to be appreciated.The latter part of the film is where the title gets its zombie, as the victims of our killer are resurrected after he murders a girl who had just visited some voodoo priestesses to have a protective spell put on her.  Do not ask why a girl from Romania would resort to voodooism in anticipation of being murdered, just accept Lommels logic and enjoy the absurd ride.After much prolonged handclawing out of strawcovered roadside graves, the zombie girls manage to make their appearance.  They look exactly as they did before death, maybe even prettier, with black glamor makeup generously airbrushed around their eyes.  Looking nothing like zombies, they look more like high fashion models ready for the runway.At this point in the movie Lommel borrows a creative note from his lauded countryman Boll, and injects large doses of cheesy Eurotrash techno into the soundtrack.  We are talking prehistoric electronic bumblebee noise.  Stuff have Lommel young This gives our auteur ample opportunities to shower us with more of his golden dialog.  Yes, a golden shower it is.I will not spoil anything by revealing the shock ending.  All I can say is it is perfectly in tune with the rest of this masterpiece.  The spirit of Ed Wood lives on... or should I say his geist.",
		"I rented this movie last week.  I saw Kevin Spacey and Morgan Freeman were on it, so it seemed promising.  And it was, until Justin Timberlake came on scene.  He is a really bad actor and should not be allowed to make a movie ever again.  I mean, he is one of the most boring, uninspired actors I have ever seen.  He puts absolutely no emotion to any of his lines whatsoever.  Why the hell was he cast for the role of Josh Pollack?  I think Matt Damon would have been a better choice.Kevin Spacey was another big disappointment.  His character is so dull, it seems like a bad mix of his character in American Beauty and John Doe in Se7en.  It might sound cool, but believe me, it is not.Now, Dylan McDermotts acting is very good.  It is about one of the very few good things about this movie.  He is inspired.Morgan good He has some really cool lines though.About the story, although it was a bit obvious and exaggerated at times it was good.  I was expecting a big twist when Lazerov Dylan McDermott was killed, but nothing really happened.",
		"Horrible acting, Bad story line, cheesy makeup, and this is just the tip of the iceberg.  I have I fast It did not.  Aside from a nice breast shot The movie apparently was filmed in some furniture warehouse, and the same warehouse was used for at least 90 of the sets.  You even see this same red chair in several different locations If you are going to make a film at least rent an office building and an apartment, not some warehouse which will echo all your actors dialog..  Note to producers Renting a small office space and an apartment for a month is much cheaper than an entire warehouse, and both are quite a bit more versatile and believable If you spend your money to rent this people I hope you got it with a return guarantee...  You will be demanding your money back...  I only spent 2.99 to rent this tonight and I feel ripped off.",
		"I have it responsible I even got the rental company to give me my money back because I argued that they perpetrated false advertising.It is not enough that the movie itself is a p.o.s., but the cover art is what sold me.  I have done better makeup effects on my children at Halloween than what the movie actually depicts versus the cover art.  Can you say raccoon eyes? I am not going to waste more of my time by going into the full details, but come on, the movies main character is an L.A. cop who was born and raised in Alabama  but has a German accent!?!  It is beyond insulting.",
		"Wow.  I went to the video store tonight because I was in the mood for a bad B Horror movie and I found this Gem.  I looked at the cover and I thought it looked like just the movie for my mood.  I brought it home and put it on.This movie was not the B Horror movie that I had in mind.  This was MUCH worse.  I wanted a bad movie but what I got, I did not know that crap like this existed amongst man.  This movie seemed like a 5 year old wrote and directed it and that is being nice about it.I am an aspiring director and this movie made me so mad that someone out there is actually paying this guy to direct movies.  He needs to work at a garbage dump shoveling crap where he belongs.If you are thinking about renting this or buying it.  I tell I ready Do not DO IT, It is NOT WORTH IT!  I really have nothing nice to say about this movie.  Do not DO IT!",
		"I imagine when Hitchcock scholars and experts find themselves together, the talk is not of the Masters great films like North By Northwest or Strangers On A Train, but a lesserknown effort like this one from 1931, obscure and seriously flawed, which showcases the great director in fledgling form.Emily and Fred Hill Joan Barry and Harry Kendall are a middleclass London couple scrimping to stay ahead.  He begrudges their lot; she accepts it.  Change comes in the form of a letter from an uncle, saying he will set them up so they can enjoy a life of globetrotting luxury.  They make plans for a world cruise.  But their problems have only begun.Just ask Richard Hannay, Roger O.  Thornhill, or Marion Crane.  Well, Marions indisposed at the moment, but you get the idea.  Travel and Hitchcock go together like moths and candlelight, setting one up for a perilous journey at best.  This is perhaps Hitchcocks earliest foray into this theme, and not his most successful or memorable.  Hitchcock do here.The dull When they find themselves at the Folies Berg?re, in the form of crosscutting with footage that looks ten years older than the rest of this film, they are abashed at the outfits of the female performers.  The curtains gone up too soon!  gasps Emily.  They are not dressed.When the Hills drift away from each other on an ocean cruise, it seems a mercy killing more than a tragic thing, even if the people they partner off with are drips, too.  Emilys man, Gordon Percy Marmont carries around photographs of himself sitting next to empty chairs, which he suggests be filled by Emily.  Freds girl the Princess Betty Amann has Clara Bows eyes and Wallace Beerys five of the clock shadow.  There is also an obnoxious fellow passenger, a dowdy spinster whom Hitchcock always introduces with a cartoonish horn cue.  Subtlety was still to come.Everything is shot in an abrupt manner, with confusing blocking and strained dialogue.  Hitchcock tries for some early comedy with Fred and his umbrella that does not come off, and Kendall seems to aim for laughs while Berry plays for tears.  When Fred and Emily break off, they are seen being jostled on a pair of wedgedtogether rickshaws, one of many clunky attempts at symbolism.Emilys the only vaguely sympathetic character, in part because she really cares about her husband and agonizes over her affair with Gordon, but mostly because she is among the first of Hitchcocks many magnetic blondes, her platinum ringlets whipping around her face like a Botticelli aboard the open deck of a Chinese junk near the films conclusion.Matters conclude with a dangerous situation as setpiece for the protagonists to come to grips with, and presumably repair their relationship.  Only they are not active participants in the resolution, and except for the fate of a friendly cat, nothing about the ending resonates.At least you get some enjoyable views of London in the early 1930s, and a chance to see Hitchcock when he was still working for food.  Rich And Strange is Hitchcock paying his dues, and learning his trade, one for scholars but not casual film goers.",
		"...this would have been what you got.Words alone cannot describe how bad this is.  If you are having trouble sleeping pop this in and I guarantee you will be out in fifteen minutes.Robert Lowery was a pretty good actor in the 40s but he is phoning it in here.  In an interview, Johnny Duncan Robin said that in one scene he and Batman had to run from the car to the house and that Lowery was doubled over out of camera range because his girdle was too tight!  Duncan looks they sure His cowl is so bad he cannot even see out of it and his ears look more like flopsy mopsy the disgruntled easter rabbit than they do anything batlike.In one scene I am not making this up, Batman substitutes counterfiet radioactive money that will burst into flames the second it is exposed to air as a payoff to some hoods.  It is radioactive so he can trace it the reason it is so highly flammable is not explained.  Well, unfortunately the thugs open the package in a cardboard warehouse we know it is a cardboard warehouse because Batman sneaks in and pushes these boxes that look to weigh about six ounces on the hoods to knock them out and soon the whole place burns to the ground.  Thanks Batman! In another scene after the Batmobile is disabled, Batman flags down a passing motorist in the middle of nowhere and takes his car leaving the man to fend for himself and telling him not to worry because if Batman smashes up the car the police will surely buy him another one!  Yes, you guessed it, said car careens off a cliff within a few short seconds.  Not that it matters much to the motorist who has probably died from exposure trying to hoof his way back to Gotham City.There is a tired subplot with Lois Lane clone Vicki Vale who is convinced Bruce Wayne is Batman she must have noticed the Batmobile parked outside of Bruces house or maybe she saw Batman and Robin running up the walk in the clearly densely populated suburban neighborhood.Everything about this serial is bad and all but the youngest in the audience will want to hurl toast at the screen.  IF you are looking for bad cinema you could not hit a better mark if you want entertainment, try the Burton Batman films, the Adam West Batman TV Series or the earlier Lewis Wilson Batman serial.",
		"he believe Steven 5th I watched this moving expecting to see him beet the crap out of some people the way he usually does.  When he is reduced to using a single judo chop between the shoulder blades to take out an opponent and the guy falls like a ton of bricks something is wrong.The plot is unbelievable as a movie, and even if you excuse the visuals, and had read this story as a novel, you would be left wondering why you had even picked up the book.Steven Segal goes through the motions and seems as if he is only doing this because he is under obligation.  He shows no effort and no enthusiasm, and in some scenes he does not show up at all.I hate to repeat other peoples comments, but the use of stock footage for cut scenes and for visuals of the aircrafts in flight is pathetic.  The condition of those scenes chopped in, is shaky and scenes themselves seemed to have deteriorated over time.  The zappruder film showing President John F Kennedy being assassinated is steadier and cleaner.My honest opinion is to tell you not to waste your time seeing this movie, it is not up to the standards of his work in the glimmer man or exit wounds.  I read one review that said the movie had a 12 million dollar budget Segal being paid 5 of that and that the movie still came in under budget.  I must concur.It is no wonder that this is a direct to DVD movie, as no conscientious theater owner would play this movie .",
		"If you watched this movie you know why I said Jesus, Jesus, Jesus.  Hehehe!!!  Every time they said Jesus, Jesus, Jesus...  I laughed thinking Jesus, Jesus, Jesus, why did I rent this movie?  I cannot believe how Oscar winners like Freeman and Spacey appeared here in the background while Timberlake and LL Cool J grabbed the screen.  WTF is Timberlake?  Dreaful acting!  I think someone like Joshua Jackson could have done a much better job!  This job was perfect for Joshua Jackson and believe me I am not a big fun of him... but I really prefer an actor, not this android called Timberlake.  And his girlfriend was shallow, hollow and annoying as hell.  I was they OK The movie was entertaining but I think Timberlake ruined it all.  It would have been much enjoyable without him.By the way, the music was OK, but suddenly every time the music appeared the movie turned into a MTV video clip with flashes, low motion and things like that.  Something misplaced for this cops movie I thought.  Maybe they wanted to make a MTV video clip for Timberlake.",
		"Flight starts General invisible General Barnes gives his top pilot Colonel Ratcher Steve Toussaint the job  everything goes well until the X77 disappears, even more literally than Barnes wanted as Ratcher flies it to Northern Afghanistan  delivers it to a terrorist group known as the Black Sunday lead by Peter Stone Vincenzo Nicoli who plans to use the X77 to fly into US airspace undetected  drop some bombs which will kills lots of people.  General Barnes is worried by the loss of his plane  sends in one man army John Sands cowriter  executive producer Steven Seagal to get it back  kill all the bad guys in the process...This American, British  Romanian coproduction was directed by Michael Keusch  was the third film in which he directed Seagal after the equally awful Shadow Man 2006  Attack Force 2007, luckily someone decided the partnership was not working  an unsuspecting public have thankfully been spared any further collaborations between the two.  Apparently Flight of Fury is an almost sceneforscene wordforword remake of Black Thunder 1988 starring Michael Dudikoff with many of the same characters even sharing the same name so exactly the same dialogue could be used without the makers even having to change things like names although I must admit I have never seen Black Thunder  therefore cannot compare the two.  Flight of Fury is a terrible film, the poorly made  written waste of time that Seagal specialises in these days.  It is boring even though it is not that slow, the characters are poor, it is full of clich?s, things happen at random, the plot is poor, the reasoning behind events are none existent  it is a very lazy production overall as it never once convinces the viewer that they are anywhere near Afghanistan or that proper military procedures are being followed.  The action scenes are lame  there is no real excitement in it, the villains are boring as are the heroes  it is right down there with the worst Seagal has made.Flight of Fury seems to be made up largely of stock footage which is not even matched up that well, the background can change, peoples clothes change, the area changes, the sky  the quality of film changes very abruptly as it is all too obvious we are watching clips from other better films spliced in.  Hell, Seagal never even goes anywhere near a plane in this.  The action scenes consist of shootouts so badly edited it is hard to tell who is who  of course Seagal breaking peoples arms.  The whole production feels very cheap  shoddy.The IMDb reckons this had a budget of about 12,000,000 which I think is total rubbish, I mean if so where did all the money go?  Although set in Afghanistan which is a war torn arid desert Flight of Fury looks like it was filmed down my local woods, it was actually shot in Romania  the Romanian countryside does not make a convincing Afghanistan.  The acting is terrible as one would expect  Seagal looks dubbed again.Flight of Fury is a terrible action film that is boring, amateurish  is an almost sceneforscene remake of another film anyway.  Another really lazy  poorly produced action thriller from Seagal, why do I even bother any more?",
		"FLIGHT takes I correct 12  out of ",
		"Flight whispering I hard The one moment of any interest to Straight guys or gay girls is that out of seemingly nowhere two hot chicks end up in a lesbian sex scene of sorts complete with huge baps on display other than that  It is mediocre stuff which is no different to many of the Michael Dudikoff BMovies I have endured110",
		"I believe Steven 5th I watched this moving expecting to see him beet the crap out of some people the way he usually does.  When he is reduced to using a single judo chop between the shoulder blades to take out an opponent and the guy falls like a ton of bricks something is wrong.The plot is unbelievable as a movie, and even if you excuse the visuals, and had read this story as a novel, you would be left wondering why you had even picked up the book.Steven Segal goes through the motions and seems as if he is only doing this because he is under obligation.  He shows no effort and no enthusiasm, and in some scenes he does not show up at all.I hate to repeat other peoples comments, but the use of stock footage for cut scenes and for visuals of the aircrafts in flight is pathetic.  The condition of those scenes chopped in, is shaky and scenes themselves seemed to have deteriorated over time.  The zappruder film showing President John F Kennedy being assassinated is steadier and cleaner.My honest opinion is to tell you not to waste your time seeing this movie, it is not up to the standards of his work in the glimmer man or exit wounds.  I read one review that said the movie had a 12 million dollar budget Segal being paid 5 of that and that the movie still came in under budget.  I must concur.It is no wonder that this is a direct to DVD movie, as no conscientious theatre owner would play this movie .",
		"Being a fan of cheesy horror movies, I saw this in my video shop and thought I would give it a try.  Now that I have seen it I wish it upon no living soul on the planet.  I feel I worth I have seen some bad cheesy horror movies in my time, hell I am a fan of them, but this was just an insult.",
		"i could not help but think of behind the mask the rise of leslie vernon a massively more amazing film when watching this because of the realistic feel to it as well as the great innovative idea. this could have been a GREAT film. the acting is...from some of the actors alright. from others...it is downright horrible.that aside the idea is great and the format is great. the story is pretty good as well, though suffering often from big blows to the logical mind.nevermind that though right?  it want it fantastic",
		"More wideeyed, hysterical 50s hypercheerfulness that gives new meaning to antisocial, pathological behaviour.  Danza and Grayson will leave you begging for mercy.It is a shame that all the people involved in the making of this movie are now dead or in nursing homes.  I kinda thought about suing them for torture.  As this movie started unleashing its shamelessly aggressive operatic assault onto my poor, defenseless eardrums, I felt instant, strong pain envelop my entire being.  That damn muscular vibrato can shatter Soviet tanks into tiny bits, nevermind glass.Why did not you switch the channel if you did not like it? , you might ask angrily.  Fair point, fair point...  The answer is that I wanted to, but the pain was so sudden and excruciating that I fell to the floor, writhing in agony.  With my last ounces of energy, I tried to reach the remote but could not.A silly little fisherman with the questionable talent of singing with an annoying opera voice is discovered by Niven, who then proceeds to pigmalionize him.  Lanza is in love with asymmetrical Grayson, but she predictably treats him with contempt until they finally hook up.  This may seem like a rather thin plot, but this noisy movie is so chockfull of singing and music that there is barely any dialogue at all.  This movie is RELENTLESS.  Forget about torturing hippies and war prisoners with Slayers Reign In Blood as in a South Park episode.  Whatever little conversation there is amongst the silly adults that infest this strange 50s musical world, it is all infantile  as if they were all 6 yearolds impersonating grownups.  I can only envy people who find movies like this funny.  It be I hilarious But let us examine this phenomenon, the 50s musical.  My best guess is that 50s musicals offered the more daydreaming idealists among us a glimpse into Utopia or Heaven depending on whether you are churchgoing or Leninstombgoing, or at least very cheesy version of these fantasyinspired places.  TTONO is more akin to a representation of Hell, but that is just me.  I do not seem to get musicals.  People talk, there is a story  but then allofasudden everyone starts singing for about 4 minutes after which they abruptly calm down and then pretend as if nothing unusual happened!  When you think about it, musicals are stranger than any sciencefiction film.Worse yet, TTONO my favourite type of pizza, btw is not just a 50s musical, but one with opera squealing.  Opera is proof that there is such a thing as overtraining a voice  to the point where it becomes an earpiercing weapon rather than a means of bringing the listener pleasure.  The clearest example of this travesty is when Lanza and Grayson unite their Dark Side vocal powers for a truly unbearable duet.  I tried lowering the volume.  I lowered it from 18 to 14.  Then from 14 to 10.  Then 8.  I ended up lowering it to a 1, which is usually so low that it is only heard by speciallytrained dogs and certain types of marsupials, and yet I STILL could hear those two braying like donkeys! Take the scene in the small boat in the river.  Danza starts off with one of his deafening, brainkilling tunes, and then... nothing.  No animals anywhere to be seen.  Even the crocodiles, who are mostly deaf, have all but left.  If you look carefully, you might even see the trees change colour, from green to yellow, in a matter of minutes.  No, this was not a continuity error, it was plain old torture of the flora.  And those trees were just matte paintings!  Imagine how real trees would have reacted.The reason glass breaks when a high C is belched out of the overweight belly of an operatic screamer is not due to any laws of physics relating to waves and frequency, but because glass is only human  hence can take only so much pain before committing suicide through spontaneous selfexplosion.  I can listen to the loudest, least friendly death metal band for hours, but give me just a minute of a soprano and I get a splitting headache.",
		"This film was recommended to me by a friend who lives in California.  She thought it wonderful I am from the area and I experienced the film as Just the way people in California think we are!  I have lived in Marietta and Parkersburg and worked minimum wage jobs there.  We laughed a lot, we bonded with and took breaks with people our own age; the young people went out together at night.  The older people had little free time after work because they were taking care of their families.  The area is beautiful in the summer and no gloomier in the winter rain than anywhere else.Aside from the if you live in a manufactured home you must be depressed condescension, the story lacked any elements of charm, mystery or even a sense of dread.Marthas character was the worst drawn.  It is doubtful that anyone so repressed would have belonged to a church, but if she had, she probably would have made friends there.  I have read reviews that seem to assume Martha was jealous of Rose because Rose was younger, prettier and thinner but if this is the case it is not shown.  All we actually see is Martha learning to dislike Rose for reasons that would apply just as much if the three friends had been the same age and gender.  We see Martha feeling left out during smoking sessions, left out of the loop when social plans are made, used but not appreciated, and finally disrespected and hurt.Just one more thing Are we supposed to suspect Kyle of murder because he had once had a few panic attacks?  Please.  This takes stigma against mental illness to a new level.",
		"I saw this back in 94 when it was finally released.  Apparently because Orion pictures was in bankruptcy, I think, the movie had not been released a couple of years earlier.I have problem remembering details partly because I have not seen it in a long time, but I do remember it as a very dull movie.  I kept debating whether to walk out of it.  The store was not at all interesting or engaging.  Was a 3rd rate America Graffiti imitation.  None make it worth One of the biggest disappointments since a local newspaper reviewer gave it a high rating.",
		"MAJOR LEAGUE BACK TO THE MINORS 1998 ½ Starring Scott Bakula, Eric Bruskotter, Corbin Bernsen, Dennis Haysbert, Jensen Daggett, Written and directed by John Warren 100 minutes Rated PG13 for language and some violence By Blake French \tBelieve it or not, in the new John Warren comedy MAJOR LEAGUE BACK TO THE MINORS there is one funny scene.  It consists of a sequence where an infuriated coach throws a baseball hard into the wall behind him only to have it hit the cement and bounce back and smash him in the face.  It is not much, but with the exception of a few oneliners, it is all this film has to offer...enough said.  This movie is not only structurally impaired, characteristically undeveloped, predictable and badly written, but also just plain bad.  Even noncritical audience members will hate this movie with all that they got.  It is it funny How many times does the same movie about sports have to be made?  Last years we saw this same material in Air Bud Golden Receiver, and as bad as that film was, this is even worse.  At least Air Bud was family oriented.  Major League Back to the Minors is too vulgar for a wholesome family to view together on a Sunday afternoon.  It is too childish for adults.  So who is this film for?  Teenagers?  Elderly?  People who are so desperate for entertainment they would rent something like this?\t The film, like many others like this, has one basic point it tries to make teamwork conquers all.  Yes it does, and what a great moral to try to prove.  Too bad we have already seen and excepted it so many times over and over have such little talent and intelligence that their cheerleaders are men in a ballerina costumes.  Where the silly announcers form their own buddy comedy routine muttering one liners to themselves like They suck, This kids fast ball is timed with an hour glass, This guy dropped out of ball for a while to find something he lostmaybe it was his mind, Somebody needs a nap, and ever see a sunset as beautiful as that play.  Where the characters have such little significance to each other that we never know them by name.  And where the only heartfelt lecture scene about teamwork is so unknowledgeable that it is almost funny.\t Major League Back to the minors is so bad; it stalls its trite ending right in the middle of a good closing sequence.  The good baseball team is on a comeback, they are about to win andthe power goes out.  I was thinking for a minute that this piece of trash had come to a conclusion, but in reality, its false final scene exists only to add minutes to the running time.  The movie basically consists of a series of unrelated sketches that throw in so many putrid jokes it is are not funny.  There is another kindoffunny line of dialogue that has a coach and a player talking to each other about why a long time outfielder is not wanted in that position any longer.  The coachs answer You are too old, too slow, and too fat.  The players reaction is to die for.  But that scene certainly does not make this movie noteworthy of you time, and certainly is not worth a cent of your money.  So here is another dreadful entr?e into this genre of film, another that is doomed with its own script, which is failed before seen, and another which is so familiar it seems like deja vu all over again.",
		"For months I have been hearing about this little movie and now I have seen it.  I find it cute Troops, Swingblade, any of the million Blair Witch parodies come to mind.  If all that these directors want is a foot inside Hollywoods door then they are doing the right thing and they should keep it up because combining plot outlines is how Hollywood makes films.  How many times have you heard the phrase, It is Animal House meets Back to the Future; It is Wall Street meets Dead Poets Society; or Shakespeare in Love meets Star Wars?  I remember when independent films meant original and daring not safe and predictable.",
		"Where is Michael Caine when you need him?  I have seen most of the many seasons of MST3K, but this rare pre1st season flick episdoe K20 is easily one of the worst movies ever made.  Three stars, Lee Majors, Chris Makepeace and Burgess Meredith, struggle through the worst batch of cinematography ever, delivering lines which must have been written by a secret Dick Cheneystyle workgroup composed of Exxon and GM lawyers trying to cut funding for mass transit and energy efficiency research.  Looks like it was filmed in almost total darkness, possibly on Super 8.  Makes Logans Run look like the cinematic Sistine Chapel crossed with Shakespeare.  I imagine it unwatchable Clearly what is needed in Hollywood is some sort of 401K which prevents the need for actors to take on bad movies like this in order to pay for their health care.  With its rights to pollute and drive theme, by the end, I am half expecting to see a Charlton Heston cameo where he delivers his cold dead hands speech.  Lee, I could have forgiven you for this in 1989, but 1981?",
		"Totally ridiculous.  If you know anything about poker, you will find it absolutely appalling but also entertaining because it is so clueless.  The nerd who made this movie is obviously very religious and knows slightly about the game of poker, but I doubt he is ever played above 36.  I think he also knows nothing of golf.  Where to start.  I have seen better productions in the Intro to Film class I took freshmen year of film school.  The actors to watch in this movie are Queen Momma, Scotty Nguyen, and the loser who can never win at poker.  Everyone else is as wooden as they come, like bad porn actors.Spoiler The man the movie starts with in the opening sequence is the only reason the film got made.  He is a railbird who does not play poker and never has a line of dialogue, but the actor is the man who obviously paid for the movie.  I cannot think of a more useless waste of money than this man shelling out for this pointless production.  It is he useless Most of the time is spent on useless side characters whose plots are not resolved in the slightest.  Queen Momma does have a showstealing scene where she throws her loser boyfriend through a window and tries to shoot his brains out.  Also the nameless Arabs in the convenience store also give brilliant performances when they debate whether to beat up or kill an older lady who robs them.  Their subtle performances are easily among the films highlights.  It makes you wonder why they bothered getting all these white people to play the leads.In conclusion, complete nonsense.  Plan 9 from Outer Space has slightly more coherency.  If you play poker though you might want to have a laugh.  Also if you are Christian you might enjoy some of the heavyhanded religious conversation that pepper the movie like pointless pepper.  I hate movies made by religious people.  Especially ones who think they know something about things they know nothing about.  It is sad that Jennifer Harman and Scotty Nguyen got involved in this travesty as I cannot help but think less of them.  They must be envious of Johnny Chan for getting in Rounders.",
		"There is something frustrating about watching a movie like Murder By Numers because somewhere inside that Hollywood formula is a good movie trying to pop out.  However, by the time the credits roll, there is no saving it.  The whole thing is pretty much blown by the cop side of the story, where Sandra Bullock and Ben Chaplins homicide detective characters muddle through an awkward sexual affair that becomes more and more trivialized the longer the movie goes on.  Although Bullock is strong in her role, it is not enough to save the lackluster script and lazy pacing.  Ben Chaplins talents are wasted in a forgettable role he did much better earlier in the year in the underrated Birthday Girl as well as Chris Penn, who has a role so thanklessly small you feel sorry for a talent like him.  Anyway, the plot really is not even a factor in this movie at all.  The two teen killers played by Ryan Gosling and Michael Pitt are the only real reasons to see this movie.  Their talent and chemistry work pretty good and they play off of each other quite well.  It is they much Barbet Schroeder is treading way too safe ground here for such a seasoned filmmaker.  Bottom Line it is worth a rent if you are a genre fan, but everyone else will live a fulfilled life without ever seeing it, except maybe on network TV with convenient commercial breaks.",
		"Lets enter the world of this movie for a second, so you can better understand the type of movie we are dealing with here.Edison is one of those really stupid movies where the bad guy and his goons have been letting loose 50,000 bullets shooting at the good guy behind walls and pillars, shouting at them, and then finally get to the good guy face to face and instead of killing him......instead of wasting this guy that has caused you SO MUCH grief....instead of just walking up and POP!..... What do you do?  The bad guy.....he talks to him.  He grabs the good guy and talks to him while holding his gun.  THEY HAVE NOTHING TO TALK ABOUT!  SHOOT HIM!  SHOOT HIM NOW!  But he talks to him anyway.  Oh another thing.  At the end, a newspaper says PULITZER PRIZE WINNER STORY RIGHT HERE or something right above on a front page of a paper, when its like the first time the story is printed.  So how in the heezy did someone win a Pulitzer for it that fast?  Yea, you know those types of stupid movies?  Yea get Mr cool Eh, something about scandals involving the city Edisons fictional special unit police force called F.R.A.T.  I swear I am not making this stuff up which was supposed to be a obvious play off of S.W.A.T.  Anyway little journalistic super singer boy Justin Timberflake smells something foul afoot after a murder involving 2 undercover cops from FRAT, and he goes scurrying off looking for a story, gaining his boss Freeman trust along the way while they both unravel something even bigger and sinister than what they both thought. blah blah blah.  Its like a bootleg pelican brief meets a halfassed training day.The pacing was slow and off, the script was horrible, and the acting was extremely uninspired.  It jumped everywhere without going anywhere.  People get put in comas and you forget about them.  Everyone in this movie just did not THINK.  Damn what a stupid movie.  Its becoming harder to write any sort of review for it because the movie left my brain the second it ended...No lie Basically, do NOT waste your time!",
		"A horribly pointless and, worse, boring film.  Stranger has nothing new Will Ferrell is totally wasted in what he presumably hoped to be his answer to Jim Careys Truman Show, and substitutes his usual shouting routine admittedly very funny if you discount Talledega Nights for, well, pretty much nothing.  Emma Thompson is no more than mildly irritating that some reviews I have read here are talking her up for an Oscar nomination is laughable whilst Maggie Gyllenhaal does a passable job with a very weak script that allows nothing beyond establishing her character as a former law student who dropped out of Harvard to become a baker because she liked making people happy.  Please.  That she ended up falling for Ferrells character is utterly ludicrous.Marc Forsters attempts to jazz up the film using computer graphics only serve to highlight the uninspired the material he has to work with.I had the choice of either going to watch The Prestige for the third time or seeing this.  I wish I would opted for The Prestige.",
		"STRANGER THAN FICTION angered me so much, I signed up on IMDb just to write this review.  STRANGER THAN FICTION is a surprisingly complex, touching and thoughtprovoking movie until the very end.  Once you suspend multiple lapses of logic why did not Will Ferrell hear Emma Thompsons voice 10 years ago when she fist started writing her book?  The phone rang.  The phone rang again.  How could she not know it is him calling?  etc., the movie challenges ones thoughts about mortality, fate, and sacrifice.The brief history of literary themes provided by Dustin Hoffman should especially entertain former English majors.  And Maggie Gyllenhaal is always a pleasure, even though Will Ferrell might just as easily be an ax murderer as a bumbling soul.  Her quick trust of him is a mighty big leap of faith.Ah, but the ending.  Until the very end, I would have given 9 out of 10 stars to this movie.  The movie as a metaphor for lifes journey, as a tribute to the notion of writing true, as a reminder that great literature is either comedy or tragedy, but not both, is outstanding.  The entire movie leads the viewer to understand and accept the moment of Will Ferrells fate.  And no matter how endearing a character he may have become, we know full well why we will accept the ending.  The last act occurs, the screen goes white, the credits roll.  A profound and powerful end to an almost perfect film.  An end that would have been debated for weeks.NO!!!!!!!!!!  No credits rolled.  Say it is not so.  Say Hollywood did not tack on another 10 minutes of crap that completely undermined the integrity and heart of the movie.  Dustin Hoffman got it right when he said, It is no longer a masterpiece; it is OK.  An apt review of the movie.  Except to me, it was not even OK.  I was so offended about the betrayal of writing true, about the decision to pander the film that I actually burst into angry tears explaining this on the ride home from the movie.  I do not often cry.  I could care less about most movies, but I am still angry about this one.My questions for Zack Helm, the writer, are this did the original movie end when the screen went white?  And were you forced by the vapid movie powersthatbe to tack on an ending unfaithful to the core of the movie?  Or did you tack that maudlin ending on yourself?  I have you brilliant I hope your original script ended the movie the first time.I know Zack Helm will never see this review, and I have been unable to find a contact for him to ask myself.  But, please, moviegoers, am I the only one who feels this way about STRANGER THAN FICTION?  One good thing came from me seeing this movie I doubly admire LOST IN TRANSLATION now.",
		"The movie started off strong, LL Cool J Deed as an undercover police officer, with partner Sgt.  Lazerov Dylan McDermott from the Practice, possibly miscast as a bad guy?  committing robbery and murder.  Deed refuses to kill the drug dealer, which sets up the conflict of a dirty cop with a conscience.  The other big names Freeman, Spacey et al are well cast and the movie shows promise.The movie begins to fall short as soon as Justin Timberlake Pollack is introduced.  Given the opportunity to make a good movie that people will possibly see repeatedly, or one that teenage girls will go and see the once because of Timberlake, I would choose the former.  Even talented actors have to work hard at their craft; Timberlake is NOT talented and no amount of hard work can save him.  I have he talented Everything he did in this film was unconvincing.Just because a singer sells millions of records and sells out stadiums, it does not automatically translate that they can act successfully in feature films.  Even hardcore NSync fans will not be able to ignore the obvious lack of acting talent.That aside there are a few plot holes, such as Pollacks sudden sniper ability and deadly operation of warehouse machinery.  This movie had so much promise.  Thoroughly disappointing.",
		"Now I will be the first to admit it when I say something that may be blasphemous or unfair, so I would like to apologize in advance for my ranting about how much I disliked this movie.That about sums it up too.  I disliked this movie.  To be more specific, I disliked the concept of this movie.  The cinematography was good.  The mood was nice.  And the acting was satisfactory.  However, the story is fatuous, unacurate and misleading.  It is also offensive.I am a quarter Cree Indian, and for some reason I feel insulted, on a personal level, by the nature of Whitakers character.  First of all, he is a black guy.  And this is not a racist remark, I swear.  The thought of a White, Hispanic or even Native American swinging a katana on a rooftop offends everything that the katana represents.  The katana represents the soul of a Samurai, imbibed with the souls of his ancestors who guide and protect the Samurai.  For Ghost Dog to use his guns instead of the Katana is also an insult to the blade and the souls inside, and where the heck did he get a Katana anyway?  It must be one of those replicas, which insults the Samurai caste even more.Also, Ghost Dog showed no honor.  Near the end of the movie, he shoots a bodyguard in the back through a window and then assassinates a man by shooting him in the face through a faucet drain.  Not only is this a cowards way to kill an enemy, it is more like a ninjas way; silent assassins; a group that samurais deny exists, but hates nonetheless.Then he tries to kill his boss, when he finds out his boss is a baddie.  You know he bad He kills himself, to prove that he would rather die then lower himself to the level of his doggish master.Everything about the character was a giant contradiction to the real code that all Samurai adhere to Bushido.So, we have great cinematography, good ambiance and soso acting encompassing a satiricle plot and premise, which unfortunately is the most important aspect of it , making it an unsatisfactory overall film, and an insult to everything a honorable bushisamurai holds dear. 2.510 Bleah",
		"To be honest i had heard this was pretty bad before i decided to watch it, but i am never one to let others influence my viewings, in fact i am more likely to watch something out of defiance!.  Bullwhip had Rhonda interested The picture is not very good, and is in fact very morally dubious, all the characters are corrupt and shifty in one way shape or form, all motivated by greed or egocentric victories, this is all well and good if the surrounding film can do justice to a bunch of despicable people and create a taut climax shuddering picture.  Sadly it does not, and as the finale fills your eyes with sugar you cannot help shouting out that you have been cheated into watching a pretty bad film, nobody in the cast come out with any credit, with lead man Guy Madison painfully wooden in the extreme.Not even the lovely Rhonda can make me recommend this to anyone, 310",
		"Frankly I am rather incensed that on the basis of the dazzling reviews attributed to Steven Smith I wasted nearly two hours on his debut offering.  Have they all been written by his pals?  The action clunks along, the music is irritating and over used, the script is simply dire and the actors with the exception of the gardener mediocre at best.  I saying it brilliant Yes, it is his first film, low budget etc.   I get it, but it is also out there for members of the public to purchase and it is just not up to scratch.",
		"I will keep this short; thanks to Greg for helping me to put this succinctly Captivity is about a guy who drugs a girls drink, imprisons and tortures her, then poses as a captive to have sex with her.  That is the single twist and punchline of the film.  It is torture as slow motion date rape.  And, it is not even a good movie.  It is it good Why NO ONE had the cojones to step up and say, this is garbage, and this is why, is beyond me.Do not give your money to these pooppeddlers.",
		"The documentary revolves around Eva Mozes Kor, a holocaust survivor, part of Mengeles experiments on twins, consisting primarily her version of what happened at Auschwitz, and a comparison of the emotions of the other survivors of the twin experiments.  The movie obviously had great reviews.  It is one of those topics that no one dares to voice a contrary opinion about.I too, for a large part of the movie, got sucked into the emotion that the moviemaker so obviously wanted the viewer to concentrate on.  One of the user reviews on IMDb by Eric Monder obviously having nothing critical to say about the issue on a public forum could only find the sweetest nectar.  In one of the many dramatic sequences, as a group of Jews argue with Kor at a Jewish center, the meaning of the word forgive is even debated, but the isolated and outnumbered Kor holds her own But by this time, the sappy hold that the movie had on my dormant emotional repertoire had let loose enough that I could see clearly once more.  After the strongwilled Eva Kor forgives her Nazi captors the movie begins to delve into what forgiving is all about, at least from the viewpoint of Kor.  The movie goes about following her, past her public statement forgiving the Nazis and into new territory.  To me, this was the meat of the movie, surrounded by inedible fat of her act of forgiveness.  Obviously, it was a very sick cow.On a mission to test her theory of forgiveness, in order to heal wounds of the past, she makes her way to the promised land to meet with some Arabs, to discuss with them the issues that they face and to see if dialogue cannot lead to a better understanding of the situation and heavily interspersed with debates and discussions with Jews in the US on her act of forgiving the Nazis, including one at a Jewish center in Chicago.  From then on, anyone not so teary eyed that they cannot see the screen will find it hardpressed to miss the obvious contradiction in her statements.Firstly, you immediately notice her body language, defensive and unwilling to listen in a room full of Arab scholars and teachers.  Her comments about how she feared that they might kidnap her shows how much of a waste of time, effort and money the entire act was.  A rather annoyed Dr Sami Advan Professor of education at Bethlehem University gets it just right when he tells Kor off for a statement she makes about how she would rather be asleep in her apartment.Finally, the debate at the Jewish center in Chicago, where she is grilled on the meaning of forgiveness and her right to do so, in the wake of those that continue suffering through the trauma of the acts.I will cut to the chase.  By the end of the movie, I was hoping I had not chosen to watch the movie.  The movie was badly made, failing to delve deeper into anything about Auschwitz apart from the purely trivial, just sufficient to make sure the holocaust is refreshed in the viewers memory and to incite a barrage of tears.  It showed Kor unable Her discussion abilities were limited to parroting her stance on forgiveness at best to a complete unwillingness to listen or participate.Lastly, is everyone so retarded today that they cannot notice the difference between making peace and forgiving?  Quoting another IMDb user, I do not see her forgiveness as being weak quite the contrary, she just wanted to relieve its hold from her soul, she wanted the suffering to be over, so she let it go.  That would be the perfect laymans definition of MAKING PEACE.I guess, in a world of propaganda, blind faith and political correctness, there is no room to question those that have gone through more than the human mind can fathom.P.S.  The dictionary certainly should go into all those Bookstobuy lists everyone keeps making.",
		"This movie was made by a bunch of white guys that went to school together.  Well there is nothing wrong with that, except it looks like it was made by a bunch of white guys that went to school together. 90 percent of the cast are white males about same age.  It is almost like watching a bunch of guys at boys camp who turned the camera on themselves.  The movie has no plot.  It simply repeats the same action of blood bath after blood bath.  There are some funny scenes and comedic bits.  But they do not redeem the flat monotony.The graphic cartoon scenes are used to cover the stuff that was obviously beyond their budget or resources to do, and not done very well at that.  Anything that cannot be done with white guys running around on the beach covered in blood is done with cheap animation.I went to see this film after seeing the trailer, which makes it look like a Tarrentino piece.  Well, the trailer scenes are as good as they ever get.  Ther rest of it just repeats the same kind of mundane, inane comedy.  It works at times, but it gets boring after the same stuff comes at you over and over.  It is more like a string of Satuday Night Live skits than a movie.  It is a hityouovertheheadwithit kind of comedy.  I can see where the story idea is intriguing.  But, in this film post apocalyptic America is much like Medevil England.  In fact Wheatlry says the story ideas came from that era.  He plans to make a Part 2.  I guess he thinks he is Tarrentino or maybe doing a parody thing.At the opening in LA, Wheatley mentioned he will bring back pretty much the same cast in part 2.  He was he sure",
		"This is the biggest pile of crap I have ever watched.  DO NOT RENT!  The makers of this movie should be band from ever making another movie.  It starts with some what of a plot, then fades fast to nothing.  I think I dry The actors were awful, the plot faded fast, filming left to much work to be done.  Not one good thing to say about this crap movie.  If you rent this movie you will waste your money.  I really enjoy National Lampoon movies, but this was a waste of time.  Learn to write, learn to act, learn to produce, and learn to direct.  I feel I should sue these aholes that made this movie for money wasted on rental cost and time lost.",
		"End of the World is an uneventful movie, which is odd since it is supposed to be about the total destruction of the earth.  The main character is some kind of scientist, I am not exactly sure what kind.  He has two jobs at a government?  facility guarded by four security men.  His first job is monitoring transmissions to and from space although this actually seems more like a hobby he does when not working on job 2.  Job 2 requires him to put on a protective suit and go into a dark room...at least that is the best I can figure.  Apparently the plant is not exactly topsecret, as the scientist brings his wife there.  She hangs out they are on their way to a dinner while he discovers a message from space Major Earth Disruption, repeated over and over.  He says it able So they leave and go to the party !?!.  Moments later he finds out that China has suffered a major earthquake.  From there, the movie goes... nowhere!  Yes, Christopher Lee is in it, but that really does not help much.  Besides, Lee gives a lackluster performance along the lines of his appearance in Howling II.  This movie is boring, but it has enough stupid elements that you might want to suffer through it once if you like Christopher Lee or Zgrade scifi.  Plus, there is lots of stock footage of the earth being destroyed.",
		"This is one of the most boring movies I have ever seen, its horrible.  Christopher Lee is good but he is hardly in it, the only the good part is the opening scene.Do not be fooled by the title.  End stopped it close",
		"It is letters dark evil aliens disguised as nuns!  tidal waves!  earthquakes!  exploding cars!  exploding coffee machines!  and as a climax the entire planet blows up.  How on earth does this film managed to be so incredibly, mindnumbingly DULL?  The answer, my friend is because 90 of this movie is made up of establishing shots, most of them involving long tracks, pans, or zooms in combinations, or occasionally all three, that do nothing except give the crew something to do.  There are endless shots of our protagonists driving, getting in and out of cars, driving again, walking around looking at stuff, getting in cars and driving...  I just sat there watching endless parade of nothingness in stupefaction muttering Say something, please somebody, just say something...  DO something... anything!... The dialogue, when it does come, is terrible.Maybe their minutes are measured on a different scale than ours. was a typically meaningless line.  The script culminates in the destruction of the world by stock footage, justified in this speech from Lee as the head alienThe planet Earth has emitted an overabundance of diseases, they are contaminating the Universe.  All the planets light years away from here will suffer unless it is destroyed!  This is is Neanderthal SF script writing.  This is the sort of motivation you find in the sort of 1950s Japanese monster suit movies aimed at 7 year olds.  It is, and I collect such things, the most godawful line from an English language SF movie since Buster Crabbe retired.  It beggars belief that this movie was released in the same year as Star Wars and Close Encounters.Lee, who always struck me as a smart, useful actor with a sure knowledge of his limits, delivers his lines as if he is going to kill his agent for getting him into this pile of drek.  I do not blame him.",
		"This movie was terrible! I rented it bad",
		"This really should deserve a O rating, or even a negative ten.  I watched this show for ages, and the show jumped the shark around series 7.  This episode, however, is proof that the show has jumped the shark.  It is Beavis ridiculous However, there is such thing as ridiculous as in this is the worst thing I have ever seen.  And indeed, this is the worst episode of Stargate I have ever seen.  It is absolutely dreadful, and this coming from someone with a stargate in her basement.Makes me want to sell all of my stargate props, most seriously.",
		"It has its merit is; Morvern Callar is both the merits and the disappointments.  She is so enigmatic, so original.  Is it her method of dealing with the pain of a lost one that is making her so distant and unrelatable?  Or is she as one reviewer called her a revolutionary?  Personally I would call her dysfunctional.Morvern is completely detaching herself.  Disposing of her boyfriend, not thinking of informing family or using the money he gave her for a proper funeral, she selfishly splashes out on a trip to Spain.  She is seems so devoid of anything relatively human bar greed.  The only element that enables the audience see the human side of her is her close friend she takes on holiday with her.  Although by the end her friend is dumped and Morvern has nothing that ties her down to humanity.  She have Spain superb It is little over 90 minutes but feels a lot longer.  They manage to make Morvern seem interesting to grab your attention but do nothing with her only alienate her from you more to the point where you do not care about the characters or the film.",
		"It has its merit is; Morvern Callar is both the merits and the disappointments.  She is so enigmatic, so original.  Is it her method of dealing with the pain of a lost one that is making her so distant and unrelatable?  Or is she as one reviewer called her a revolutionary?  Personally I would call her dysfunctional.Morvern is completely detaching herself.  Disposing of her boyfriend, not thinking of informing family or using the money he gave her for a proper funeral, she selfishly splashes out on a trip to Spain.  She is seems so devoid of anything relatively human bar greed.  The only element that enables the audience see the human side of her is her close friend she takes on holiday with her.  Although by the end her friend is dumped and Morvern has nothing that ties her down to humanity.  She may as well have killed herself.Despite managing to make Spain look as gloomy and bland as the UK the directors shots were superb, the lighting and color made the film visually stunning.It is really a shame the movie has nothing in it that keeps interest.  It is little over 90 minutes but feels a lot longer.  They manage Morvern interesting",
		"When a movie of a book seems pointless and incomprehensible, the cause can invariably be found in the book either it was pointless to start with, or the point is one not easily conveyed to film, or the movie missed the point, which is the most frequent of these results, and the easiest to happen, especially when the point is one not easily defined.  The book Morvern Callar has a point; every reader of the book must have felt this, and felt as if he had gotten it; but I suspect most of them could not state it in words.  I am not sure I can, myself, but perhaps it comes to this, or something like it Things come, things go, such is life, but we carry on; or at any rate some of uspeople like Morverndo.  No doubt a more erudite critic could construct a more adequate definition.  But the important fact is that there is a pointpossibly the sum of the entire story is the pointand that this would have been the main thing to keep in view, and to carry over, in adapting the story to film.  The maker of this film evidently missed the point, and does not substitute one of her own; and so the film is about nothing.This is not the usual complaint of a booklover that his favorite text has been violated.  The merit of the book is something I conceded grudgingly in reading it I found it a bloody nuisance, and an occasion for kicking the author in the pants and getting him in to finish the job properly.  The narrative is supposed to be the work of the halfeducated Morvern, but that illusion is constantly dispelled by a dozen different types of literary effect, as if the author were poking at her with his pen; there are inconsistencies of style and tone, as if different sections had been composed at different times; and any conclusions I could reach about Morvern had to remain tentative because it was uncertain which implications the author intended and which he did not for instance, despite Morverns own selfcharacterization as a raver, am I wrong that in the end she remains essentially a workingclass Scots girl, and beneath her wrapping of music downloads not so different from those of generations past?  In any case, despite my irritation at the author, I could not deny that his book stuck with me; and what I could not get out of my head was his characters attitude, her angle on the world, which was almost as vivid as a Goya portrait.  Morvern is the kind of person who is always encountering situations at once rather comic and rather horrible; occasionally she invites them but more often they land on her, like flies, so that much of her life consists of a kind of gauche but graceful sloggingthrough, unconsciously practical and unconsciously philosophicaland that does not begin to describe it idiosyncratically enough.  The complex of incidents and of Morverns responses to them are the substance of the book, and its achievement, in exposing a crosssection of existence it would be difficult to illuminate otherwise; for all my dislike of the book, I can see this.The Morvern just described is not the Morvern of the movie; or if it is, most of her is kept offscreen.  An actress who might have been a good fit for the character, had she been the right age at the right time, is Angharad Rees, from the old TV series Poldark.  Samantha Morton, then, would seem like good casting she is rather the same sort of actress, and in one of her earlier movies, Jesus Son, she played a girl who with a few adjustments could have been turned into this one.  Unfortunately, as the film turned out, she does not have the character from the book to play.  For one thing, the book is one that, if it is to be dramatized, virtually cries out for monologues by the main character to the audience; without her comments, her perspective, her voice, the story loses most of its meaning.  It has they grotty In short, the filmmaker chose for some reason to turn a brisk, edgy seriocomic novel into a genteel art TV film, and chose as her typical image one of Ms.  Morton languishing in a artistically shaded melancholy; as if the outing Morvern signs up for were a tour of the Stations of the Cross.  This is not at all what the book, or the Morvern of the book, was about.  For another thing, the Morvern of the movie is not Scottish the actress said in an interview she had not had time to study up the accent, and she ought to be it is important that she, her family, and her mates are all from a single place.  And finally the film is missing the end of the story Morverns spending all she has and coming home to icy darkness it is winter, the dam has frozen, the power has gone out, and the pub is dark.  Minus this, and minus all of the rest, what is left is a failed art film, a dead film, about a subject whose strength lay precisely in her refusal, or native inability, ever to give in to being dead.",
		"Lynne Ramsey makes arresting images, and Samantha Morton can summon feeling with a gesture.  So what a drag to discover their talents wasted on this mannered, pretentious lark.  Ramsey cannot bring Callar to life.  Her attempts are too arty and oblique.  Repeatedly her camera lingers on long silent shots of the agonizing actress as if Mortons obliterated gaze alone could supply character.  We think it round But how will it do so if she rarely speaks?  Without the novels interior monologue, the celluloid Morvern Callar is nobody.  Small wonder Ramsey has Morton undress often.That said, the first ten minutes were so impressively acted, shot and edited that my hopes were soaring.  Give the film that much it knows how to make promises, if not how to keep any.",
		"My dad is a fan of Columbo and I had always disliked the show.  I always state my disdain for the show and tell him how bad it is.  But he goes on watching it none the less.  That is his right as an American I guess.  But my senses were tuned to the series when i found out that Spielberg had directed the premier episode.  It was I thankful I went through his DVD collection and popped this thing in when i came home for a visit from college.  My opinion of the series as a whole was not swayed, but I did gain respect for Spielberg knowing that he started out like most low tier directors.  And that is making small dribble until the big fish comes along get the pun, HA,HA.  Like Spielberg did.  It is like Jesus before he became a man.  Or thats at least what I think that would feel like.  Any ways if your fan of Columbo than you would most likely like this, even though it contains little of Peter Falk.  I attribute this to the fact this is the start of the series and no one knew where to go with it yet.  This episode mainly focuses on the culprit of the crime instead of Columbos investigation, as many later episodes would do.",
		"Comments contain I annoying But now, in tonights episode,David is trapped with a paranoid, nut job who is an OBVIOUS amateur with a gun, in an elevator and....HE Cannot DISARM HIM.  A trained, experienced field agent who has been 1st through the door many times and is experienced in handtohand fighting, Cannot TAKE OUT A NUT JOB.  Not when said nut job blinks, looks away, drops his head, closes his eyes; not even when he looks up at the fiber optic wire wriggling around the ceiling like a stripper on a pole for 20 seconds.Then the scene came that let me know that as much as I enjoy learning from the chubby, frumpish but very charming Charles Epps and his sexy sidekicklove interest Amita, my Friday nights will be better spent otherwise engaged.  Don gives David the distress word that is the code for The st is about to go down; David is ready, they kill the lights, drop the elevator, startle the nut job and......David CANNOT DISARMKILLBEAT INTO SUBMISSION THE NUT JOB.  The bad guy ends up with BOTH GUNS, David ends up SHOT.I am done.  Hope the NUMB3RS are fun.",
		"As someone who likes chase scenes and was really intrigued by this fascinating truelife tale, I was optimistic heading into this film but too many obstacles got into the way of the good story it should have been.THE BAD  I am a fan of Robert Duvall and many of the characters he has played, but his role here is a dull one as an insurance investigator.The dialog is insipid and the pretty Kathryn Harrold is real garbagemouth.  From what I read, there were several directors replacing each other on this film, and that is too bad.  You tell things right I could not get involved with Treat Williams portrayal of Cooper, either.  He should have been fascinating, but he was not in this movie.  It is also kind of a sad comment that a guy committing a crime is some sort of folk hero, but I admit I wound up rooting for the guy, too.Not everything was disappointing.  I cannot complain about the scenery, from the lush, green forests of Oregon to the desert in Arizona.I would like to see this movie remade and done better, because it is a oneofakind story.",
		"I believe people funny Shifting the attempts at humor among cruelty, disgust and stupidity, There is Something About Mary leaves little reason to stay until the end.  Sure, Cameron Diaz is very pretty, but that is never going to be enough to save a movie.  Ben Stiller tries hard to work within the plot, and is obviously very talented, but the movie is a loser.Not once were any of the scenes believable.  The shots were badly timed and poorly framed.  The Farreley brothers should be kept away from making films at all costs.  I check IMDB to see what they are working on just so I know what to avoid.210; the bonus is from the one time I smiled.  It is not like I am immune to humor or alone in my opinion.  My wife hated it, too.  The next day we saw Rush Hour and laughed ourselves silly.  This movie just stunk.",
		"I cannot believe that people thought this stinking heap of trash was funny.  Shifting the attempts at humor among cruelty, disgust and stupidity, There is Something About Mary leaves little reason to stay until the end.  Sure, Cameron Diaz is very pretty, but that is never going to be enough to save a movie.  Ben Stiller tries hard to work within the plot, and is obviously very talented, but the movie is a loser.Not once were any of the scenes believable.  The shots were badly timed and poorly framed.  The Farreley brothers should be kept away from making films at all costs.  I check IMDB to see what they are working on just so I know what to avoid.210; the bonus is from the one time I smiled.  It is I immune My wife hated it, too.  The next day we saw Rush Hour and laughed ourselves silly.  This movie just stunk.",
		"To be honest at the time i first heard of this show i though it may be a bad idea to make a show that makes Muslims use racial jokes on themselves but it is the Exact opposite.  I realized that the show doing that can help people understand that if a Muslim uses s a word like this in real life it does not mean it is a terrorist thing.  It show people bad Being a Muslim i know that stuff like this do not usually happen, but they do and many people think bad things about Muslims or Afghanistan or Iraq, its not right things are not like that. people will see how we are poorly treated by watching this show and it may make them think on how the act.  I am glad a show like this came on the air.  There are many shows that Piotr Muslim people as terrorists,many people do find them funny to my opioion it is OK to do it now and then because prety much everything is made fun of who are we to say you can not make fun of that is unfair, but it is done to often and really gives Muslin people a bad name.",
		"I was really hoping that this would be a funny show, given all the hype and the clever preview clips.  And talk about hype, I even heard an interview with the show is creator on the BBC World Today  a show that is broadcast all over the world.Unfortunately, this show does not even come close to delivering.  All of the jokes are obvious  the kind that sound kind of funny the first time you hear them but after that seem lame  and they are not given any new treatment or twist.  All of the characters are onedimensional.  The acting is  well  mediocre I am being nice.  It is you white Not that making fun of white people is a problem  most of the better comedies are rooted in that.  It is only a problem when it is not funny  as in this show.Canada is bursting with funny people  so many that we export them to Hollywood on a regular basis.  So how come the producers of this show could not find any?",
		"I was really hoping that this would be a funny show, given all the hype and the clever preview clips.  And talk about hype, I even heard an interview with the show is creator on the BBC World Today  a show that is broadcast all over the world.Unfortunately, this show does not even come close to delivering.  All of the jokes are obvious  the kind that sound kind of funny the first time you hear them but after that seem lame  and they are not given any new treatment or twist.  All of the characters are onedimensional.  The acting is  well  mediocre I am being nice.  It is the classic CBC recipe  one that always fails.If you are Muslim I think you would have to be stupid to believe any of the white characters, and if you are white you would probably be offended a little by the fact that almost all of the white characters are portrayed as either bigoted, ignorant, or both.  Not that making fun of white people is a problem  most of the better comedies are rooted in that.  It is it funny So how come the producers of this show could not find any?",
		"If you are looking to be either offended or amused or both, you will probably have to look elsewhere.  LMOTP really is not even very thought provoking beyond rehashing the usual silly clich?s.  At the end of the second episode I felt a little embarrassed that I actually sat through the contrived mess.Beyond the thinly veiled gimmicky premise thats attracted all the initial attention to it in the first place it is just another lame, innocuous and antiseptic attempt at commentary and entertainment that the CBC typically excels at producing.  And once the ZOMG MUSLIMS IN RURAL CANADA ROFLMAO!!  hype is it enjoyable Other shows have better addressed the issue of culturalethnic dichotomy in western multiethnic societies.  LMOTP will never rank among them in entertainment or insight.",
		"I think the show had a pretty good concept to work with.  But the execution was poor.  The script is poor and acting is bad.  There were many issues that could have been portrayed in a better way, like the protest against gay marriage or finding the graveyard.  The show cannot be properly termed as comedy show as it lacks humor miserably.  I should say this show was barely successful in putting the life of Muslim community to some extent.Till now second season is worse than the first one.  I had my high Still I appreciate CBC for putting up such concept in front of the viewers.  Anyway I wish best of luck for the future.",
		"I rented it hard I am a huge Plath fan and this movie was a complete disappointment.  The Bell Jar 1979 is by far one of the worst movies I have ever seen.  The script is horrible, not because it strays from the original novel text, but because it strays without focus or intent.  The scenes are illconstructed and do not lead the viewer anywhere.  What is with the hokey voice over of Plaths poetry?  Lady Lazarus has little do with Greenwoods situation; Plaths poetry was completely misused.  Marilyn Hassett is completely unbelievable as Esther Greenwood or any 20 year old for that matter partly due to casting she was 32 during filming, the age Plath was when she DIED and partly due to the fact that she cannot act.  Hassett is all emotion, no craft, no skill.  The direction is mediocre; the director simply covers what is there, which is not much.  The only reason I am giving the film a 1 is because 0 is not an option.  Sorry Sylvia, you will have to wait for someone else to adapt your fine work into something more fitting.",
		"We all know that some of the greatest movies of all time were based on books.  While not particularly accurate adaptations, these movies were nonetheless excellent films.  Some great examples are the Harry Potter series, the Lord of the Rings trilogy, and, to a lesser extent, almost every Disney film ever made.  However, I must regretfully announce that A Wrinkle in Time is not one of those movies.  Not only does it fail to meet some of the most basic expectations of Madeleine LEngles fan base, it manages to defy the standards of scriptwriting, acting, special effects and, ultimately, respect for the audience.  Mind you, I am not trying to be mean; on the contrary, I went into this affair with an open mind.  I figured that a madeforT.V. movie would make up for its lack of razzledazzle in its script.  After all, the Star Wars spinoff Ewoks was decent, if a little silly.  Come to think of it, the original Star Wars was made on a lunch money budget, and look where it took George Lucas!  However, from the first scene onward, disappointment started enveloping me as if I would gotten too close to the Black Thing while tessering.  The same way Greedo shooting first became the symbol of the Star Wars Special Edition of 1997 a disaster of monumental proportions involving a disgruntled director making several hideous changes to a beloved classic, Mrs.  Whatsit has officially become my personal symbol for the confusion and stupidity that is A Wrinkle in Time.  The reason for this is the fact that she has been mutated beyond belief.  Aside from the slightly controversial decision of casting Alfre Woodard Star Trek First Contact and Radio as our favorite starturnedmentor, the filmmakers decided it appropriate to introduce her as a crow.  That is right, a crow.  Moreover, the heavenly centaurion form of this greatly beloved character has been hacked at by what looks to be a demented eightyearold; the majestic halfman, halfhorse with wings has become a huge human head with a creepy smile mounted awkwardly on the bowlegged body of a horse that happens to be sporting a pair of wings in the middle.  Had I been five, this would have psychologically traumatized me for life.  The worst part is the fact that when it spoke, it was shown from behind so as to avoid the responsibility to lip sync, resulting in a scene that was spent looking at the back of its head and seeing a single, unmoving cheek, thus rendering the piece of special effects less believable than E.T.Having gotten the most painful part out of the way, I must go on to the tearinducing one the characters, the acting, and the story.  I had Meg laughable She was always a slightly anxious, humorously pessimistic math genius who quite simply could not have cared less about the imports and exports of Nicaragua.  In the film, she is an unpleasant knowitall for whom I have no sympathy whatsoever.  In fact, she makes me feel sorry for poor Mr.  Jenkins, her school principal, who continuously has to deal with her.  Calvin, the kind, intelligent kid who everyone thinks is a jock has becomea jock!  The irony is horrible.  As for the memorable Happy Medium, they took the pleasant old woman who liked to look at happy things and replaced her with a being who is above gender and likes to look at funny things, such as girls falling off of swings.  The only three people I can think of who did a decent job are Charles Wallace, Mrs.  Whatsit and the Man With Red Eyes nicknamed the Dude With Red Eyes due to his complete reinvention as a character.The story is a mess.  A good comparison to this aspect of the movie is Harry Potter and the Prisoner of Azkaban, which did not do a good job of retelling the story found in the book, yet kept the sole of the original work.  Here, the sole of the book is having a pleasant chat with Hades down in the underworld, apparently unaware that its body is being destroyed.  As the Dark Lord complements the sole on how well it showed that truth has to be felt and not seen, the flatnosed wookies of Ixchel who replace the wondrous beings who hold Aunt Beast among their ranks tear the spine up.  As the God of the Dead notes how subtle the terror of the Earthlike Camazotz was, the torn pages are scattered in the sandstorm and lost in the darkness of the land of evil.  I am very sorry that this film exists.  I do not believe that the actors were genuinely bad.  It is the way the characters are written that ruins it.  A Wrinkle in Time deserved to be adapted by Lawrence Kasdan, directed by George Lucas or Steven Spielberg, enhanced at Industrial Light and Magic, scored by John Williams, given its sound at Skywalker Sound, edited by THX and marketed by Twentieth Century Fox.  In its current state, the film is unworthy to be shown to selfrespecting people.  Even Madeleine LEngle thought it was bad.  The book was Good, the film was Bad, and Mrs.  Whatsit was Ugly.Score 0.110 If I could ProsThey got the names right.  Cons It had horrible problems with the Cliffs Notes level of adaptation, script, acting and special effects, not to mention lack of evidence of ever having read the book.  Oh, and the main coverposter has a picture of the three main characters riding a flying horse over a castle.  Some might say that this symbolizes high adventure.  I say it symbolizes the irresponsibility of the cover artist who did not even bother to Photoshop Megs arm on properly.",
		"This movie barely followed the story line of the movie.  All of the fascinating points in the book did not even exist in the movie.  They ended up turning it into a cheesy tween Disney movie crush story between Meg and Calvin.  It was so bad it should have been Hillary Duff playing the part, or one of the likes.  This movie was nothing more than an insult to the intelligence and mysticism of the book.  I believe Disney cheap If you have ever read the book, I think you would agree it could easily be made into a movie of Lord of the Rings equivalence.  This movie should have never been able to use the title of A Wrinkle in Time.  Poorly done.",
		"I have never read the bookA wrinkle in time.  To be perfectly honesty, after seeing the movie, do I really want to?  Well, I should not be reviewing this movie i will start off with that.  Next i will say that the TV movie is pretty forgettable.  Do you know why I say that?  Because I forgot what happens in it.  I told it forgettable To be perfectly honest, no TV movie will ever be better than Merlin.How do I describe a TV movie?  I have never written a review for one before.  Well, i will just say that they usually have some celebrities.  A wrinkle in time includes only one.  Alfre WoodardOr Woodward, I am not sure, the Oscar winner.  The film has cheesy special effects, a mildly interesting plot, scenes that make you go WTF.  The movie is incredibly bad and it makes you goWTF.  What did I expect?  It is a TV movie.  They usually are not good.  As is this one.  A wrinkle in time is a waste of time and a big time waster.  To top it off, you will most likely forget about it the second it is over.  Well, maybe not the second it is over.  But within a few minutes.A wrinkle in time",
		"I have grown up pouring over the intertwined stories of the Wrinkle in Time Chronicles.  My dream was that one day a screenwriter would come across their child sitting in a large sofa reading A Winkle in Time, and would think, what an amazing movie this would make.  Sadly enough that screenwriter failed, changing characters, throwing in lame humor, and all out destroying the plot.  I know it novel But why cannot you stay true to the book?  Why must you change the way characters think and act?  For those of you who have not read the book, pick it up, find a soft couch, and let your imagination run wild.",
		"A family moves into a old house in Japan.  But there is a catch it is haunted BOO!!!.  Aw, did not mean to make you jump.  It is only a review.  Settle back down.  Ahem, now anyways it is haunted by an old samurai who killed his wife  her lover in slow motion.  This naturally makes a 3 minutes scene stretch out to about 7 or 8.  Horrid acting.  Horrid story.  But How bad can it be you ask?  Well it was SO bad my brain started to melt  leak out through my nose in thoughtful drips.  It was Doug onscreen",
		"I saw this film at a prerelease screening at the Writers Guild theater in Beverly Hills.  As I recall, the films producers and director were in attendance, presumably to gage our reaction.Many scenes evoked gales of laughter from the audience, which would have been fine if it had been a comedy, but it was supposed to be a horror film.If the audience was not scared, it seems the filmmakers were.  They delayed release for over a year.  Out of curiosity I saw it again to see if they would recut it; as far as I can tell, they had not.  It qualifies it slowpaced",
		"That this poor excuse for an amateur hour showcase was heralded at Sundance is a great example of what is wrong with most indie filmmakers these days.First of all, there is such a thing as the art of cinematography.  Just picking up a 16mm camera and pointing it at whomever has a line does not make for a real movie.I guess we have to consider ourselves lucky the director did not pick up someones camcorder...Second, indie films are supposed to be about real people.  There is nothing real in this film.  None come they cool Hard to believe this was one of the best films submitted...In any case, it made me loose what was left of my respect for the Sundance brand.",
		"I have seen the Gator Bait films, and this is almost exactly the same thing as those.  A woman is sexually assaulted by a group of degenerate men and systematically exacts her vicious revenge on each of them.  The thing that sets this movie apart from those ones although not very far is that the sexual content is not glorified.  There is full frontal nudity many times throughout the film, but not for a second is it ever sexy.  Some of the rape scenes might seem a little extensive, but that is only because the movie is trying to strengthen the audiences need to see this woman seek revenge.This is a weak film, it has no other way to maintain interest other than manipulating our natural desire to see this woman get revenge on her attackers.  I Spit you glad On the other hand, the only thing that drives the plot is an empty necessity for revenge against a group of rapists.  These men are evolutionary dropouts just like they were in the Gator Bait films, and the biggest challenge for the writers seems to have been to come up with new and exciting ways to kill them, but the reason the film can never be anything more than a meaningless Bmovie is because it does not deliver a message of any kind, but instead it simply satisfies the audiences desire to see a bunch of rapists get exactly what they deserve.  The one problem that this leaves is that we have to sit through the sexual attacks.  Oddly, the first half of the film is the part that contains the most nudity although not by much, but it is by far the most painful to watch.  We are even let down a little as we watch the woman obtain revenge since a couple of the deaths were so elaborate that they were obviously impossible it seems like pure luck that the guy in the lake at the end felt such an overwhelming desire to hug the motor on the boat and press his genitalia against the propeller, staying that way while the woman yells some final words at him and pulls the cord, but again, this movie satisfies only the desire for revenge that the first half filled us with.spoilers You know that this is all the movie means to do, since it literally ends the minute the last guy is killed.  The woman does not live happily ever after, she does not write her book, she does not leave and never return to that nightmare place, she just gets in the boat and motors around the lake while the movie simply stops in its tracks.  But hey, what more did you expect? Oh, and did you read the tagline?  If you decide to waste your time watching this, try and find any man getting broken or burned.  I was really looking forward to those",
		"Okay, you havePenelope Keith as Miss HerringboneTweed, B.B.E.  Backbone of England.  She is killed off in the first scene  that is right, folks; this show has no backbone! Peter OToole as Ol Colonel Cricket from The First War and now the emblazered Lord of the Manor.Joanna Lumley as the ensweatered Lady of the Manor, 20 years younger than the colonel and 20 years past her own prime but still glamourous Brit spelling, not mine enough to have a toyboy on the side.  It is alright, they have Col.  Crickets full knowledge and consent they guy even comes round for Christmas!  Still, she is considerate of the colonel enough to have said toyboy her own age what a gal! David McCallum as said toyboy, equally as pointlessly glamourous as his squeeze.  Pilcher could not come up with any cover for him within the story, so she gave him a hushhush job at the Circus.and finallySusan Hampshire as Miss Polonia Teacups, Venerable Headmistress of the Venerable Girls BoardingSchool, serving tea in her office with a dash of deep, poignant advice for life in the outside world just before graduation.  Her best bit of advice I have only been to Nancherrow the local Stately Home of England once.  I thought it was very beautiful but, somehow, not part of the real world.  Well, we cannot say they did not warn us.Ah, Susan  time was, your character would have been running the whole show.  They do not write em like that any more.  Our loss, not yours.So  with a cast and setting like this, you have the remakings of Brideshead Revisited, right? Wrong!  They took these 1dimensional supporting roles because they paid so well.  After all, acting is one of the oldest tempjobs there is YOU name another! First warning sign lots and lots of backlighting.  They get around it by shooting outdoors  hey, it is just the sunlight! Second warning sign Leading Lady cries a lot.  When not crying, her eyes are moist.  That is the law of romance novels Leading Lady is dewyeyed.Henceforth, Leading Lady shall be known as L.L.Third warning sign L.L. actually has stars in her eyes when she is in love.  Still, I will give Emily Mortimer an award just for having to act with that spotlight in her eyes I wonder . did they use contacts? And lastly, fourth warning sign no onscreen female character is Mrs.  She is either Miss or Lady.When all was said and done, I still could not tell you who was pursuing whom and why.  I comes home catatonic Meanwhile there is always a meanwhile, some young guy L.L. had a crush on when, I do not know comes home from some wartime tough spot and is found living on the street by Lady of the Manor must be some street if She is going to find him there.  Both war casualties are whisked away to recover at Nancherrow SOMEBODY has to be whisked away SOMEWHERE in these romance stories! Great drama.",
		"Quite what the producers of this appalling adaptation were trying to do is impossible to fathom.A group of top quality actors, in the main well cast with a couple of notable exceptions, who give pretty good performances.  Penelope Keith is perfect as Aunt Louise and equally good is Joanna Lumley as Diana.  All do well with the scripts they were given.So much for the good.  The average would include the sets.  Nancherrow is nothing like the house described in the book, although bizarrely the house they use for the Dower House looks remarkably like it.  It is clear then that the Dower House is far too big.  In the later parts, the writers decided to bring the entire story back to the UK, presumably to save money, although with a little imagination I have no doubt they could have recreated Ceylon.Now to the bad.  The screenplay.  This is such an appallingly bad adaptation is hard to find words to condemn it.  Edward does not die in the battle of Britain but survives, blinded.  He makes a brief appearance then commits suicide  why??  Loveday has changed from the young woman totally in love with Gus to a sensible farmers wife who can give up the love her life with barely a tear less emotional than Brief Encounter.  Gus, a man besotted and passionately in love, is prepared to give up his love without complaint.  Walter Mudge in the book turns from a shallow unfaithful husband to a devoted family man.  Jess is made into a psychologically disturbed young woman who will not speak.  Aunt Biddy still has a drink problem but now without any justification.  The Dower House is occupied by the army for no obvious reason other than a very short scene with Jess who has a fear of armed soldiers.  Whilst Miss Mortimers breasts are utterly delightful, I could not see how their display on several occasions moved the plot forward.  The delightfully named Nettlebed becomes the mundane Dobson.  The word limit prevents me from continuing the list.There is a sequel which I lost all interest in watching after this nonsense and I wonder if the changes were made to create the follow on story.  It is Rosamunde grotesque",
		"Simply not the quality I expected from Morris love Brass Eye and Blue Jam.  This is very much like a not so bad student film.  What concerns me, in all this is WHY DID IT WIN A BAFTA???  Morris makes fun of enshrined mediocrity Ayn Rand in much of his work Nathan Barley and yet with this piece is urinating down the backs of the talented and telling us its raining!  I hope he subject",
		"Enough is enough...sometimes they just need to stop making movies based on a concept that is long dead.  The first Tremors movie was great.  The second one was ridiculous.  The third one was nauseating.  The tv series was depressingly awful.  And this movie just drives the stake deeper.Basically another excuse for cheap computer effects and puppetry, now we have the series set in the Wild West, in the 1800s, and they fight graboids.  Like a rehash of the first one, they have to learn how to beat them all over again.  Mildly entertaining I suppose.  Otherwise this straighttovideo release, just like Tremors 2 and 3, is just going way too far.  Oh and I continue to wonder how there is never any record of these events taking place...did they just simply forget to record this unprecedented event?  I think something like this would be historymaking, so our pals in the first film would not be so unprepared.  Movies make me crazy Avoid this garbage.",
		"Warning This review contains minor spoilers.Well the writers of the first Tremors are officially out of ideas.  I am a big fan of the first movie and the first two sequels are pretty good for straight to video fare.  Tremors 4 The Legends Begins, however, is a very dull movie.  Where the heck are the Graboids???  Due to the relative lack of Graboids through the first 90 minutes I am convinced that this entry into the series is suppose to be a character study.  Unfortunately there is not one interesting character in the movie except for Billy Dragos character who is given too few lines, too little to do and in the end too little screen time.  What saved the 2nd and 3rd movies was the presence of Michael Gross as Burt Gummer.  Whenever was you interesting However in this movie Gross plays Hiram Gummer a very poor and boring substitute.  On the plus side when the Graboids Dirt Dragons in this movie are on the screen they do look good but that is about as good as it gets.I was impressed when I saw that Tremors 4 was listed at 101 minutes long.  Pretty good for straight to video.  But after watching it I am sure that this movie is a good 15 minutes too long.  There are long stretches of dialogue that is boring and does not further the plot any.  Was there a rush to get this movie made?  I think not, more time could have and should have been spent on the script.I thought I had hit a gold mine when I saw Tremors 4 packaged for sale with....Tremors!!!  What luck I thought, pay for 4 get 1 for free.  Well after watching Tremors 4 I like to think I paid for the original and got this mess for free, I cannot imagine paying a single dime for Tremors 4.  For fans of the series it is best to forget that Tremors 4 The Legend Begins even exists.Tremors 4 The Legend Begins rates a 3 out of 10.",
		"I found Tremors sure",
		"I cannot believe this movie managed to get such a relatively high rating of 6!  It is barely watchable and unbelievably boring, certainly one of the worst films I have seen in a long, long time.In a nobudget way, it reminded me of Star Wars Episodes I and II for the sheer impression that you are watching a total creative train wreck.This film should be avoided at all costs.  It is they different",
		"It is funny.  I have others repellent For me, it ranges from great to crapwithout much in the middle.  I know he has a lot of fans among the sophisticated, but I cannot help but think that a lot of his appeal is pure hype.  From my point of view and I know I will get a lot of negative ratings for this, he made too many movies too quickly and was too selfindulgent.  His gay or genderbending films like this one tend to be really badsloppily done, sometimes quite boring such as QUERELLE and THE BITTER TEARS OF PETRA VON KANT and sometimes just gross like this film.  Could not his message about acceptance of a persons genderconfusion be handled better than showing him get slapped around or watching cows being gruesomely slaughtered?  Show some sensitivity for the subject matter and make your characters more human and sympatheticthen, maybe, I would care about the films.  I am honestly at the point after watching this film that I might not bother with any more Fassbinder filmsthe bad seems to be outweighing the good.",
		"I scared me witless I had nightmares about every aspect of this film from the way it was drawn to the music to obviously the violence.  My parents still argue about who allowed me to watch it and both of them say that they would never let me watch such a movie.  I think they only say that knowing that I have such strong feelings about it ;0 I am currently reading the book out of morbid curiosity and the fact that it is a classic and it is really a great story.  However I do not think that it should have been made into a cartoon.  Ever.  Well, maybe kids nowadays would find it quaint but it gave me nightmares for weeks and weeks and I still have a hard time seeing rabbits drawn in a similar way.  Gives me a little heart palpitation every time.  Yah I am a wuss but I strongly suggest that any parent looking to show this movie to their kids, read them the book instead or watch it first to make certain that they approve of the content.  Not everyone finds it as disturbing as I did but we are out there ;0",
		"Did anyone else feel as betrayed as I did?  The first hour or so was pretty solid but the last.  Oh my god.  It seemed it predictable Not grandiose and epic like the entire run of the show has been.  Most reviews have read have been glowing but I really cannot understand why.  I had seriously predicted that general ending WAY earlier on but then retracted it because I thought No, they would never do that, that is FAR too lame.  I can hardly stand it.  I feel so unsatisfied.  I think i am about to walk out the door to go sell every season I own.  Someone please.  Change my mind.  I want to love this.  SO bad.  Someone tell me why I am wrong.  Great show.  Terrible ending.",
		"Did anyone else feel as betrayed as I did?  The first hour or so was pretty solid but the last.  Oh my god.  It seemed like it was predictable and cheesy.  Not grandiose and epic like the entire run of the show has been.  Most reviews have read have been glowing but I really cannot understand why.  I had seriously predicted that general ending WAY earlier on but then retracted it because I thought No, they would never do that, that is FAR too lame.  I can hardly stand it.  I feel so unsatisfied.  I think i am about to walk out the door to go sell every season I own.  Someone please.  Change my mind.  I want to love this.  SO bad.  Someone tell I wrong Great show.  Terrible ending.",
		"Unless you are between the ages of 10 and 14 except for the R rating, there are very few things to like here.  One or two lines from Kenan Thompson, David Koechner we really should see him more and Sam Jackson are humorous and Julianna Margulies is as good as she can be considering her surroundings, but sadly, that is it.  Poor plot.  Poor acting.  Worse writing and delivery.  The special effects are dismal.  As much as the entire situation is an odd and awful joke, the significant individual embedded situations are all equally terrible.  If we consider the action portions, well there are unbelievable action sequences in some films that make you giddy and there are some that make you groan.  This movie only contains the latter kind.  This leaves little left.  I did anything good I had no expectations, but was somewhat worried going in.  Yet, like a train wreck, one cannot merely look away.  And even with no expectations, I was let down.  Bad.  Not even so bad, it is good material.  I am _very_ tolerant of bad movies, but this makes Six String Samurai which I liked Oscar worthy.No, this piece of over CGI would rubbish is in the same company as Battlefield Earth, Little Man and Gigli.  How this is currently rated a 7.2 completely mystifies me.  Brainwashing or somehow stacking the voting system is all that I can think of as answers.I could go on and on but suffice to say that tonight, I witnessed a train wreck.  I need to go wash my eyes. 1 of 10",
		"I saw an early screening of this film in New York and I, along with my friends and pretty much the entire audience, were vastly disappointed.  The movie was not even so bad it was good; it was as lifeless as a snakebite victim.  Samual L.  Jackson looked surprisingly tired through most of it and the snake effects were lame.  It reminded me of one of those cheesy SciFi movies, except the cheesiness of this movie was not funny or even campy.  It all seemed worn, flat, and overtly formulaic.  I am shocked to say I actually think Anaconda was more fun.  It is easy to understand that SOAP realizes it is a piece of sit and plays along with it, but what the film fails to embark on is a script that has any scares of suspense.  It is it joyless",
		"Oh Dear Lord, How on Earth was any part of this film ever approved by anyone?  It reeks of cheese from start to finish, but it is not even good cheese.  It is the scummiest, moldiest, most tasteless cheese there is, and I cannot believe there is anyone out there who actually, truly enjoyed it.  Yes, if you saw it with a load of drunkstoned buddies then some bits might be funny in a sad kind of way, but for the rest of the audience the only entertaining parts are when said group of buddies are throwing popcorn and abusive insults at each other and the screen.  I watched it with an upforafewlaughs guy, having had a few beers in preparation to chuckle away at the films expected crapness.  We got the crapness plenty of it, but not the chuckles.  It does not even qualify as a sobadit isgood movie.  It is just plain bad.  Very, very bad.  Heres look you spoilerphobic OK, I was a few minutes late in so not sure why this was, but I think I grasped the this guy is a bit of a badass who you do not want to mess with message behind the ingenious scene.  Oh, and a guy witnesses it.  So, we already have our ultraevil bad guy, and wussy but cute apparently good guy.  Cue Hero.  Big Sam steps on the scene in the usual fashion, saving good guy in the usual inane way that only poor action films can accomplish, i.e.  Hero is immune to bullets, everyone else falls over rather clumsily.  Cue first plot hole.  How the bloody hell did Sammy know where this guy was, or that he would watched the murder.  Perhaps this, and the answers to all my plothole related questions, was explained in the 2 minutes before I got into the cinema, but I doubt it.  In fact, I am going to stop poking holes in the plot right here, lest I turn the movie into something resembling swiss cheese which we all know is good cheese.  So, the plot a very generous word to use.  Good guy must get to LA, evil guy would rather he did not, Hero Sam stands between the two.  Cue scenery for the next vomitinducing hour  the passenger plane.  As I said, no more poking at plot holes, I will just leave it there.  Passenger plane.  Next, the vital ingredient up until now missing from this gem of a movie, and what makes it everything it is  Snakes.  Yay!  Oh, pause.  First we have the introduction to all the obligatory characters that a lame movie must have.  Hot, horny couple see if you can guess how they die, deadbeforeanysnakesevenappear British guy those pesky Brits, eh? , cute kids, and Jo Brand.  For all you Americans that is an English comic famous for her size and unattractiveness.  Now that we have met the cast, let us watch all of them die except of course the cute kids.  Do not expect anything original, it is just snake bites on various and everincreasingly hilarious really not parts of the body.  Use your imagination, since the filmmakers obviously did not use theirs.So, that is most of the film wrapped up, so now for the best bit, the ending.  As expected, everything is just so happy as the plane lands that everyone in sight starts sucking face.  Yep, Icecool Sammy included.  But wait, we are not all off the plane yet!  The last guy to get off is good guy, but just as he does he gets bitten by a you guessed it snake of all things.  Clearly this one had been hiding in Mr.  Jacksons hair the whole time, since it somehow managed to resist the air pressure trick that the good old hero had employed a few minutes earlier, despite the 200ft constrictor the one that ate that pesky British bugger being unable to.  So, Sam shoots him and the snake in one fell swoop.  At this point I prayed that the movie was about to make a muchneeded Uturn and reveal that all along the hero was actually a traitor of some sort.  But no.  In a kind of icing on the cake way but with stale cheese, remember, it is revealed that the climax of the film was involving a bullet proof vest.  How anyone can think that an audience 10 years ago, let alone in 2006 would be impressed by their ingenuity is beyond me, but it did well in summing up the film.Actually, we are not quite done yet.  After everyone has sucked face Uncle Sam with leading actress, good guy with Tiffany, token Black guy with token White girl, and the hot couple in a heart warming bout of necrophilia, it is time for good guy and hero to get it on....In Bali!!!  Nope, it was not at all exciting, the exclamation marks were just there to represent my utter joy at seeing the credits roll.  Yes, the final shot of the film is a celebratory surfing trip to convey the message that a bit of male bonding has occurred, and a chance for any morons that actually enjoyed the movie to whoop a few times.  That is it.  This is the first time I have ever posted a movie review, but I felt so strongly that somebody must speak out against this scourge of cinematography.  If you like planes, snakes, Samuel L.Jackson, air hostesses, bad guys, surfing, dogs in bags or English people, then please, please do not see this movie.  It will pollute your opinion of all of the above so far that you will never want to come into contact with any of them ever again.  Go see United 93 instead.  THAT was good."
	]
}