{
	"augmented_text": [
		"Homelessness or Houselessness as George Carlin stated has been an issue for years but never a plan to help those on the street that were once considered human who did everything from going to school, work, or vote for the matter.  Most people think of the homeless as just a lost cause while worrying about things such as racism, the war on Iraq, pressuring kids to succeed, technology, the elections, inflation, or worrying if they will be next to end up on the streets.  But what if you were given a bet to live on the streets for a month without the luxuries you once had from a home, the entertainment sets, a bathroom, pictures on the wall, a computer, and everything you once treasure to see what it is like to be homeless?  That is Goddard Bolts lesson.Mel Brooks who directs who stars as Bolt plays a rich man who has everything in the world until deciding to make a bet with a sissy rival Jeffery Tambor to see if he can live in the streets for thirty days without the luxuries; if Bolt succeeds, he can do what he wants with a future project of making more buildings.  The bets on where Bolt is thrown on the street with a bracelet on his leg to monitor his every move where he cannot step off the sidewalk.  He is given the nickname Pepto by a vagrant after it is written on his forehead where Bolt meets other characters including a woman by the name of Molly Lesley Ann Warren an exdancer who got divorce before losing her home, and her pals Sailor Howard Morris and Fumes Teddy Wilson who are already used to the streets.  They are survivors.  Bolt is not.  He is he rich Maybe they should give it to the homeless instead of using it like Monopoly money.Or maybe this film will inspire you to help others.",
		"THE NIGHT LISTENER 2006 12 Robin Williams, Toni Collette, Bobby Cannavale, Rory Culkin, Joe Morton, Sandra Oh, John Cullum, Lisa Emery, Becky Ann Baker.  Dir Patrick Stettner Hitchcockian suspenser gives Williams a standout lowkey performance.What is it about celebrities and fans?  What is the near paranoia one associates with the other and why is it almost the norm?  In the latest derange fan scenario, based on true events no less, Williams stars as a talkradio personality named Gabriel No one, who reads stories he is penned over the airwaves and has accumulated an interesting fan in the form of a young boy named Pete Logand Culkin who has submitted a manuscript about the travails of his troubled youth to No ones editor Ashe Morton who gives it to No one to read for himself.  No one is naturally disturbed but ultimately intrigued about the nightmarish existence of Pete being abducted and sexually abused for years until he was finally rescued by a nurse named Donna Collette giving an excellent performance who has adopted the boy but her correspondence with No one reveals that Pete is dying from AIDS.  Naturally No one wants to meet the fans but is suddenly in doubt to their possibly devious ulterior motives when the seed is planted by his estranged lover Jess Cannavale whose sudden departure from their New York City apartment has No one in an emotional tailspin that has only now grown into a tempest in a teacup when he decides to do some investigating into Donna and Petes backgrounds discovering some truths that he did not anticipate.Written by Armistead Maupin who cowrote the screenplay with his former lover Terry Anderson and the films novice director Stettner and based on a true story about a fans hoax found out has some Hitchcockian moments that run on full tilt like any good old fashioned potboiler does.  It helps Williams unmentioned",
		"Popular radio storyteller Gabriel No oneRobin Williams,scraggy and speaking in hushed,hypnotic tones becomes acquainted and friends with a fourteenyearold boy from Wisconsin named Pete LogandRory Culkin,who has written a book detailing sexual abuse from his parents.  To boot,Pete has AIDS and this compels Gabriel further still,since his partner JessBobby Cannavale,goodhappens to be a survivor of HIV himself.  He also acquaints himself with Petes guardian,a woman named DonnaToni Collette,brilliant! and when Gabriel decides he wants to meet and talk to the two of them in person and goes to Wisconsin,he discovers some secrets he wasnaturallynot prepared to find.Based on real events that happened to Armistead Maupinwho cowrote the screenplay with Terry Andersonand directed by Patrick Stetner,this film moves a lot faster90 min. ,maybe a few minutes longerthan one might think a movie of this genre would run.  That is good in that it keeps the action and storyline lean and clear.  It is bad in that it leaves various holes in the plot and does not sewup any of the plot openings or backstory.  I go you familiar Still,the performances by Williams I would have loved to heard more of his narration,personally,Collette,Cannavale,Culkin and much of the supporting castthe Waitress at the restaurant Colletes Donna frequents does a great job with what small part she has! are topnotch and the mood established herenamely,the chilly,lonely dark exteriors of Wisconsin and New Yorkgive a terrific framing for this story.  It may have ends that do not tie together particularly well,but it is still a compelling enough story to stick with.",
		"I have it overlong True, it is over three hours long, but I was amazed that it goes by so quickly.  I do not think it is overrated at all, I think the IMDb rating is perfectly decent.  The film looks sumptuous, with gorgeous costumes and excellent effects, and the direction from James Cameron rarely slips from focus.  Leonardo DiCaprio gives one of his best performances as Jack, and Kate Winslet is lovely as Rose.  David Warner, a great actor, steals every scene he is in.  The story is very rich in detail, and is hot on character development, obvious with the love story which is very moving when it needs to be, though in the first bit of the movie it is a little slow.  The last hour is extremely riveting, and I will confess that I was on the edge of my seat, when the Titanic sank.  I will also say that the last five minutes were very moving.  The music score by James Horner was lovely, though I never was a huge fan of the song My Heart will Go On.  The 1996 miniseries was good, but suffered from undeveloped scenarios and some historical inaccuracies.  Overall, I give Titanic an 8.510.  Bethany Cox.",
		"I think James Cameron might be becoming my favorite director because this is my second review of his movies.  Anyway, everyone remembers the RMS Titanic.  It was big, fast, and unsinkable... until April 1912.  It was all over the news and one of the biggest tragedies ever.  Well James Cameron decided to make a movie out of it but star two fictional characters to be in the spotlight instead of the ship.  Well, onto the main review but let me remind you that this is all opinion and zero fact and the only fact that will be present is an event from the film.So our two main characters are Jack Leonardo DiCaprio and Rose Kate Winslet.  They find they annoying The main villain I guess is bad luck, fate, hand of God no blasphemy intended, or just plain Caledon Hockley Billy Zane.  Combine all of the above and what do you get?!  Oh yes!  We get a love story on a sinking boat.  The supporting characters are the following My personal favorite, Mr.  Andrews Victor Garberidk he was so nice, LovejoyDavid Warner, MurdochEwan Stewart, Lightoller Jonathan Phillips, Captain SmithBernard Hill, Molly BrownKathy Bates, and many more.  We also got the present day treasure hunter, Brock Lovett Bill Paxton.  They add something to the story, something good.  The action in here is awesome, especially in the second half, the drama as also good.  In the end you can have your eyes dropping rainstorms or silent tears.  The story is simple and it works.  A treasure hunter seeks the Heart of the Ocean and instead finds a drawing of a woman wearing the said diamond.  She calls and tells her tale on the RMS Titanic.  Two lovers separated by social class and ultimately, the fate of the ship.  Everything about the story works and there are very few flaws.  I give Titanic, an 86 awesome",
		"Titanic has to be one of my alltime favorite movies.  It has its problems what movies do not but still, it is enjoyable.When I stumble across someone who asks me why I like Titanic, I suppose my first reaction is wait a minute, you do not?  I know so many people who do not like this movie, and I am not saying I do not see why.  The love story is too cheesy well, yes but is not it enjoyable and moving?  All right, the love story between Jack and Rose is very unrealistic, everyone knows that love like this does not actually exist.  But this is a movie, does not everyone enjoy watching a beautiful story that lets us slip slightly into fantasy for a while?  The next complaint, DiCaprio and Winslet are terrible actors.  Well, OK, in this movie, I agree that they do not perform to their full potentials.  However I think it is unfair to say that they are terrible actors.  I think they amazing But the roles they are given are simple, and the characters seem real enough that you can care about them quite a bit, but I agree with many people that they did not do as well as could have been expected.And finally, if one is going to complain that they do not like this movie because they hate romance, or because they hate history, or tragic movies, then I am sorry but why on earth did they go and see a movie that is so clearly all of these things.  It is like people who complain The Dark Knight is a bad movie because they hate action movies.  Simply for being a movie, not because you dislike the genre, this IS a good movie.Well deserving of its Oscars, in particular, Best Cinematography, which I find to be the best I have ever seen in a movie save maybe the Lord of the Rings trilogy.I know some of the writing fails, such as the constant screaming of each others names throughout the movie.  The flashback portion of the story can be quite weak at times, but overall it is an amazing achievement in making the Titanic look so real, and the sinking feel so epic.I understand why a lot of people dislike this movie, but for the most part it boils down to them disliking the fundamental idea, such as it being a love story, rather than them thinking the movie in and of itself is poorly constructed.I can tell you that I have read more than five books about the Titanic, including memoirs form the day it happened, and this movie is extremely historically accurate save just a few faults.  The only main ones I can find is that the piping should be threaded copper, not steel, and the iceberg looks fairly unrealistic as is the scene where they hit it.I give this movie 1010, not because I like romance movies, but simply because it is an outstanding cinematic achievement, that leaves one feeling horrified by the realistic adaptation of events.",
		"Back in 1997, do I remember that year Clinton bans cloning research, the unfortunate death of Princess Diana, the Marlins won the world series and a woman gave birth to septuplets.  This was also the big year in the release of Titanic, one of the biggest films of all time a tale about the ship of dreams, about a boy and a girl who fall in love but are torn apart by their social class and at the height of their emotional commitment the ship meets with disaster.  I do not think anybody could have expected Titanic to be as HUGE as it was, the movie was bigger than life and had millions of fans, 85 of them being teenage girls, I was 12 years old at the time, and of course saw the movie multiple times.  It was the film that made me believe that the love that Jack and Rose shared was so real and beautiful.  At the time I felt that Titanic could do no wrong, of course I grew up and did not watch the film since I was 14, a couple years ago I saw the film on DVD for 5.99 and figured that it was a good price and to see what I thought about the movie now.  Was it worth the hype?  Was it really the best movie of all time?  Was that Leonardos real nose?  OK, I know that is silly to say, but I did rewatch the film.  Being completely honest here, Titanic is a great movie, best movie of all time, no, just depends on your idea of a good movie, but Titanic delivered in romance, humor, disaster, emotions and never let us go on this maiden voyage.The film starts with Brock Lovett and his team exploring the wreck of the RMS Titanic, searching for a necklace set with a valuable blue diamond called the Heart of the Ocean.  Unsuccessful, they instead discover a drawing of a young woman reclining nude, wearing the Heart of the Ocean, dated the day the Titanic sank. 101yearold Rose Dawson Calvert learns of the drawing, and contacts Lovett to inform him she is the woman in the drawing.  She and her granddaughter Elizabeth Lizzy Calvert visit Lovett and his skeptical team on his salvage ship.  When asked if she knew the whereabouts of the necklace, Rose Calvert recalls her memories aboard the Titanic, revealing for the first time that she was Rose DeWitt Bukater.  In 1912, the upperclass 17yearold Rose boards the ship with her fianc?, Cal Hockley and her mother, Ruth DeWitt Bukater, both of whom stress the importance of Roses engagement to Cal since the marriage will mean the eradication of the DewittBukater debts while they have the outward appearance of the upperclass, Rose and her mother are financially broke.  Distraught and frustrated by her engagement to the controlling Cal and the pressure her mother is putting on her to go through with the marriage, Rose attempts suicide by jumping from the stern.  Before she leaps, a drifter and artist named Jack Dawson intervenes.  Jack and Rose strike up a tentative friendship as she thanks him for saving her life, and he shares stories of his adventures traveling and sketching; their bond deepens when they leave a stuffy firstclass formal dinner of the rapportbuilding wealthy for a much livelier gathering of Irish dance, music and beer in thirdclass.  But after Cals servant informs him of Roses whereabouts, Rose is forbidden from seeing Jack again.  However, after witnessing a woman encouraging her sevenyearold daughter to behave like a proper lady at tea, Rose defies him and her mother, asking Jack to sketch her nude and wearing only the Heart of the Ocean, an engagement present from Cal.  After a beautiful moment together in the very first backseat fun time, they go to the deck of the ship.They then witness the ships fatal collision with an iceberg.  After overhearing the ships lookouts discussing how serious the collision is, Rose tells Jack they should warn her mother and Cal.  Meanwhile, Cal discovers Roses nude drawing and her taunting note in his safe, so he frames Jack for stealing the Heart of the Ocean by having Lovejoy plant it in Jacks pocket.  Upon learning Cal intends to leave Jack to die below deck, Rose runs away from him and her mother to rescue him.  Jack and Rose return to the top deck.  Cal want Rose safe But after realizing that she cannot leave Jack, Rose jumps back on the ship and reunites with Jack in the ships first class staircase.  Jack and Rose return to the top deck, the lifeboats have gone, and the ship finally goes down into the freezing Atlantic taking Jack and Rose down.So does Titanic live up to it is hype?  I still say that this is a great movie to watch, I think that there were and still are quite a few haters that for some reason just want to trash the movie because it had won a ton of awards and everyone was in love with the movie.  But it has great acting, amazing effects, a wellwritten story and still looks flawless.  Love it or hate it, you have to admit this movie did not get a lot of hype just because of Leos baby face or Kates amazing ability to cry on sight, this film is something special.  It will always hold a special place in my heart, it has too seeing that I saw this film 8 times in the theater when it was released.  But all that aside, I do recommend this movie, it is a great one and sure to go down in the classics one day.1010",
		"Every once in a while the conversation will turn to favorite movies.  I will mention Titanic, and at least a couple people will snicker.  I pay them no mind because I know that five years ago, these same people were moved to tears by that very movie.  And they are too embarrassed now to admit it.I just rewatched Titanic for the first time in a long time.  Expecting to simply enjoy the story again, I was surprised to find that the movie has lost none of its power over these five years.  I cried again.... in all the same places.  It brought me back to 1997 when I can remember how a movie that no one thought would break even became the most popular movie of all time.  A movie that burst into the public consciousness like no other movie I can recall yes, even more than Star Wars.  And today, many people will not even admit they enjoyed it.  Folks let us cool You look like an out of touch cynic.No movie is perfect and this one has a few faults.  Some of the dialogue falls flat, and some of the plot surrounding the two lovers comes together a little too neatly.  However, none of this is so distracting that it ruins the film.Leonardo DiCaprio and Kate Winslet are wonderful.  Leo is one of the fine actors of his generation.  Wait til you see him in Gangs of New York before you call him nothing more than a pretty boy.  Kate Winslet was so strong in this film.  The movie really was hers, and she held it together beautifully.James Cameron managed what many believed was impossible by recreating a completely believable Titanic.  The sinking scenes were horrific, just as they were that night.  How anyone can say the effects were bad is beyond me.  I was utterly transfixed.This film is one memorable scene after another.  Titanic leaving port in Southampton.  Rose and Jack at the bow, flying.  Iceberg, right ahead!  The screws hanging unbelievably out of the ocean.  The screams of the doomed after she went down.  And that ending that brought even the burliest man in the theater to tears.The music, which has also been a victim of the films success, was a key ingredient.  James Horners score was simply perfect.  And the love theme was beautiful and tragic.  Too bad Celine Dions pop song version had to destroy this great bit of music for so many.I confess, I am a Titanic buff.  As such, I relished the opportunity to see the ship as we never got to see it  in all its beauty.  Perhaps watching it sink affected me more than some because I have had such an interest in the ship all my life.  However, I doubt many of those I saw crying were Titanic buffs.  I applaud Cameron for bringing this story to the masses in a way that never demeaned the tragedy.  The film was made with such humanity.Another reviewer said it better than I ever could Open up your hearts to Titanic, and you will not be disappointed.",
		"I am not a parent, neither am I a male.  But I was able to identify with every characters heartaches and pains.This is a movie teenagers should watch.  Maybe that way they will start appreciating the value of family again.  I am sorry for those that do not understand the value of love, family and friendship.It was very interesting to watch Patrick Duffy in a different role than that of Bobby Ewing.  And it is great to see a 19 year old Ben Affleck giving his best in a moving and sincere performance.  He showed he capable He should be offered more serious roles.  Note Hollywoodland... his first serious role in years and he went out and won Best Actor at the Venice Festival in 2006.This movie can be appreciated by people of all ages.  Maybe should not be watched by children under 10 because they might get scared that the same may happen to their families, but I recommend it to the entire family.I bought this movie on DVD and have watched it with friends many times.  Because it portrays the values that are important in life.",
		"After a brief prologue showing a masked man stalking and then slashing the throat of an older gentleman on a deserted, urban, turn of the century Australian street, we meet Julie Rebecca Gibney and Peter John Adam as they go out house hunting.  They manage to get a loan for a fixerupper on a posh Sydney street, but it turns out that physical disrepair is not the only problem with their new home.  It be Gantry good A crucial problem occurs at the beginning of the film.  The opening thriller scene features some wonky editing.  Freeze frames and series of stills are used to cover up the fact that there is not much action.  Suspense should be created from staging, not fancy fix it in the mix techniques.  There is great atmosphere in the scene from the location, the lighting, the fog and such, but the camera should be slowly following the killer and the victim, cutting back and forth from one to the other as we track down the street, showing their increasing proximity.  The tracking and the cuts need to be slow.  The attack needed to be longer, clearer and better blocked.  As it stands, the scene has a strong made for television feel, and a low budget one at that.After this scene we move to the present and the flow of the film greatly improves.  The story has a lot of similarities to The Amityville Horror 1979, though the budget forces a much subtler approach.  Millar and scriptwriter Tony Morphett effectively create a lot of slyly creepy scenarios, often dramatic in nature instead of special effectsoriented, such as the mysterious man who arrives to take away the old slabs of iron, which had been bizarrely affixed to an interior wall.For some horror fans, the first section of the film might be a little heavy on realist drama.  At least the first half hour of the film is primarily about Julie and Peter trying to arrange financing for the house and then trying to settle in.  But Morphett writes fine, intelligent dialogue.  The material is done well enough that it is often as suspenseful as the more traditional thriller aspects that arise laterespecially if you have gone through similar travails while trying to buy your own house.Once they get settled and things begin to get weirder, even though the special effects often leave much to be desired, the ideas are good.  The performances help create tension.  There is not an abundance of death and destruction in the filmthere is more of an abundance of home repair nightmares.  But neither menace is really the point.The point is human relationships.  There are a number of character arcs that are very interesting.  The house exists more as a metaphor and a catalyst for stress in a romantic relationship that can make it go sour and possibly destroy it.  That it is in a posh neighborhood, and that the relationship is between two successful yuppies, shows that these problems do not only afflict those who can place blame with some external woe, such as money or health problems.  Peters character evolves from a striving corporate employee with normal workbased friendships to someone with more desperation as he becomes subversive, scheming to attain something more liberating and meaningful.  At the same time, we learn just how shallow those professional friendships can be.  Julie goes through an almost literal nervous breakdown, but finally finds liberation when she liberates herself from her failing romantic relationship.Although 13 Gantry Row never quite transcends its madefortelevision clunkiness, as a TV movie, this is a pretty good one, with admirable ambitions.  Anyone fond of haunted house films, psycho films or horrorthrillers with a bit more metaphorical depth should find plenty to enjoy.  It certainly is not worth spending 30 for a DVD that was the price my local PBS station was asking for a copy of the film after they showed it factoring in shipping and handling, but it is worth a rental, and it is definitely worth watching for free.",
		"We watched women inferior I plan on trying to get a copy of it myself to watch.  The story is very touching and I would recommend it to anyone.  I am a fan of different cultures and this movie was just what I needed.  This is a movie for the whole family despite its rating.  This is a movie I will show to my children.  The professor of our class meant for the movie to primarily be a too to educate about women, but this movie was more than that.  It is one of those movies that will forever stick out in my mind and will be a favorite.",
		"The filming is pleasant and the environment is keenly realistic.  I liked it difficult It seemed worthwhile to experience.  The interwoven role which Buddhism plays is probably the most truetoform  both in its menial and in its philosophic aspect, perhaps the most effective that I have seen in Chinese film.  Casting is great.  Images are memorable.  Acting is solid enough.  Thematically puerile but still rich enough to compliment the vehicle of its expression.",
		"King of Masks Bian Lian in China is a shockingly beautiful and profoundly touching film.  Winner of 16 awards from around the world, this film based on a true story centers on Wang Bianlian, a street performer in 1930s China who is growing older but has no heir to pass on his art of facechange opera.  He has a unique talent of quickly changing masks in performance, and no one knows how he does it.  He has a longing desire to have a grandson, as his art is a family heirloom that can only be passed on to a male heir.  We are daughters worth Wang Bianlians story goes on from there.The film was so astonishingly good, the acting was amazing, and the issues were so weighty and welladdressed.  There is the gender inequality and the depressing fact that in this time and place, no one wants a little girl.  Also interesting to note is that the famed opera actor who always plays a woman and is known as the Living Bodhisattva is a man who dresses as a woman, and while he is famous and wellrespected, he regards himself as something low, a half woman.  As we go further into the film, the face the issues of human slave trade and its demand and thus the lack of a possible solution for it, the brutality and corruption of the military and police, and the helplessness and lack of power any individual can face due to unfortunate events or even good intentions.This is definitely one of the best movies I have ever seen in my life, and Xu Zhu, the actor who plays Wang Bianlian, presents yet another beautiful performance.",
		"This is probably my favorite movie of all time.  It is perfection in its storytelling.  It break it sentimental You feel for Doggie because of the hopeless situation that existed for young girls in China at that time.",
		"Dominion Tank Police is without a shell of a doubt, one of the most amazing shows ever produced, but not just in the field of animation.  While the first part Acts 1 and 2 mostly consists of action and fun, the second part is more serious and one should not treat the second part in the exact same way as first part.  The subtleties are truly out of this world and the characterization is beyond brilliant.  You must have an extra degree of intelligence to appreciate the intricacies of the second Part Acts3 and 4.  I do have some complaints though.  In the first part, the Tank Bonaparte quite literally jumps over a tank shell and it did not make any sense at all.  One question it cool Buaku rules.",
		"The anime that got me hooked on anime...Set in the year 2010 hey, that is not too far away now!  the Earth is now poison gas wasteland of pollution and violence.  Seeing as how crimes are happening ever 30 seconds are so and committed by thieves who have the fire power of third world terrorists, the government of the fictional New Port City form the Tank Police to deal with the problem  cops with tanks!  Oh the insanity! The heroes of this series include the new recruit Leona Ozaki, a red haired Japanese woman yeah I know, they never match their distinctly Japanese names with a Japanese appearance who has just been drafted into the Tank Police and is quickly partnered with blond, blue eyed nice guy Al.  Leona is new at using tanks and unfortunately she destroys the favorite tank of Tank Police Commander Charles Britain also known as Brenten, a big guy who looks like Tom Selleck on steroids and sporting a pair of nifty sunglasses, a big revolver and a bad temper.  Britain wrecking his Special There is also Specs, the bifocal genius, Bible quotingGod fearing Chaplain, purple MOhawked Mohican, and the pot bellied Chief, who is right on the edge thanks to the Mayor always yelling at him about the Tank Police antics.  Seeing as how the tank cops often destroy half the city while chasing the bad guys and use extreme violence to capture them, they are not very well liked by the people.The villains are a cyborg named Buaku who is got a mysterious past that is connected with a project known as Green Peace, his gang and his two sexy cat cyborg sidekicks Anna  Uni Puma.  In the first installment these guys are being paid to steal urine samples from a hospital treating people who have not been infected by the poison gas clouds and in the 2nd they are hired to steal a painting that is of a naked Buaku.  The story, however, was uncompleted in the anime and was finished up in a cult comic Manga book that is very hard to find.All sorts of chaos and mayhem ensue in this black comic venture that examines how far people want their police to go in order to catch criminals and what happens when the fine line between good guys and bad guys starts to get blurred.  This is the kind of thing that if you were going to make a movie of it, you would better go get Quentin Tarantino.  Uneven in places but still a lot of fun.Followed by New Dominion Tank Police.",
		"After Aakrosh , this was the second film for Govind Nihalani as a director.Till this movie was made there was no audience for documentaries in India.This movie proved a point that a documentary can fulfil the requirements of a commercial film without diluting its essence.  It was one of the successful movies in the year in which it was released.  This movie contested against the big banners of the bollywood likeCOOLIE, BETAAB,HERO in 1983.SmithaPatel, in this movie acted more like a conscience of the hero whenever he drifted away or lost his composure she was there to remind him.  She captivated he able The anger which left half handedly continued in Govind Nihalanis other film Drohkaal.  Even after two decades, this movie is remembered just because of the director and the entire crew.  Each one played their part par excellence.",
		"I loved this film.  Not being a swooning Ed Wood Jr. fan, I prefer to appreciate his boundless enthusiasm and acknowledge his shortcomings.  His movies are fun, but his personal story is one racked with pain.  I hoped, and was delighted to find, that this film would be about understanding his turbulent life, rather than simply heaping him with posthumous praise.  From beginning to end, this film evolves from a documentary into a mythology, leaving the cast and the viewer unexpectedly connected to each other and to Ed Wood Jr.What we get are people who knew Ed Wood the best talking about him from all perspectives, positive and negative, and showing us their character as much as Eds.  We get itself disrespectful The set designer uses a sense of humor and also a great deal of insight when matching each cast member with their background.Fans will be excited to hear personal testimony regarding Ed Wood controversies, and new comers will be amazed that this man was real.  The DVD is full of impossible to find gems Crossroads of Lorado and photo galleries, but the real treasure of this film is the surprisingly engaging and interconnected story.Ed Wood had a habit of defining people through their association with him for better or worse, to the point where one woman will go down in history as Swimming Pool Owner for once letting him and his friends be baptized in her pool.  This ability to define a persons legacy comes through universally, as the most amazing effect of the film is to not only give a well rounded idea of the man that was Ed Wood Jr., but also to give a comprehensive view of the community that he created.  Somehow, without ever having more that one cast member being interviewed on screen at a time, the connection that Ed Wood created amongst the various people in his life becomes clear, and the viewer is left with great sense of involvement.Even the title hints at the Blist horror genre, but by the end, we see that even this is a kindness.  What begins as unrelated stories by random people ends with the conclusion that all of the cast will be forever weaved into an unpredictably cohesive fabric that history will bring into haunting unity with Woods legend.In many ways a living contradiction, Ed Wood Jr. could not be condensed to a single viewpoint.  This collaborative effort is the closest to knowing him that we can ever get.  Being itself a juxtaposition of themes, it is at once respectful, provocative, thoughtful, gripping, fun, sad, kind, and fulfilling.",
		"An excellent and accurate film...  McGovern takes great pains to research and document his writing and it pays off.  He is it clean I found this movie as accurate, well acted and well presented as Hillsborough and I applaud McGovern for his poignant unapologetic writing.  Well done and my hat is off to the writer, the actors, the production crew.  A great film!",
		"I LOVE Jacks spooky He is just hilarious!  Daniels starting to catch up on him to!  Good thing Jacks not on the team anymore in a way or else it would have been sarcasm mania!!!! I just love all the plots season 8, a little less, I have to admit, the characters are great, the actors are great, I am starting to pick up facial expressions and more from Jack, Daniel and Tealc...It just all theoretically possible and exciting...oops!  Their I go again!!!  Sorry, I am also starting to pick up traits from Carter, and all of this is driving my parents NUTZ!!!!!!!  Well, to conclude, I think it is good for another three seasons or so, especially if they keep on packing the episodes with all this humor, drama, action and so forth!!!!!!!!!!!!!!!!",
		"The movie starts something like a less hyperkinetic, more pastiche Dead or Alive strange underground activities are done while bodies are discovered by police officers.  But when a police officer is killed, one Tatsuhito gets involved... and when he discovers that his brother Shihito is also involved, things get bloody quite fast.An earlier work of Miikes, Shinjuku Triad Society is still filled with his usual in the ol ultraviolence and sadistic sex acts, though it is not one of his more eclectic or flamboyant pieces.  Rather, it is a pretty well crafted bit of pulp fiction, as Tatsuhito digs his way through the underground, a maze that leads him to a gay Triad leader who sells illegally gained body organs from Taiwan and keeps an almostbrothel of young boys one in particular the character who kills the cop at the beginning.  Tatsuhitos brother is getting involved with said society, so Tatsuhito himself is forced to become a dirty cop and use similarly violent and sadistic tactics to penetrate into this sordid realm.What is mainly interesting about this little bit of work is the relationship Tatsuhito has with his nemesis, Wang.  Tatsuhito is a Japanese born in China, later moved back into Japan, and alienated for it.  Wang is a Chinese who felt alienated in China, so killed his father and developed a crime wing in Japan.  Wang is it sorry And Tatsuhito himself is a similarly tragic figure when he is forced to contend with his lack of ability to control his brother.  While it would be rude to state that Miikes movies are successful mostly on their shock value, it is true that sometimes it is easy to lose track of how well Miike can create bitter, disimpassioned characters.PolarisDiB",
		"A lot has been said about Shinjuku Triad Society as the first true Miike film and I thought this sort of description might have been a clich?.  But, like all clich?s, it is based on the truth.  All the Miike trademarks are here, the violence, the black humour, the homosexuality, the taboo testing and the difficult to like central character.  Shinjuku is however, one of Miikes most perfectly formed films.  He says he different I think what he means is that the film possesses a truly captivating energy and raw edge which seems so fresh that although he might be able to capture a more visually or technically complex movie he could not replicate or better the purity of this film.  As you might expect, the violence is utterly visceral, gushing blood and gritty beatings are supplemented by a fantastic scene in which a woman has a chair smashed over her face.  Only a Miike film could let you get away with a sentence like that.  The film has a fantastic pace, unlike Dead or Alive which begins and ends strongly and dips in the middle.  Dead or Alive also deals with similar issues, Miike is clearly concerned about the relations between the Japanese and Chinese in the postwar period and this emotive subject is handled well here, the central character really coming to life when you begin to understand his past.  I cannot sing Shinjukus praises enough.  I do not want to give away too much.  This is Miike before he began to use CGI to animate his films and is almost reminiscent of something like Kitanos Sonatine.  The central characters are superbly realized and the final twist guarantees that as soon as the film has finished you will be popping it back on again to work it all out.",
		"A lot has been said about Shinjuku Triad Society as the first true Miike film and I thought this sort of description might have been a clich?.  But, like all clich?s, it is based on the truth.  All the Miike trademarks are here, the violence, the black humour, the homosexuality, the taboo testing and the difficult to like central character.  Shinjuku is however, one of Miikes most perfectly formed films.  He says in an interview that if he made it again it would be different, but not necessarily better.  I think he able As you might expect, the violence is utterly visceral, gushing blood and gritty beatings are supplemented by a fantastic scene in which a woman has a chair smashed over her face.  Only a Miike film could let you get away with a sentence like that.  The film has a fantastic pace, unlike Dead or Alive which begins and ends strongly and dips in the middle.  Dead or Alive also deals with similar issues, Miike is clearly concerned about the relations between the Japanese and Chinese in the postwar period and this emotive subject is handled well here, the central character really coming to life when you begin to understand his past.  I cannot sing Shinjukus praises enough.  I do not want to give away too much.  This is Miike before he began to use CGI to animate his films and is almost reminiscent of something like Kitanos Sonatine.  The central characters are superbly realized and the final twist guarantees that as soon as the film has finished you will be popping it back on again to work it all out.",
		"Masters of Horror Right to Die starts late one night as married couple Abby Julia Anderson  Ciff Addison Martin Donovan are driving home, however while talking Cliff is distracted  crashes into a tree that has fallen across the road.  Cliffs airbag works OK  he walks away with minor injuries, unfortunately for Abby hers did not  she ended up as toast when she was thrown from the car  doused in petrol which set alight burning her entire body.  Abbys life is saved, just.  She is taken to hospital where she is on life support seriously injured  horribly disfigured from the burns.  Cliff thinks they rich However Abby has other plans of her own...This American Canadian coproduction was directed by Rob Schmidt whose only horror film previously was Wrong Turn 2003 which on it is own hardly qualifies him to direct a Masters of Horror episode  was episode 9 from season 2 of the Masters of Horror TV series, while I did not think Right to Die was the best Masters of Horror episode I have seen I thought it was a decent enough effort all the same  still does not come close to being as bad as The Screwfly Solution 2006.  The script by John Esposito has a neat central idea that is not anything new but it uses it effectively enough although I would say it is a bit uneven, the first 15 minutes of this focuses on the horror element of the story but then it goes into a lull for 20 odd minutes as it becomes a drama as the legal wrangling over Abbys life  the affair Cliff is having take center stage before it gets back on track it a deliciously gory  twisted climax that may not be for the faint of heart.  The characters are a bit clich?d, the weak man, the bent lawyer, the protective mum  the young tart who has sex to get what she wants but they all serve their purpose well enough, the dialogue is OK, the story moves along at a nice pace  overall I liked Right to Die apart from a few minutes here  there where it loses it is focus a bit  I was not that keen on the ambiguous ending.Director Schmidt does a good job  there are some effective scenes, this tries to alternate between low key spooky atmosphere  outandout blood  gore.  There are some fantastic special makeup effects as usual, there is shots of Abby where she has had all of the skin burned off her body  the image of her bandaged head with her teeth showing because she has no lips left is pretty gross images  makeup effects that reminded me of similar scenes in Hellraiser 1987  it is sequels, then there is the main course at the end where Cliff literally skins someone complete with closeups of scalpels slicing skin open  him peeling it off the muscle  putting it into a cooler box!  Very messy.  There are also various assorted body parts.  There is some nudity here as well with at least a couple of pretty ladies getting naked...Technically Right to Die is excellent, the special effects are brilliant  as most Masters of Horror episodes it does not look like a cheap madeforTV show which basically if the truth be told it is.  The acting was fine but there is no big names in this one.Right to Die is another enjoyable  somewhat twisted Masters of Horror episode that most horror fans should definitely check out if not just for the terrific skinning scene!  Well worth a watch... for those with the stomach.",
		"I am Rob mediocre There was a similar underdog story in season one, when William Malone made on of the best episodes with The Fair Haired Child even though his other long feature films Fear Dot Com and House on Haunted Hill sucked pretty badly.The story of Right to Die cleverly picks in on the nowadays piping hot social debate of euthanasia, but thankfully also features multiple oldfashioned horror themes like ghostly vengeance, murderous conspiracies, pitch black humor and comic book styled violence.  Whilst driving home late one night and discussing the husbands continuous adultery, the Addison couple are involved in a terrible car accident.  Cliff walks away from the wreck unharmed but his wife Abby is fully burned and needs to be kept alive artificially.  Whilst Cliff and his sleazy attorney Corbin Bernsen of The Dentist want to plug the plug on her and sue the car constructor, Abbeys mum sets up a giant media campaign to keep her daughter alive as a vegetable and blame everything on Cliff.  Meanwhile Abbeys hateful spirit comes back for revenge and kills someone in Cliffs surrounding whenever she has a near fatal experience with the medical devices.  After a few victims, Cliff realizes it might be safer for him to keep his wife alive if he wants to remain alive as well.  Right to Die is a stupendous episode and exactly the type of stuff I always hoped to see from a TVseries concept like Masters of Horror.  It is violent and gory with a sick  twisted sense of humor and loads of sleaze sequences.  The euthanasia theme and the whole obligatory media circus that surrounds it is processed into the script very well, yet without unnecessarily reverting to political standpoints or morality lessons.  The atmosphere is suspenseful and the killing sequences are suitably nasty and unsettling.  Actresses Julia Anderson and Robin Sydney both have pretty face and impressively voluptuous racks, which is always a welcome plus, and Corbin Bernsen is finally offered the chance again to depict a meanspirited and egocentric bastard.  Great MoH episode; definitely one of the highlights of both seasons.",
		"Fans of the HBO series Tales From the Crypt are going to love this MOH episode.  Those who know the basic archetypal stories that most of the classic EC comics were based on, will recognize this one right off the bat.Underrated indie favorite Martin Donovan also an excellent writer  coauthor of the screenplays for APARTMENT ZERO and DEATH BECOMES HER is the kind of guy whose everyman good looks can go either way.  He could play a really nice if misunderstood guynextdoor, or he can play the same role with a creepy undertone of corrosive sleaziness.  In the case of RIGHT TO DIE, he takes the latter approach, and it definitely works.Donovan is a doctor who has recently had an affair with his slutty office receptionist Robin Sydney, much to the displeasure of his inconsolable, unforgiving spouse, Abbey Julia Anderson.  When the two of them get involved in a terrible car accident while returning from an unsuccessful weekend of making up, and she is horribly burned in a fire, he is reluctant to pull the plug on her, not without some enthusiastic nudging from his even sleazier lawyer and best buddy Corbin Bernsen, looking the worse for wear these days.  But Abbeys never been one to give up without a fight, and that is where the ECtheme of the episode comes in.  Cuckolded husbands  and wives  have always been the genres favorite subject matter for some spooky and OOKY supernatural shenanigans, and this case is definitely no exception.  If anything, the rampedup quotient of sex and gore must have Bill Gaines cackling with glee in his mausoleum somewhere.And that is not to mention that John Espositos original script does give the adultery angle just a slight twist.  You do you close At least Rob Schmidt does display touches of flair here and there with the direction, especially in a scene that makes cell phone picture messaging into a truly horrifying experience indeed!  As with most MOH episodes, this one is following a prevalent theme this season of flaying and dismemberment, so the extremely squeamish need not apply.",
		"This was a superb episode, one of the best of both seasons.  Down right horror for a change, with a story that is way way above the average MOH episodes, if there is such a thing.  A mans wife is almost burned to death in a tragic car wreck, in which he was driving.  His airbag worked, hers did not.  She is burned beyond recognition great makeup btw, and not given much of a chance to live without a full skin graft.  BUT, even in a coma, she keeps dying but brought back by modern technology, and when she does die for a few minutes, her ghost appears as a very vengeful spirit.  Carnage of course ensues, and also some extremely gory killings, and also, some extremely sexy scenes.  What more could you ask for, you might ask?  Well, not much, because this baby has it all, and a very satirical ending, that should leave a smile on most viewers faces.  I loved Rob Wrong Excellent episode, this is one I am buying for sure.",
		"Does anyone know the exact quote about time and love by George Ede aka, Father Fitzpatrick in the move, It had to be you?  He was talking to Charlie and Annna in the church as they were leaving?  If not I will have to rent the movie.  This was a great movie.  I also loved Serendipity!  Great love story for the soul!  I met my ready Altho, we did marry, I was not mature enough to give as much as I thought I would.  I got complacent and took his love for granted and he withstood it for 7 years.  He finally left with resentment but we are still hurt and angry  in disbelief about the way it turned out.  I had some very hard lessons to learn and we have now been apart 3 years.This movie meant a lot because I am still waiting on reconciling with my one and only true love.  I can NOW appreciate that distinct feeling inside of me and the quote of Father Fitzpatrick rang true for me.I know when he has healed enough to trust me again, we will remarry.Do not EVER GET COMPLACENT AND TAKE TRUE LOVE FOR GRANTED!  IT HAS BEEN THE HARDEST LESSON OF MY LIFE.  Also the music in this movie is OUTSTANDING and MEANINGFUL!  This movie is DEEP and spiritually uplifting.  TRUE LOVE is worth waiting for, if it is meant to be, it will, no matter what, IT WILL HAPPEN!  Nothing is impossible, even when it is the second time around!  Thanks!",
		"Does anyone know the exact quote about time and love by George Ede aka, Father Fitzpatrick in the move, It had to be you?  He was talking to Charlie and Annna in the church as they were leaving?  If not I will have to rent the movie.  This was a great movie.  I also loved Serendipity!  Great love story for the soul!  I met my one true love my Soulmate and although I had the experience to meet him when I had least expecting it, I was not ready for that kind of emotional relationship.  Altho, we did marry, I was not mature enough to give as much as I thought I would.  I got complacent and took his love for granted and he withstood it for 7 years.  He left we angry I had some very hard lessons to learn and we have now been apart 3 years.This movie meant a lot because I am still waiting on reconciling with my one and only true love.  I can NOW appreciate that distinct feeling inside of me and the quote of Father Fitzpatrick rang true for me.I know when he has healed enough to trust me again, we will remarry.Do not EVER GET COMPLACENT AND TAKE TRUE LOVE FOR GRANTED!  IT HAS BEEN THE HARDEST LESSON OF MY LIFE.  Also the music in this movie is OUTSTANDING and MEANINGFUL!  This movie is DEEP and spiritually uplifting.  TRUE LOVE is worth waiting for, if it is meant to be, it will, no matter what, IT WILL HAPPEN!  Nothing is impossible, even when it is the second time around!  Thanks!",
		"It is amazing that from a good, though not wonderful, film made back in the early Nineties, a whole franchise can grow.  Stargate; SG1 is, without a doubt, a worthy addition to the science fiction genre and has the right to stand shouldertoshoulder with Star Trek as the kings of scifi.Following on from the 1994 feature film Stargate, this series sees Stargate command a militaryscience organisation figuring out that the stargate system can be used to travel to various planets across the galaxy and beyond and the military sets up a number of teams to explore.  SG1 is one such team, headed by military veteran Colonel Jack ONeill, and includes archaeologist Doctor Daniel Jackson, military scientist Captain Samantha Carter and alien Tealc, who has betrayed his overlord leaders in the hopes of one day freeing his people.  Earth makes themselves equal Richard Dean Anderson is perfect as the cynical and sarcastic ONeill, who can shift from boyish to deadly in the blink of an eye.  Michael Shanks, as Daniel, brings heart and an will of steel to the character, who has grown from wideeyed innocence to darker and more hardbitten as the show has progressed.  Amanda Tapping, as Carter, has perfected the balance between depicting her characters femininity without comprising the fact she is a strong, intelligent military scientist.  Christopher Judge is excellent as the aloof Tealc, who is able to depict the characters emotions with subtlety.  And Don S Davis is perfect as the esteemed General Hammond who leads with a good balance of fairness and firmness.Almost all the episodes are are involving and portrayed with intelligence, reflecting on moral dilemmas as well as the friction between military interests and civilian beliefs often shown through arguments between ONeill and Jackson.  Guest characters are solidly depicted and story arcs are handled in a manner that does not bore viewers.  SG1 also excels in humour, from ONeills wisecracks to episodes that are just wacky and odd!  SG1 has everything from action to drama to romance to suspense to the heartbreaking scenes of death.  It is not just an excellent scifi show but is an excellent show, overall.",
		"I just cannot understand the negative comments about this film.  Yes it is a typical boymeetsgirl romance but it is done with such flair and polish that the time just flies by.  Henstridge talk about winning the genepool lottery!  is as magnetic and alluring as ever who says the golden age of cinema is dead?  and Vartan holds his own.There is simmering chemistry between the two leads; the film is most alive when they share a scene  lots!  It is you willing If you are already happy, then you will be euphoric.PS I am 33, Male, from the UK and a hopeless romantic still searching for his Princess...",
		"This great movie has failed to register a higher rating than 5! Why not! It is itself freakish In summary I believe that this film is one of the worlds great documentaries as it is forthright, honestly portrayed and a great witness to the Christian faith!",
		"I took a flyer in renting this movie but I gotta say, it was very, very good.  On all fronts script, cast, director, photography, and high production values, etc.  Proves Eva Longoria Parker is head and shoulders in romcom above bad actors such as Kate Hudson and Jennifer Aniston, who mug and call it acting.  Whoda thunk it? Parker and Isla Fisher are in a class by themselves in this regard and should try to hold out for projects as good as Over Her Dead Body.  Lake Bell is excellent, too, and this is the first time I have seen her.  And finally, Paul Rudd gets to shine in a really good movie, instead of lesser films.A movie like this never gets its dues from closeminded males.  It is too bad.  As other IMDb reviewers here have noted, there is nothing lame about this gem no hack writing or acting.  And its depiction of contemporary L.A. and California, in general, makes every scene look bright, beautiful, clean, and otherwise outstanding in every way.  Never before has a movie made L.A. look so good.  Ah, what a little talent and a lot of caring can do for a movie.I will not divulge the plot, but as a longtime and hardcore atheist, I was willing to suspend disbelief and buy into the supernatural theme in order to enjoy an excellent and lighthearted piece of entertainment.  It reminds movie popular We already know the public taste leans heavily toward the mediocre.  Some of us save our praise for the truly worthy, however.If you have enjoyed other overlooked gems such as Into the Night with Michelle Pfeiffer, Jeff Goldblum and Clu Gulager, Blind Date with Bruce Willis and Kim Basinger, American Dreamer with JoBeth Williams, Chances Are with Robert Downey Jr., Christopher McDonald and Cybil Sheppard, Making Mr.  Right with John Malkovich, etc., you will enjoy this.  A firstrate job all around even if it is kinda hard to believe a straight guy can pretend to be gay for more than five years.  But even that plot device does not detract from the movies overall excellence.",
		"Ah, I loved this movie.  I think it had it all.  It made me laugh out loud over a dozen of times.  Yes, I am a girl, so I am writing this from a girls perspective.  I think it is a shame it only scored 5.2 in rating.  Too many guys voting?  It was far above other romantic comedies.  Just because I am female I do not enjoy all chic flicks, on the contrary I prefer other genres.  Romantic comedies tend to be shallow and not as funny as they meant to be.  But like I said, this movie had it all, almost, in my opinion.  Great script, good oneliners, fine acting.  Although Eva Longoria Parkers character reminded very much of Gabrielle from Desperate Housewives, but so what?  It was awesome.  I keep I low",
		"I found it brilliant Sadly the actual film was not as good.  OK, there were a few laughs and the actors all worked well.  But from the beginning the plot was about as predictable as the destination of the flight I was on.  I think the whole gaybutnotgay friend part of the story could have been worked a lot better.  The talking parrot was a nice idea but to be honest it was not really very funny.In summary the film was more interesting than staring at the seat in front of me, but it was a close call.",
		"De Grot is a terrific Dutch thriller, based on the book written by Tim Krabb?.  Another of his books, Het Gouden Ei was made into the great Dutch mystery thriller called Spoorloos The Vanishing in 1988.  This one is not as good as that thriller although much better than the American remake also called The Vanishing but there are times it comes close.Especially the opening moments are terrific.  We see a man, later we learn his name is Egon Wagter Fedja van Hu?t, coming from a plane in Thailand.  When he picks up his bags it is pretty clear that he is smuggling something across the border.  These scenes are perfectly directed, photographed and acted.  A kind of suspense is created that you would normally not have in an opening scene like this.  Later we see how Egon makes his deal in Thailand with a woman, both stating that they have never done anything like this.From this point the movie is constantly flashback and flashforward.  We see how Egon, still as a child here played by Erik van der Horst, befriends a guy named Axel as a kid played by Benja Bruijning.  We learn how they grew up as friends, sort of, and how Axel as an adult played by Marcel Hensema became a criminal.  Egon in the meanwhile goes to college and settles with a woman.  Around this time he sometimes meets Axel but does not really want anything to do with him.The movie is chronological in a way.  It shows Egon and Axel as kids, than as students, young adults, and in their midthirties.  But from time to time, like I said, the movie goes back to when they were kids and jumps forward again.  Every time we see them as kids it explains something that happens when they are adults.Minor spoilers herein.The title means The Cave, and it is the cave that gives the movie its happy ending, although it is in fact not that happy.  Like the beginning, the ending is terrific.  The middle part of the movie is entertaining and in a way it distracts our attention of the first scenes, only to come back at that point in the end.  It is we happy",
		"Indian Directors have it tough, They have to compete with movies like Laggan where 11 henpecked,Castrated males defend their village and half of them are certifiable idiots.  Devdas festooned characters oblivious But to make a good movie, you have to tightrope walk to appease the frontbenchers who are the quentessential gapers who are mesmerized with Split skirts and DishumDishum fights preferably involving a nitwit Bollywood leading actor who is marginally handsome.  So you can connect with a director who wants to tell a tale of Leonine village head who in own words defending his Village this is considered a violent movie or too masculine for a male audience.  There are very few actors who can convey the anger and pathos like Nana Patekar Narasimhan.  Nana Patekar lets you in his courtyard and watch him beret and mock the Politician when his loyal admirers burst in laughter with every word of satire thrown at him, meanwhile his daughter is bathing his Grandson.This is as authentic a scene you can get in rural India.  Nana Patekar is the essential actor who belongs to the old school of acting which is a disappearing breed in Hindi Films.  The violence depicted is an intricate part of storytelling with SongDances thrown in for the gawkers without whom movies will not sell, a sad but true state of affairs.  Faster this changes better for Bollywood.  All said and done this is one good Movie.",
		"I initially bought this DVD because it had SRK and Aishwarya Rai on the cover and I thought, hey!  another film starring Aishu and Shah Rukh, little did I know that Aishwarya would only appear in an item number in the last quarter of the film in a song which she shares with SRK and helps introduce his character who is in the film for about just 15 minutes.  Shakti is a film about a mothers love and endurance.  It is a film about transformations, ignorance, coming of age, stepping into the know and embracing the harsh realities of life.  The item number in which SRK and Aishu appear in has nothing to do with the movie.  It is SRKs unconscious He dreams that Aishwarya Rai is this sexy street girl who shows up at his favourite hangout spot one day, dressed scantily and begins to seduce him.  The title of the song is Ishq Kamina loosely translated as Loves a bitch!  and it is just plain smoking hot!  Do not miss it.",
		"A strong woman oriented subject after long, director Krishna Vamsis Shakti The Power, the Desi version of the Hollywood hit Not Without My Daughter is actress Sridevis first homeproduction.  A story about a womans fight against harsh injustice.The story of the film revolves around Nandini Karisma Kapoor who lives in Canada with her two uncles Tiku Talsania, Jaspal Bhatti.  There she meets Shekhar Sanjay Kapoor, falls in love with him and they soon marry.  Their family is complete when Nandini has a boy, Raja Master Jai Gidwani.  But their happiness is short lived, as the news of Shekhars ailing mother Deepti Navalmakes them leave their perfect life in Canada and come to India.  And that is when the problems start.  From the moment they reachIndia, both are shocked to see the pollution and the vast throngs of people everywhere.  They take a crowded train to reach Shekhars village and when they finally reach the station, they have to catch a long bus drive to his village.  The filthy sweaty bus combined with the uncertain terrain makes it a neverending drive.  And unfortunately for them, a frenzied mob that beat Shekhar out of shape for no fault of his attacks their bus.  Fortunately, they get shot dead just in time before they can further harm him.  After that, they drive to the handing Havel where Shekhars father, Narsimha Nana Patekar lives with his wife Deepti Naval.  Nandani is her warm The day she sees her fatherinlaw teach her son to throw a bomb, she loses it and lashes out against him, insisting to Shekhar that they move back to Canada.  But terror strikes again when Shekhar is murdered one day, leaving a broken down Nandini alone with her son in this strange land where she is harrowed by a cruel fatherinlaw.  Her fight against this man to save her son is what makes up the climax of this emotional heartwrenching film.What sets apart Shakti from most films being made off late is also the rural setting of the movie.  The only drawback is Ismail Darbars music, which fails to rise above the script.  The only saving grace is the sexy item number Ishq Kameena, which has been composed by Anu Malik.  Another pat for the director comes because he has extracted some splendid performances from his cast.  Karisma Kapoor is the life of the film and has given a moving performance as a helpless mother.  She is sure to win awards for this heated portrayal.  Second is actor Nana Patekar who is back with a bang with this film.  His uncouth mannerisms suit him to the hilt and he is shown his versatility once again with this role.  Sanjay Kapoor is the surprise packet of the film with a sincere and effective portrayal that stands up against both the other actors.  Deepti Naval too is in top form and her Prclimax showdown with Nana is praiseworthy.  Shahrukhs cameo provides the lighter moments and surely he is been pulled in to get the required star value.  Though his role was not really required, he is done it well.  Overall, Shakti is a far superior film than most churned out these days and the Prrelease hype is sure to get it a good opening.  Shakti is sure to get the critics and audience thumps up.  So what if the film needs to be desperately trimmed by at least 2 reels to better the impact.  Shakti still has the power to go on without a hitch!",
		"What is contained on this disk is a first rate show by a first rate band.  This disc is NOT for the faint of heart...the music is incredibly intense, and VERY cool.  What you will learn when you watch this movie is just why the Who was so huge for so long.  It is their great In 1969 when this concert was shot, the screaming teenie boppers that threw jelly beans at the Beatles were gone and bands and audiences had settled down to long and often amazing displays of musical virtuositysomething that few audiences have the intellectual curiosity to pursue in the age of canned music by Britney and Christina.  What you especially learn here are the amazing things that can happen when gifted musicians are encouraged to improvise.  Try the concert out, it really is amazing.",
		"This would have worked a lot better if it had been made as Mitchell in Malta.  At least then we would have been spared the sight of Joe Don Baker running around an otherwise scenic Mediterranean locale clad in that ridiculous looking cowboy outfit...not to mention acting like an Old West gunslinger.  Mitchell being Mitchell, the film would not have suffered from a lack of gratuitous police brutality either.  Oh well.  At least the comic comments of Mike and the Bots made this enjoyable fare as an episode of MST.  I imagine it own",
		"Joe Don Baker is one of a handful of actors who is often better than his material, and almost always under appreciated.  He is been in a ton of films either as a heavy or a hero, and has the type of strong, solid presence that Wallace Beery did half a century before him.  Baker can delivery material that would sound ridiculous coming out of another actor, and that is what is so great about him.  He seems he obvious It is what made the WALKING TALL Trilogy work so well, and that same magic is here in FINAL JUSTICE.  This was a substantial hit in theaters and on video in the 80s, and it has aged a lot better than many of the perhaps better known action flicks of the era.  By moving the action from Texas to Europe, there is a real timeless quality that does not jar you away from the action on screen.  To be honest, I have always enjoyed the films of Greydon Clark, who is a nononsense director in the same vein as 1970s Clint Eastwood, and this is one of his best.  FINAL JUSTICE is one of the lost gems of the late 80s, similar to MAN ON FIRE in its true grit and violence.  I suppose if they remake this with The Rock, a whole new audience will come to love it as much as I do.",
		"I am grateful to Cesar Montano and his crew in reviving the oncemoribund Visayan film understorey.  Panaghoy is hopefully the forerunner of a resurgence in this vernacular that claims more speakers than Tagalog.  The dialect and lifestyle details are accurately reminiscent of this region of the Philippines.  Downside the corny and stilted acting of the American antagonist.  The other item that I did not appreciate was the lack of authenticity in the period costume of the same character, and above all, his bright red kitcar that I suppose was meant to pass for a 1930s roadster.  Without those small yet glaring details, Panaghoy would have been at least a 9 out of 10 on my ratingdaghang salamat, Manoy Cesar!  Addendum this film sure beats Peque Gallagas Oro, Plata, Mata, which provided a different view of the Visayas during the Second World War.  Alos are Purple reminiscent",
		"I love the movies and own the comics, the comics are different then the movie but still I would give it 10 out of 10.  It was awesome.  If the movies got anymore awesome.  I would have her babies.  And I am female.  Read the comics you will not regret it.  Yes in this movie since Brian P. the artist for her died we do not get nearly as good artistic work.  I mean me wrong Different Strokes for different folks as the saying goes.  Any guy who does not go bonkers over her is insane, or does not like women, or you know just plan insane.  If I could count on my fingers how in love and how many times I have read the comics I would run out of fingers for sure, but hey there is always toes.",
		"Seldom do we see such short comments written by IMDb filmgoers.  Perhaps it is because this lightweight dark comedy entertains and pleases without depth, or are we missing something?  I would watch it again if I had some incentive.So what is a happenstance?  To the French it is Le Battement dAiles du Papillon Serendipity?  Fate?  Perhaps it is an event that is the culmination of a series of random happenings.  We begin fated.A minor All these incidents cause other events that ... well you get the picture?  Dominoes.  Multiply those by 30 characters and an average of 6 each and you have to really stretch your imagination to accept the remote chance that this scenario could happen.  And I think that there is a diagnosis for those who believe that life is like this.  But then this is the magic world of cinema.We admit that it is fun to watch the way the writerdirector weaves together these unrelated events into a story which enmeshes the lives of these French citizens.  If you have a couple of hours and are looking for a whimsical escape, heres the place to do it.  Or if you are recovering from surgery and are not going anywhere anyway, this will engage you while your stitches are healing.  Happenstance will not go down as an award winner but it should develop a cult following.  Stranger things have happened.  Soren Kierkegaard is attributed with the following Life can only be understood backwards; but it must be lived forward.  If you looked at the detail in many of your own life experiences meeting your first love, finding the perfect gift, your last auto accident you would find a series of seemingly random events leading up to it.That is the answer!  I forgot to bring along an existentialist to explain Happenstance to me.",
		"We have to remember that the 50s were practically a blank slate when it came to movies.  Hollywood was in transition from patriotic war movies, noir, two reel oaters, etc to movies with a message.  We had Blackboard Jungle, On the Waterfront and so on.  Some folks might think that was an improvement.  I do not.  Who was the mogul who said If you want to send a message, call Western Union?  He was right.  These psychological thrillers are less entertainment than some kind of remote therapy.This one is a pip.  It is about three sisters trying to wrest control of their dead fathers estate.  One of them, maybe the only one worth redemption enlists the aid of the company pilot to help her keep the rest of the family at bay.  He is initially in it for the bucks, but eventually falls for her.  Meanwhile the rest of the family schemes to sabotage the romance.  The results are predictable.  You get a little bit of everything in this movie.  Sexual tension between the sisters.  A little subtle masochism.  Hereditary insanity  if there is such a thing.  We never get to meet the parents, but they must really have been screwed up The cast is practically unknown.  One or two of the actors sound vaguely familiar.  The acting is so bad it is hard to believe.  It was released under the United Artists umbrella by a company called BelAir Productions.  It was shot in and around LA mostly at night and probably without permits.  The end was so bizarre that I thought it was a joke.  It was as if they ran out of money and the producer decided to wrap it up in the middle of a scene.I cannot explain it  not even to myself  but I gave this pile of trash an 810.  I am It good Well, maybe Hot Rods to Hell, but this one certainly fits.  You might want to try this if you love movies that seem like they were made in somebodys basement.",
		"That hilarious line is typical of what these naughty sisters say.  It is funny on its own terms and pretty funny unintentionally , too.  Only two of the sisters are really bad.  Boy, are they bad, too!  One is given to pinup poses and salacious comments where eer she goes.  The other is got up to look like Marilyn Monroe.  She has those sensual, slightly parted lips.  And, not to give anything away, she is even more bad than the other.All three sisters are played by starlets.  The man who stumbles into their lives is played by John Bromfield.  He had something of a career.This looks today like possibly the first mainstream softcore porn ever marketed.  Well, of course not the first but the raciest at that time.The girls wear as little as possible and let us not forget about the female audience members Bromfield is shown shaving with an electric razor  whose fetish was this?   barechested.  He also is shown sopping wet in a swimsuit.There is a real plot here, too The girls family, see, is cursed.  They are suicide.The bad I truly do not know where it was shown.  Maybe it was made for driveins.  Somehow, and I could be wrong, I felt that the typical male audience was not the primary target here.  The women are scantily dressed.  They often resemble lurid covers of mags like Police Detective or jackets of dime novels.But the guy seems to be the central focus.  Not everyone in the movie likes him, but all the girls love him.  And I think the audience is meant to also.It is lots of fun  and on its own terms, too.",
		"The unlikely duo of Zero Mostel and Harry Belafonte team up to give us some interesting performances and subject matter in The Angel Levine.  It is It elderly Mostel used to be a tailor and proud of his trade, but his back and arthritis have prevented him from working.  Kaminsky is mostly bedridden.  He is reduced to applying for welfare.  In desperation like Jimmy Stewart, he cries out to God for some help.Now maybe if he had gotten someone like Henry Travers things might have worked out differently, but even Stewart had trouble accepting Travers.  But Travers had one thing going for him, he was over 100 years off this mortal coil and all his ties to earthly things were gone.  God sent Mostel something quite different, the recently deceased Harry Belafonte who should have at least been given some basic training for angels before being given an assignment.Belafonte has not accepted he is moved on from life, he is still got a lot of issues.  He also has a wife, Gloria Foster, who does not know he is passed on, hit by a car right at the beginning of the film.  You put his issues and Mostels issues and you have got a good conflict, starting with the fact that Mostel cannot believe in a black Jew named Levine.This was the farewell performance for PolishJewish actress Ida Kaminsky who got a nomination for Best Actress in The Shop on Main Street a few years back.  The other prominent role here is that of Irish actor Milo OShea playing a nice Jewish doctor.  Remembering OSheas brogue from The Verdict, I was really surprised to see and hear him carry off the part of the doctor.The Angel Levine raises some interesting and disturbing questions about faith and race in this society.  It is brought to you by a stellar cast and of course created by acclaimed writer Bernard Malamud.  Make sure to catch it when broadcast.",
		"I got it obvious Elvira delivered the movie with as many laughs as one can.It is an ok monster flick, compared to the hundreds of horrendous American flicks made.  Way better!!!!",
		"YETI deserves the 8 star rating because it is the one of the greatest bad movies ever made.  I is you cant The millionaire who funds the project to thaw the Yeti looks like Chris Penn and John Goodman both poured into an illfitting suit  the guy playing the scientist is one of the worst actors to ever appear on screen  and yes, there is a mute boy who sorta kinda looks like a girl and he is mute ever since he survived a plane crash that killed both his parents hmmm maybe therapy for the kid??.  Then this hottie Italian girl is seen by Yeti once he thaws  which takes FOREVER  and he is instantly in love with her  what is one of the most hysterical things about the movie is that this giant Yeti makes bedroom eyes at her  it is like a large Barry White trying to seduce a groupie.  In fact, once the large Yeti picks up the hottie and has her against his chest  she accidentally touches the Yetis nipple and yes, the film takes the time to show his large grey nipple GET HARD!!!!  Yikes of all YIKES!  Plus there is a collie dog in it because the Italian producer must have heard that American audiences like dogs and he sorta kinda tried to get a Lassie  there is also this insane scene where the Yeti eats a giant fish  keeps the large fishbone and uses it to comb the Italian girls hair Gee, thanks Yeti  now my hair is smooth and smells like dead trout.  You are the best.  This film is more bizarre than something Ed Wood could have ever dreamt up.  If you are a fan of classic cinema crap  seek this baby out.",
		"People forget that there have been several King Kong ripoffs Congo, King Kong Vs.  Godzilla, King Kong 1976, they all ripoff one another, but YETI stands on its own.  It is it.This hard The first time I watched it was on Elviras Mistress of the Dark Shows in the early 1980s.  It sent chills down my spine as a kid, especially when the YETI got mad.  I saw it again, around 100am on ABC about 2 to 3yrs ago.  Seeing it again made me appreciate it more, it has some overall good effects for its time and the story involves a mute boy and his dog, and an evil businessman person who wants to kill the YETI for his own purposes.  Also the music is pretty cool,its very YETI like.  Gianfranco Parolini and the Yetians creates a great monster like atmosphere.Vote 7 and half out of 10.",
		"I disagree with Anyone who donet like this movie.  I used I little It is sweet, funny and warms your heart.  And It proves that love and friendship can never be destroyed.  And even though it did not have much of a story, it was still excellent I give it a 10 and two thumbs up.  Oh yeah and it proves that your deepest wishs and dreams can come true.  Tear, tearI love this movie, personally if anyone says it sucked than I will say Shame on you.  Because it was a delightful little movie and I am glad that at least SOME people liked it.",
		"Genre Dinosaur, animation, New York, time travel, circus.? Main characters Rex the Tyrannosaurus rex, Elsa the pterodactyl, Dweeb the Parasarolophus, Ooo the Triceratops, a boy called Louis, a girl called Cecilia and Captain Neweyes. ?  Actors John Goodman Rex, Yeardley Smith Cecilia, Martin Short Stubbs the clown, Felicity Kendal Elsa etc.? What happens Four dinosaurs see above are fed some brain grain cereal and are now cuddly, friendly dinosaurs who are going to be nice to children.  They go into New York, with big plansMy thoughts This is a cute animated film.  The animation of the dinosaurs when they go cuddly and friendly is a bit floppy and notsogood, but they look pleasant all the same that way.  I like they cuddly I like almost all the characters featured, especially Elsa and Cecilia, but of course I like the others as well.  Overall, I like this film a lot!  Recommended to People who like good childrens animated films, people who like dinosaurs, John Goodman and people who think that circuses are not always what they seem Enjoy! ",
		"I have not always been a fan, but the show grew on me.  It was not until after season 5 that I started to see the richness of the show.  They finally brought Daniel Jacksons search for his wife to an end and finally most of the Go,ould System Lords were killed by rival Lords, SG1 or others.Towards Season 5, Stargate SG1, was beginning to become stale.  With the new writers and the close attention by Produer Peter Deleuise, the show became more and more solid.The characters had become stale as well.  Colonel Jack ONeill was the stereotypical hero with emotional baggage.  After his son Charlie was killed in a shooting accident with ONeills weapon, he had decided to end his own life by going to Abydos in order to face off with the Goould RA.  The character offers little growth for any actor and actor Richard Dean Anderson chose to play him straight raising emotional barriers to protect himself. only allowing his close friends in.Amanda Tapping joined the cast as Captain Samantha Carter.  She was a feminist on the edge, ready to battle any man who would doubt her ability to do her job.  Though this character had little area to grow, Tapping has done a great job of concentrating on Carters strengths.  She has taken the time to get a basic understanding of some of the things Carter talks about in order that she can present the character intelligently.  Christopher Judge joined the cast playing the alien Tealc.  Tealc was an alien called the Jaffa.  Infant Goould, snake like creatures would embed themselves into the Jaffa until they had grown to the point when it would be inserted into another life form.  The Jaffa would die.  Tealc was the First Prime of Apophis army.  Knowing that Apophis was not a god like Goould pretend, he realized the genocide that their armies had wreaked on the galaxy.  Finally, having had enough, he and Jack ONeill freed their team along with quite a few innocent people.  After arriving on Earth, he realized that Earth was the planet he was looking for, who would help him fight the Goould.  Christopher Judge has done quite a bit with a limited character.  Tealc is a wise warrior, much of which he learned was from his teacher Master Bratac.  The show would not be complete without Master Bratac played by Tony Amandola.  He is also a rock.  In the end, he became adviser to most of SG1, especially Daniel Jackson.  Don S.  Davil was there from the beginning playing Major General George Hammand.  Davis has him sympathetic He does his job, has a wife, sons and daughters and grandchildren.  You can really say, he is the anchor of the base.  Simply, I would die for that man.  If not allowed by his superiors to provide troops to support teams off world.  He will go himself.  He does not leave anyone behind.I saved Dr.  Daniel Jackson for last, because this character, I believe has grown the most in the ten or eleven years it has been on.  In choosing Shanks I do not think the producer realized how strong Shanks would be and now when people talk about Jackson, they do not talk about Spader, they talk about Shanks.  In the early years, the Jackson character came off as a whiner.  That is why I probably was not a fan.  As the seasons pasted, the character became stronger.  This gave him confidence.  In the end, as of season 10, the Jackson character has matured to the point that he has become a self sacrificing hero.  He still monitors the groups ethics.  He still is lead at providing information that can move any mission forward.  Acheaology, History, Culture and Exploration are part of his very being.  He is determined.  Though a man of peace, he has matured to the point that using his weapons may be the only way to solve a disagreement.  Other characters include, most recently Vala Mal DoranClaudia Black and Colonel Cameron MitchellBen Browder, new lead of SG1.  Both actors come from a series called Farscape and why they were put together is any bodies guess.  I see little difference between Mitchell and Crichton Farscape character.  Blacks character is simply off the wall.  Definitely different from her soldier like character Arin Soon.",
		"Wow, alot of reviews for the Devils Experiment are here.  Wonderful.  My name is Steve and I run Unearthed Films.  We just started releasing the Guinea Pig films on DVD for North America.  Now before you ask why am I writing a review?  Instead ask why some people bash it.  I am writing this review because I love the Guinea Pig films.  Why do I love em, it is because they go for the throat and they do not let go.  I have seen it all.  Almost every horror film known to man, Argento, Fulci, Bava, Buttgereit. from every underground cult sensation to every Hollywood blockbuster.  I have seen it all and the films that have stuck in my head over the years was definitely the Guinea Pig films.  Why because it does not try to hide the reason why we watch horror movies in the 1st place.  This review is for the Devils Experiment.  I find it devoid Why do I watch horror films?  So I can see blood and gore and the torture of people.  The Devils Experiment not only delivers but that is all it is.  Pure unadulterated violence.  Yeah I like a story but sometimes I just want the gore and the Devils Experiment delivers ten fold.  Why do people bash it.  Cause they like a story, so that the torture and death of a person can be hidden behind a story.  It make em feel better about themselves.  We all want blood and gore.  It is just really hard to justify it if it is not wrapped around a story.  The Guinea Pig films have a historical meaning to them and they have created a definitive splash whenever they have been released.I am thrilled to be able to release one of the most famous horror series in the world.  Maybe I should not have written this review but then again maybe I should.  My view is biased cause were releasing them but then again it is not.  I have always told people to find them and to watch them way before I started Unearthed Films.  Sure it is exploitive and over the top but is not that why we watch horror films in the 1st place.  The Devils Experiment is NOT for everybody.  It is for thrill seekers and gorehounds only.  If you think Jason movies and Freddy Krueger movies are awesome then stick to those.  But if your on the next level and have seen it all then the Devils Experiment is for you.  There is a reason why they have not been released for over 17 years.  They are wrong, disgusting and down right freaky and not something to watch with your mom, unless she is totally cool.  Good luck, enjoy and never stop living your life.",
		"First off, this is not supposed to be a brilliant and thought provoking film like so many other reviewers seem to compare it to. the first review says something along the lines of anyone who likes this knows nothing about horror cinema, apparently its the other way around.  If one were to look back after the film it really was not meant to be convincing, it was a low budget ipecac.  But really thats all it was aiming for, it was meant to blow viewers away with sheer shock value and all the flaws it its visuals were much less noticeable back in the original VHS versions.  I gave it tortured",
		"This typical Mamet film delivers a quiet, evenly paced insight into what makes a confidence man Joe Mantegna good.  Explored as a psychological study by a noted psychologist Lindsay Crouse, it slowly pulls her into his world with the usual nasty consequences.  The cast includes a number of the players found is several of Mamets films Steven Goldstein, Jack Wallace, Ricky Jay, Andy Potok, Allen Soule, William H.  Macy, and they do their usual good job.  I loved Lindsay Crouse in this film, and have often wondered why she did not become a more noted player than she has become.  Perhaps I am not looking in the right places! The movie proceeds at a slow pace, with flat dialog, yet it maintains a level of tension throughout which logically leads to the bangup ending.  You found it uplifting I love this movie!",
		"Get ready for it This is one of my favourite films of all time.  I am relatively unaware of David Mamets writer and director other works but after having watched this film half a dozen timesit is always a joy to watch, I can say without hesitation that he is a genius.  This film is extremely well written, and quickly draws you in to its milieu of deceit, conartistry and back room hustles.  The feel of the film is very similar to The Sting 1973 and it also pays homage to film noir.It is quite a psychologically complex film and will definitely get you thinking about the various plot twists and motives of the shady characters.  It is it bad I agree, but I think she is nevertheless outstanding in the role.The less you know about the plot of this film, the better, just like Mamets most recent film, The Spanish Prisoner, because the ending will be even more impressive.  Just sit back and be prepared to be taken for a ride by a movie that comes dangerously close to brilliance.",
		"Get ready for it This is one of my favourite films of all time.  I am relatively unaware of David Mamets writer and director other works but after having watched this film half a dozen timesit is always a joy to watch, I can say without hesitation that he is a genius.  This film is extremely well written, and quickly draws you in to its milieu of deceit, conartistry and back room hustles.  The feel of the film is very similar to The Sting 1973 and it also pays homage to film noir.It is quite a psychologically complex film and will definitely get you thinking about the various plot twists and motives of the shady characters.  It is slightly predictable at times but the shocking climax is always exciting to watch.Generally, the acting is superb especially Joe Mantegna but someone who I watched the film with remarked to me that it is not a good idea to have a heroine Lindsay Crouse who is not only a gambler, a smoker and a thief but also sports a bad 80s hairdo.  I think she outstanding Just sit back and be prepared to be taken for a ride by a movie that comes dangerously close to brilliance.",
		"Opening the film with a Bach Toccata is an aural hint of what is to unfold in this intense drama.  All the compositional devices Bach perfected to keep his listener and the performer intrigued and entertained applies to this film.  There is not a mutual tenderness between the two lead characters and the lead female in the final scene I feel is justified in stating she was raped even though her victimizer feels she was forewarned that he was a cad.  Mamet feel he clueless If Mamet ever developed a healthy humorous take on the interaction between the genders I wonder how this work would have ended?  As it exists it is very somber and mean spirited.",
		"I am not great at writing reviews, so I will just spout my opinions...I loved this series at first.  The adventure, the action, the comedy, the drama...  I thought it was all brilliant.  Anderson, Tapping, Shanks, Judge, Davis...  I loved them all.  Davis, it seemed, was the fifthmost important person in the cast.  Not a big deal.  But when his character General Hammond left at the end of the seventh season, and Andersons character Colonel ONeill moved from the field to the office, the quality of the series suddenly fell off a cliff.  I do not know whether it is because Hammond was more important that I realized or what, but for some reason, after the seventh season, the series turned to .The first seven seasons, though, were awesome.  The movie Stargate seemed mediocre the first time I saw it, but it turned out to be, even if this was not the original intention, a brilliant setup to the series.  I does they good It just means they are a letdown if you have gotten spoiled by the first seven seasons.After you have finished this series, be sure to watch the spin off series, Stargate Atlantis.  It is a worthy successor to this brilliant series.EDIT on 71808 I just found out that Don S.  Davis died a few weeks ago.  It is a great loss.",
		"I am not great at writing reviews, so I will just spout my opinions...I loved this series at first.  The adventure, the action, the comedy, the drama...  I thought it was all brilliant.  Anderson, Tapping, Shanks, Judge, Davis...  I loved them all.  Davis, it seemed, was the fifthmost important person in the cast.  Not a big deal.  But when his character General Hammond left at the end of the seventh season, and Andersons character Colonel ONeill moved from the field to the office, the quality of the series suddenly fell off a cliff.  I do not know whether it is because Hammond was more important that I realized or what, but for some reason, after the seventh season, the series turned to .The first seven seasons, though, were awesome.  The movie Stargate seemed mediocre the first time I saw it, but it turned out to be, even if this was not the original intention, a brilliant setup to the series.  I recommend that you watch the movie first, then watch the first season of the TV series, then watch the movie again you will have a whole new appreciation of it the second time around, believe me, and then watch the rest of the TV series.The last three seasons of the series are not nearly as good as the first seven, but that does not mean they are not good.  It means they sure It is a worthy successor to this brilliant series.EDIT on 71808 I just found out that Don S.  Davis died a few weeks ago.  It is a great loss.",
		"The United States of Kiss My AssHouse of Games is the directional debut from playwright David Mamet and it is an effective and at times surprising psychological thriller.  It stars Lindsay Crouse as bestselling psychiatrist, Margaret Ford, who decides to confront the gambler who has driven one of her patients to contemplate suicide.  In doing so she leaves the safety and comfort of her somewhat ordinary life behind and travels downtown to visit the lowlife place, House of Games.The gambler Mike played excellently by Joe Mantegna turns out to be somewhat sharp and shifty.  He offers she willing The card game ensues and soon the psychiatrist and the gambler are seen to be in a familiar line of work gaining the trust of others and a fascinating relationship begins.  What makes House of Games interesting and an essential view for any film fan is the constant guessing of who is in control, is it the psychiatrist or the conman or is it the wellknown man of great bluffs David Mamet.In House of Games the direction is dull and most of the times flat and uninspiring, however in every David Mamet film it is the story which is central to the whole proceedings, not the direction.  In House of Games this shines through in part thanks to the superb performances from the two leads showy and distracting but mainly as is the case with much of Mamets work, it is the dialogue, which grips you and slowly draws you into the film.  No one in the House of Games says what they mean and conversations become battlegrounds and war of words.  Everyone bluffs and double bluffs, which is reminiscent of a poker games natural order.  This is a running theme throughout the film and is used to great effect at the right moments to create vast amounts of tension.  House of Games can also be viewed as a classwar division movie.  With Lindsay Crouse we have the middleclass, welltodo educated psychiatrist and Joe Mantegna is the complete opposite, the working class of America earning a living by honest crime.The film seduces the viewer much like Crouse is seduced by Mantegna and the end result is ultimately a very satisfying piece of American cinema.  And the final of the film is definitely something for all to see and watch out for, it is stunning.An extremely enjoyable film experience that is worth repeated viewings. 910",
		"David Mamet wrote the screenplay and made his directorial debut with House of Games, a character study fraught with psychological overtones, in which a psychiatrist is lured into the dark world of the confidence game.  Margaret Ford Lindsay Crouse has a successful practice and has written a bestselling novel, Driven.  Still, she is somewhat discontented with her own personal life; there is an emptiness she can neither define nor resolve, and it primes her vulnerability.  When a patient, Billy Hahn Steven Goldstein, confides to her during a session that he owes big money to some gamblers, and that they are going to kill him if he does not pay, she decides to intervene on his behalf.  This takes her to the House of Games, a seedy little dive where she meets Mike Joe Mantegna, a charismatic conman who wastes no time before enticing her into his world.  Instead of the twentyfive large that Billy claimed he owed, Mike shows her his book, and it turns out to be eight hundred dollars.  And Mike agrees to wipe the slate clean, if she will agree to do him one simple favor, which involves a card game he has going on in the back room.  In the middle of a big hand, Mike is going to leave the room for a few minutes; while he is gone, her job is to watch for the tell of one of the other players.  By this time, not only Margaret, but the audience, as well, is hooked.  The dialogue, and Mamets unique style and the precise cadence with which his actors deliver their lines, is mesmerizing.  As Mike leads Margaret through his compelling, surreal realm of existence, and introduces her to the intricacies of the con game, we are swept right along with her.  From that first memorable encounter, when he demonstrates what a tell is and how it works, to the lessons of the short con, to the stunning climax of this film, Mamet keeps the con going with an urgency that is relentless.  And nothing is what it seems.  In the end, Margaret learns some hard lessons about life and human nature, and about herself.  She changes; and whether or not it is for the better is open to speculation.  Mantegna is absolutely riveting in this film; he lends every nuance possible to a complex character who must be able to lead you willingly into the shadows, and does.  Crouse also turns in an outstanding performance here; you feel the rigid, uptight turmoil roiling beneath that calm, selfassured exterior, and when her experiences with Mike induce the change in her, she makes you feel how deeply it has penetrated.  She makes you capable The dynamic supporting cast includes Mike Nussbaum Joey, Lilia Skala Dr.  Littauer, J.T.  Walsh The Businessman, Ricky Jay George and William H.  Macy Sergeant Moran.  House of Games is the quintessential Mamet; he is written and directed a number of highcaliber plays and films since, and will no doubt grace us with more in the future.  But this film will be the one that defines him; and you can go to the dictionary and look it up.  You will find it under Perfection.  This is one great movie you do not want to miss.  I rate this one 1010.",
		"I have u amazing I have to admit that I would never have gone into Sci fi if it was not for stargate, and my dad, who actually got me into sci fi when i was like 6, and i am glad he did, other wise i would not have seen the brilliant shows like SG1, which now in my opinion sets the benchmark for nearly all sci fi series and movies, basically if a new sci fi series is not better or as good as SG1, its not worth watching. basically this is the best sci fi show to date, and if you do not watch this, then you have no idea what you are missing!",
		"I have to say, from the beginning, when i watched the Stargate movie movie i was not blown away or anything it was like an average sci fi movie, with a lot of POTENTIAL, though the movie was not as, erm, amazing as other sci fi movies such as Star wars or aliens, which if u are a sci fi fanatic u will admit one of those two titles are amazing, even though i am not as hardcore sci fi fan as some people, i do not remember one line from either of those movies, i am not a big fan of wearing star wars T shirts, in fact if you saw me i would look like an average person to you, ah getting slightly off the point here, well my point is that the that you do not have to be a hard core sci fi fan to like this great series, which unfortunately ended after 10 amazing seasons with no drop in its quality as it got nearer to its end, in 2006.though i did not like the movie much i was quite looking forward to the first season in 1997, and let me tell you, the special effects were only one of the brilliant things about the series, the chemistry between the characters just blew me away the special affects, were as good if not better than most sci fi shows running today.  I am he wise",
		"Bruce Almighty is the best Jim Carrey work since The Truman Show, and was a pleasant surprise after some of his recent Hey Hollywood  look how good I can act!  box office disappointments.  It is great to see Jim recognizing and embracing his strengths.  He will not get an Academy Award but the film itself will last longer than many of the awarded films of the Academy.  He is it funny A real surprise was Steven Carrell as Carreys nemesis Carrell of The Daily Show fame, who walked away with some the best and funniest scenes of the film.  I laughed harder at Carell than anyone else in the past three years.I can foresee the religious nuts in the US will be upinarms over the treatment of God, but the bottom line of the film is true to all major theological beliefs  we are masses of protoplasms trying to get through our short lives by exercising our free will.  Without Married With Children t o complain about, this will likely become a target of people with misplaced priorities who know the types  men adorned in gold watches on Sunday morning and late nigh television, selling prayers to God.  And, again, about 0.5 of the country will care and 80 of the media will report it.The bottom line this a purely entertaining film, each audience member laughingly wondering what they would do, and a feelgood feeling at the movie conclusion.  A walk down any major street in America has to confirm that God has a tremendous sense of humor.  What better comic genius to remind us of that than Jim Carry.Thanks again, Jim  it is GREAT to have you back!!",
		"Ok, so it is not a masterpiece like the Godfather, but it does not have to be.  The only purpose this movie has is to make the viewer laugh several times.  If it can make the viewer laugh a bunch of times, it has accomplished its purpose.  I laughed out loud and left with a smile.  I feel I worth",
		"This film is the best film Jim Carrey has ever made.  Carrey did not have his usual face making stuff in this film.  He was both funny and sad.  Carrey played a reporter named Bruce Nolan.  Nolan blames GodMorgan Freeman for everything that goes wrong in his life.  Then, God comes down from heaven and gives Bruce his powers.  As I said before, Carrey did an excellent job.  I thought Morgan great The plot was good because it had many subpoints in the main point.  This movie can be funnyBruces dog as well as sadthe breakup.  The script worked well, too.  I am glad they made a sequel to this film.  I rate this film a 910.",
		"As someone who lives near Buffalo, New York, this movie scored points with me before I even saw it, since the story is based here.  There are even some bit parts with reallife newsTV anchor people from Buffalo..and, for once, it does not knock the area.  Hallelujah! Theologywise, puhleeze!!!  God is still made to look and think like humans...and, of course, be a bit on the liberal side.  Being the lightweight comedy it is, it is nothing that should win any awards but it still is entertaining and is a pleasant way to kill 102 minutes.  There are some laughoutloud slapstick comedy scenes and, hopefully, audiences  from Christians to atheists. got something out of this besides a few laughs, such as what prayer should really be all about.  Kudos getting theology correct",
		"I really do not know what people have against this film, but it is definitely one of my favourites.  It is it moral It is just God.  Any possible God, no matter the religion.  And it is really funny.Jim Carry plays Bruce Nolan, a TV reporter usually stuck on the lighter side of the news, desperate to prove himself more or less TO himself that he can be taken seriously and do a good job in an anchor job.  This drive is what is slowly driving his beautiful girlfriend Grace Jennifer Aniston away.  When the final straws are executed, he is quick to not laugh, but yell in the face of God, who in turn gives Bruce his powers.  Bruce then makes his life better for himself, until he is guilted into helping others, where he then continues to miss the point of his powers.  Meanwhile, his constant excitement about his own life makes him more selfish, leaving his relationship on dangerous ground.OK, that was kinda long.  But as a plot, it works well.  The stepbystep fashion in which we meet the challenges of being God is much better than clustering his problems together, and is able to hide itself fairly well.As you probably know from hearing about this movie in the first place, Carreys pitchperfect acting stays in character which, luckily enough, is him, and controls and gives atmosphere to the movie scene by scene.  Whether they would admit it or not, the role was written or rewritten exclusively for Carrey.  Without him, the humour would turn flat, as humour is half execution.  And the humour is very good in the first place.  But without Carrey, it would kinda feel like a It is a Wonderful Life wannabe.Jennifer Aniston is great and, no matter what some may say, does not act like the only excuse for the third act.  At least, you do not think that when you see her.  She gives a heartfelt performance and makes you forget you are watching a movie, she and Carrey feel very much like a real couple.The movie feels ggooooodd see the movie to understand, has a very nice feeling, tackles the idea appropriately and better than expected and overall should never have been called slapped together just to save Carreys career which was not goin anywhere..",
		"Well, was Morgan Freeman any more unusual as God than George Burns?  This film sure was better than that bore, Oh, God.  I was totally engrossed and LMAO all the way through.  Carrey was perfect as the out of sorts anchorman wannabe, and Aniston carried off her part as the frustrated girlfriend in her usual well played performance.  I do her ugly I think my favorite scene was when Carrey opened up the file cabinet thinking it could never hold his life history.  See if you can spot the file in the cabinet that holds the events of his bathroom humor I was rolling over this one.  Well written and even better played out, this comedy will go down as one of this funnymans best.",
		"Now either you like Mr Carreys humour or you do not.  Me, Myself and Irene had audiences both walking out in droves and, on the other hand, cheering and collapsing in puddles of mirth.  Bruce Almighty is a bit more mainstream, but you have been warned.If you are not sure, watch the trailer.  I saw the trailer three times and still laughed at the same gags when I saw the film.  If you do not find the sight of a dog putting the seat down after using the loo funny, do not bother with the movie.Carrey, a reporter stuck in a rut covering lighter news berates God when the whole of his life seems to be going to pot.  God takes up the challenge and asks Carrey if he can do better.  Carrey is it likely His most accomplished straight role, the Man on the Moon, is less well known that his comedy romps  or The Truman Show on which the Academy heaped three nominations whilst bypassing Carrey.",
		"Jim Carrey is back to much the same role that he played in The Mask, a timid guy who is trying to get ahead in the world but who seems to be plagued with bad luck.  Even when he tries to help a homeless guy from being harassed by a bunch of hoodlums and of course they have to be Mexican, obviously, his good will towards his fellow man backfires.  In that case, it was not too hard to predict that he was about to have a handful of angry hoodlums, but I like that the movie suggests that things like that should not be ignored.  I am they sure The results were not very promising, so it is nice to see someone in the movies setting a good example.Jim Carrey plays the part of Bruce Nolan, the nice guy mentioned above whose entire life seems to be falling apart.  Or even better, it seems to be breaking up by the blows of bad luck like an asteroid entering the atmosphere a little metaphor that comes up when Bruce miraculously finds himself a gigantic news story later in the film.  Bruce is nearly 40 years old and all he has to show for it is a position as a news reporter of the sort that reports on such exciting news as the local bakery that is seeking to bake the worlds biggest cookie.  He is desperate to obtain the job of head anchor at the TV station, but he loses his cool on live TV when he hears that the job went to his rival colleague.  You have to love how they time the revelation of this news to him seconds before his first live report.  Needless to say, he loses his temper on live TV in one of the funniest scenes of the entire film.Morgan Freeman delivers a fantastic performance as the Man himself, displaying a God whose infinite wisdom is somewhat reflected through Freemans massive talent as an actor.  He is the kind of God who takes his job very seriously, but in such a way as to advise his followers as well as the viewers of this movie that there are times when you need to slow down and do some manual labor in life.  I love his line that some of the happiest people in the world come home smelling to high heaven at the end of the day.  There are a lot of people in the world maybe more than our share in America who are so absorbed by their money and their possessions and their jobs and everything that they completely lost touch with the natural side of themselves as humans.One of the biggest strengths is that the movie is able to provide great advice to people in general about improving their lives, and this message is clear and acceptable regardless of the viewers religion.  I, for example, tend to reject organized religion in all forms and I see God and Satan to be metaphors for different aspects of nature and human psychology rather than actual figures who ever lived or continue to live.  But despite the fact that I do not believe that God exists as an entity overseeing the universe or as a janitor dressed all in white who mops the floors of his downtown office in his spare time, I was able to appreciate the messages that were delivered in this movie.Jim Carreys movies display this fantastic evolution that ties them all together and makes the newer ones look even better just because you can see how far he is come.  If you compare Bruce Almighty with movies like Ace Ventura both of which I loved, by the way or a lot of what he did before he got into film, it is amazing how far he is come.  He has moved from cheesy TV comedy to cheesy comedic films to comedies that are truly intelligent and meaningful like this film as well as others like The Truman Show, Man on the Moon, and The Majestic easily one of his greatest films ever.  Jim Carrey has unmistakably moved from the cheesy comedy of his past to become one of the most important comic actors working today.Jennifer Aniston also once again provides an excellent addition to the movie as she did in the sidesplitting Office Space as Bruces girlfriend, who becomes increasingly exasperated by Bruces growing stress about his life as well as his negligence to ask her to marry him.  There is definitely some lowbrow comedy in the film that does not really fit with the importance of the films meaning or the quality of the delivery, such as the dog reading the newspaper on the toilet and the whole monkey scene, but it was definitely pretty nice to see Ace Venturas friend Spike make a cameo appearance.  As Stephen King very well knows, it is always nice to see familiar characters.  It is almost like seeing family again.Bruce is endowed with the powers of God for a given period of time so that he can understand life a bit better, and he says a lot about himself when he uses the powers only for his own purposes rather than to help all of the people who pray to him.  The thing I love about this is that, like I said before, religion is absent from my life, but I was able to watch this and learn a lot about myself as well by thinking about what kinds of things I would have done had I been endowed with such powers.  The movie allows us to learn vicariously this way, which empowers the message even more.The scenes that involve the news station are easily the funniest in the entire film, such as the scene when Bruce loses his temper about the anchor position, the Jimmy Hoffa scene who was conveniently buried with an original birth certificate and a complete set of dental records, the scene where Bruces rival colleague is made to go nuts on camera, and my favorites, the ones at the beginning and the end involving the local bakerys cooking.  The movie has plenty of time for Carrey to deliver some excellent jokes, such as when he says to God who reveals that he is the janitor, the proprietor, the electrician, etc that his Christmas parties must be real bashes, and to be careful about drinking, because on of him might need a ride home!  I also loved the end when he says that behind every great man is a woman rolling her eyes.  A little too true, and as Gallagher would add, behind every great man is also an amazed motherinlaw.Bruce Almighty is one of the more memorable comedies to have come out for quite a while, and is probably the only directly religious that I can remember seeing that I am anxious to buy on DVD to add to my personal collection.  It is a comedy written and performed in good taste, but with enough relatively lowbrow humor to keep the kids entertained.  This is a meaningful comedy for the whole family, which is becoming rarer and rarer these days.  In a world that is about to be flogged with yet another American Pie film AND another Scary Movie which are only scary because of their sheer barbarous idiocy, it is nice to see that there are still people making comedies worth watching.  Do not miss this one.",
		"Jim Carrey is back to much the same role that he played in The Mask, a timid guy who is trying to get ahead in the world but who seems to be plagued with bad luck.  Even when he tries to help a homeless guy from being harassed by a bunch of hoodlums and of course they have to be Mexican, obviously, his good will towards his fellow man backfires.  In that case, it was not too hard to predict that he was about to have a handful of angry hoodlums, but I like that the movie suggests that things like that should not be ignored.  I am reminded of the episode of Michael Moores brilliant The Awful Truth, when they had a man lay down on the sidewalk and pretend to be dead and see who would actually stop and make sure he was okay.  The results were not very promising, so it is nice to see someone in the movies setting a good example.Jim Carrey plays the part of Bruce Nolan, the nice guy mentioned above whose entire life seems to be falling apart.  Or even better, it seems to be breaking up by the blows of bad luck like an asteroid entering the atmosphere a little metaphor that comes up when Bruce miraculously finds himself a gigantic news story later in the film.  Bruce is nearly 40 years old and all he has to show for it is a position as a news reporter of the sort that reports on such exciting news as the local bakery that is seeking to bake the worlds biggest cookie.  He is desperate to obtain the job of head anchor at the TV station, but he loses his cool on live TV when he hears that the job went to his rival colleague.  You have to love how they time the revelation of this news to him seconds before his first live report.  Needless to say, he loses his temper on live TV in one of the funniest scenes of the entire film.Morgan Freeman delivers a fantastic performance as the Man himself, displaying a God whose infinite wisdom is somewhat reflected through Freemans massive talent as an actor.  He is the kind of God who takes his job very seriously, but in such a way as to advise his followers as well as the viewers of this movie that there are times when you need to slow down and do some manual labor in life.  I love his line that some of the happiest people in the world come home smelling to high heaven at the end of the day.  There are a lot of people in the world maybe more than our share in America who are so absorbed by their money and their possessions and their jobs and everything that they completely lost touch with the natural side of themselves as humans.One of the biggest strengths is that the movie is able to provide great advice to people in general about improving their lives, and this message is clear and acceptable regardless of the viewers religion.  I, for example, tend to reject organized religion in all forms and I see God and Satan to be metaphors for different aspects of nature and human psychology rather than actual figures who ever lived or continue to live.  But despite the fact that I do not believe that God exists as an entity overseeing the universe or as a janitor dressed all in white who mops the floors of his downtown office in his spare time, I was able to appreciate the messages that were delivered in this movie.Jim Carreys movies display this fantastic evolution that ties them all together and makes the newer ones look even better just because you can see how far he is come.  If you compare Bruce Almighty with movies like Ace Ventura both of which I loved, by the way or a lot of what he did before he got into film, it is amazing how far he is come.  He has moved from cheesy TV comedy to cheesy comedic films to comedies that are truly intelligent and meaningful like this film as well as others like The Truman Show, Man on the Moon, and The Majestic easily one of his greatest films ever.  Jim Carrey has unmistakably moved from the cheesy comedy of his past to become one of the most important comic actors working today.Jennifer Aniston also once again provides an excellent addition to the movie as she did in the sidesplitting Office Space as Bruces girlfriend, who becomes increasingly exasperated by Bruces growing stress about his life as well as his negligence to ask her to marry him.  There is definitely some lowbrow comedy in the film that does not really fit with the importance of the films meaning or the quality of the delivery, such as the dog reading the newspaper on the toilet and the whole monkey scene, but it was definitely pretty nice to see Ace Venturas friend Spike make a cameo appearance.  As Stephen King very well knows, it is always nice to see familiar characters.  It is family endowed The thing I love about this is that, like I said before, religion is absent from my life, but I was able to watch this and learn a lot about myself as well by thinking about what kinds of things I would have done had I been endowed with such powers.  The movie allows us to learn vicariously this way, which empowers the message even more.The scenes that involve the news station are easily the funniest in the entire film, such as the scene when Bruce loses his temper about the anchor position, the Jimmy Hoffa scene who was conveniently buried with an original birth certificate and a complete set of dental records, the scene where Bruces rival colleague is made to go nuts on camera, and my favorites, the ones at the beginning and the end involving the local bakerys cooking.  The movie has plenty of time for Carrey to deliver some excellent jokes, such as when he says to God who reveals that he is the janitor, the proprietor, the electrician, etc that his Christmas parties must be real bashes, and to be careful about drinking, because on of him might need a ride home!  I also loved the end when he says that behind every great man is a woman rolling her eyes.  A little too true, and as Gallagher would add, behind every great man is also an amazed motherinlaw.Bruce Almighty is one of the more memorable comedies to have come out for quite a while, and is probably the only directly religious that I can remember seeing that I am anxious to buy on DVD to add to my personal collection.  It is a comedy written and performed in good taste, but with enough relatively lowbrow humor to keep the kids entertained.  This is a meaningful comedy for the whole family, which is becoming rarer and rarer these days.  In a world that is about to be flogged with yet another American Pie film AND another Scary Movie which are only scary because of their sheer barbarous idiocy, it is nice to see that there are still people making comedies worth watching.  Do not miss this one.",
		"This a good episode of The New Twilight Zone that actually includes interesting ideas and clever stories I note both of them are based on short stories.  Examination Day is set in the future, year unknown but at a point where they have cake candles that light themselves, huge TVlooking phones that double as numerous other entertaining machines and distributed only to those of a certain age...and the Examination Day, a point where 12yearolds must undergo a governmentrequired IQ test.  The kid is this story, Dickie Jordan David Mendenhall is just celebrating his own 12th birthday and is a smart kid, so is calm, even eager to take the test that he has seen friends pass easily and knows he will excel at based on his school grades.  His parents Christopher Allport and Elizabeth Norment, on the other hand, say he should not have used his birthday wish on getting a good score, and while their reason includes that they believe he is capable and he should have no need to worry, it is pretty obvious they are worried.  I will not give anything away in the ending, but I will say this  there is a point where we get a glimpse of what is to come as far ass why the test is such a heavy subject that evening or another?  his parents ask Dickie whether he would prefer to watch TV all night.  By todays standards, we would be pleased he would say he would rather read and not just because there is nothing worth watching...but why would his family ask this?  The flavor of what is encouraged and discouraged in the future reminded me a bit of the atmosphere from Harrison Bergenon which I hear has not received a great adaptation to the screen.  I wish they powerful I found it to be better than the short story it was based on.  I have not read the one that A Message from Charity was based on, but would like to since it was interesting  a 16yearld boy, Peter Robert Duncan McNeill is suffering a fever from unclean water, that has always been common in his Massachusetts hometown...but he is able to see through the eyes of a young Puritan woman suffering the same type of fever, Charity Payne, Kerry Noonann who also finds herself able to experience what goes on around him.  They both recover, especially since it is common for that to happen in 1985, but the connection does not go away.  Charity is curious about the sights and sounds she records of 1985 and they each enjoy each others company, especially Peter, who has promoted grades in school enough to always have felt isolated from other students, even at the college he is been staying in one place at.  Things take an unexpected turn, though, when Charity reveals some of these experiences to a friend who take her claims that the 13 colonies will breach from England as a sign of bewitchment, added to the fact that she was spared death from the fever not so common in 1700.  The two try to learn a way to save her.  The ending is sad but has an interesting final moment that makes it touching.  Both segments of this episode include a lot of pain but both times, through a lessonwarning that sounds like something Rod Sterling would have cooked up and entertainment, make cheerful watching as reminders that friendship, love, and wisdom do a great deal.  Probably 34 of this has no theme, but somehow I think it all would have been approved by Sterlings crew.",
		"This a good episode of The New Twilight Zone that actually includes interesting ideas and clever stories I note both of them are based on short stories.  Examination Day is set in the future, year unknown but at a point where they have cake candles that light themselves, huge TVlooking phones that double as numerous other entertaining machines and distributed only to those of a certain age...and the Examination Day, a point where 12yearolds must undergo a governmentrequired IQ test.  The kid is this story, Dickie Jordan David Mendenhall is just celebrating his own 12th birthday and is a smart kid, so is calm, even eager to take the test that he has seen friends pass easily and knows he will excel at based on his school grades.  His parents Christopher Allport and Elizabeth Norment, on the other hand, say he should not have used his birthday wish on getting a good score, and while their reason includes that they believe he is capable and he should have no need to worry, it is pretty obvious they are worried.  I will not give anything away in the ending, but I will say this  there is a point where we get a glimpse of what is to come as far ass why the test is such a heavy subject that evening or another?  his parents ask Dickie whether he would prefer to watch TV all night.  By todays standards, we would be pleased he would say he would rather read and not just because there is nothing worth watching...but why would his family ask this?  The flavor of what is encouraged and discouraged in the future reminded me a bit of the atmosphere from Harrison Bergenon which I hear has not received a great adaptation to the screen.  I only wish they could have provided an opening and closing narration to make this theme as powerful as The Obsolete Man was.  I found it to be better than the short story it was based on.  I have it interesting They both recover, especially since it is common for that to happen in 1985, but the connection does not go away.  Charity is curious about the sights and sounds she records of 1985 and they each enjoy each others company, especially Peter, who has promoted grades in school enough to always have felt isolated from other students, even at the college he is been staying in one place at.  Things take an unexpected turn, though, when Charity reveals some of these experiences to a friend who take her claims that the 13 colonies will breach from England as a sign of bewitchment, added to the fact that she was spared death from the fever not so common in 1700.  The two try to learn a way to save her.  The ending is sad but has an interesting final moment that makes it touching.  Both segments of this episode include a lot of pain but both times, through a lessonwarning that sounds like something Rod Sterling would have cooked up and entertainment, make cheerful watching as reminders that friendship, love, and wisdom do a great deal.  Probably 34 of this has no theme, but somehow I think it all would have been approved by Sterlings crew.",
		"This a good episode of The New Twilight Zone that actually includes interesting ideas and clever stories I note both of them are based on short stories.  Examination Day is set in the future, year unknown but at a point where they have cake candles that light themselves, huge TVlooking phones that double as numerous other entertaining machines and distributed only to those of a certain age...and the Examination Day, a point where 12yearolds must undergo a governmentrequired IQ test.  The kid is this story, Dickie Jordan David Mendenhall is just celebrating his own 12th birthday and is a smart kid, so is calm, even eager to take the test that he has seen friends pass easily and knows he will excel at based on his school grades.  His parents Christopher Allport and Elizabeth Norment, on the other hand, say he should not have used his birthday wish on getting a good score, and while their reason includes that they believe he is capable and he should have no need to worry, it is pretty obvious they are worried.  I will not give anything away in the ending, but I will say this  there is a point where we get a glimpse of what is to come as far ass why the test is such a heavy subject that evening or another?  his parents ask Dickie whether he would prefer to watch TV all night.  By todays standards, we would be pleased he would say he would rather read and not just because there is nothing worth watching...but why would his family ask this?  The flavor of what is encouraged and discouraged in the future reminded me a bit of the atmosphere from Harrison Bergenon which I hear has not received a great adaptation to the screen.  I only wish they could have provided an opening and closing narration to make this theme as powerful as The Obsolete Man was.  I found it to be better than the short story it was based on.  I have not read the one that A Message from Charity was based on, but would like to since it was interesting  a 16yearld boy, Peter Robert Duncan McNeill is suffering a fever from unclean water, that has always been common in his Massachusetts hometown...but he is able to see through the eyes of a young Puritan woman suffering the same type of fever, Charity Payne, Kerry Noonann who also finds herself able to experience what goes on around him.  They recover it common Charity is curious about the sights and sounds she records of 1985 and they each enjoy each others company, especially Peter, who has promoted grades in school enough to always have felt isolated from other students, even at the college he is been staying in one place at.  Things take an unexpected turn, though, when Charity reveals some of these experiences to a friend who take her claims that the 13 colonies will breach from England as a sign of bewitchment, added to the fact that she was spared death from the fever not so common in 1700.  The two try to learn a way to save her.  The ending is sad but has an interesting final moment that makes it touching.  Both segments of this episode include a lot of pain but both times, through a lessonwarning that sounds like something Rod Sterling would have cooked up and entertainment, make cheerful watching as reminders that friendship, love, and wisdom do a great deal.  Probably 34 of this has no theme, but somehow I think it all would have been approved by Sterlings crew.",
		"It has said that The Movies and Baseball both thrived during The Great Depression.  It appears that the grim realities of a Nation caught up in the aftermath of this Economic Disaster created a need for occasional relief for the populace.  A temporary escape could be found in the on going soap opera that is Baseball.Likewise, an occasional excursion of 2 or 3 hours into the darkened auditoriums of the Cinema.  The presence of a Radio in just about everyones house hold kept Depression Era America at once attuned to Worlds Events and provided many a Drama and especially Comedy Shows for a pleasant interlude from harsh reality.The literature of the time also flourished at all levels.  The juvenile reading habits helped to create the Comic Book as we know it, what with all the fantastic characters and super exciting adventures.  But the Comic Book just did not magically appear, all fully developed with all the colorful 4 color pages, all by itself.  There were mediums that were ancestral to them.  Obviously,the Newspaper Comic Strip was one parent, providing the visualnarrative method of story telling.The other direct ancestor was the Pulp Magazine.  The inexpensive, prose story publications that carried a great deal of stories of the same adventure characters in on going, though not necessarily serialized, tales.  The pulp medium had been around for some decades and introduced us to Edgar Rice Borroughs TARZAN and Johnston McCulleys ZORRO.  The 1930s brought forth a bumper crop as feature characters like THE SHADOW, THE AVENGER, G8s BATTLE ACES and THE SPIDER,MASTER of MEN all found their way to the news stands, among many others.One other was DOC SAVAGE, a fullblooded super hero of the written story; the covers of the pulps had perhaps, the only picture of the hero.  Possessing extraordinary strength, super keen senses and a protean genius class intellect, Doc was the prototype Super Hero.He also assembled 5 of his former Army Buddies into a small, free lancing team of adventurers.  Each of them was an expert in a given field.  So we had a top rated Chemist, Lawyer, Construction Engineer, Electrical Engineer, GeologistArchaeologistPaleontologist, etc.The Doc Savage stories were very popular in the 1930s and 40s, and were published into the middle 50s.  Then they went into a hiatus for a good 1215 years.  Then the brainstorm came about to repackage the old novels in new container, the paperback book.  A fresh look to the cover art was introduced, featuring a highly stylized series of paintings of a very muscular Doc, with a perpetually ripped shirt.The reintroduction proved to be highly successful, with the publication of a title a month and for a while more.  Soon, there was a rumor of a Doc Savage movie!  But when, by what Producer?  Well, the venerable Man of Bronze was back on the news stands for over 10 years before any real project got put together.  It was veteran Stopaction Animator and Producer of top Special Effects films, Geoprge Pal, who did the film along with Warner Brothers.When DOC SAVAGE, MAN OF BRONZE arrived in the Movie Houses, it boasted of a well casted team of actors, albeit a largely No Name as far familiarity with the viewers.  With former Tarzan of TV,Ron Elys nearly perfect casting in the lead, up and coming Beauty of a Starlette, Pamela Hensley in the female lead and veteran character Paul Wexler as the villainous, Captain Seas; no other name would have been recognized.  And, just maybe that was a plus in this case.The story does a fine job of both getting most of the audience acquainted with the incredible group and at the same time get a plot going.  Use of narration, by Paul Frees, and short film clips are the method pursued to move the introduction along to the main body of the story.From the very start, there are hints that this story will go with the same sort of manufactured Camp humor as the Batman TV series.  Some really great looking early scenes involving Doc and the whole crew doing their individual specialties are thrown toward humor by the Paul Frees narration and the unexpected, unlikely outcomes.  For Example, an experiment of Docs with a miniature rocketmissile turns out to be part of a method of catching fish, a small one at that.  The whole story unfolds like that, hitting the viewer with a little Camp every so often, as to keep reminding us not to take it too seriously.  We are also puzzled about Mr.  George Pals being the Producerhis last.  He who had been so well known for Special Effects, surely a factor that could be put to good use in a scifi action setting of the Pulp Characters world.I can remember seeing it quite vividly.  Mrs.  Ryan Deanna was in the Hospital, just having given birth to our 2nd child, Michelle081475.  Our older girl, Jennifer, was visiting her Grandmother, so after visiting hours were over in the Maternity Ward, it was straight over to the old Marquette Theatre, 63rd  Kedzie, here in Chicago.Having seen it and being a guy with a good familiarity with Doc, I was sort of let down by the final product.  I have Mr.Pal neat Ely and the others, made the whole film likable, if not lovable.  The sets and locations were, as far as we can see, very much like those of a 30s serial or adventure flick which would be enjoyable to about anyone.And maybe that is just what they were trying for with this DOC SAVAGE, MAN of BRONZE.",
		"Possible spoilersI recently watched this movie with my 11 year old son and was pleased to see that he laughed in the right places and was thrilled by the action sequences.  Ron Ely is just right as Doc.  Cool, calm, almost always in controland with an occasional twinkle in his eye.  What more can one ask for?  I do it faithful Many people have compared this movie to Raiders of the Lost Ark, which I do not think is fair.  The difference in budget is astoundingRaiders must have at least 10 times the budget.  Doc Savage does not have the extensive location work that Raiders has.  Special effects are also at a minimum but come on people, the story is a lot of fun and the humor is just right.  The Sousa music is catchylove that theme song Every time I watch the film, I end up humming the theme for days.The best way to approach this film is to just RELAX and enjoy.  Highlights include the exciting opening sequence where the fabulous five and Doc chase the Indian sniper throughout the rooftops of New York and the VERY funny fight sequence between Doc and Captain Seas.  Not as good is the villain who sleeps in a giant crib really!.  Overall a great movie to watch on a rainy day.  I give it 7 out of 10.Doc Savage, Doc Savage...thank the lord he is here!",
		"I was colleagues odd I do not know what it is about the Doc, but he always gets the girls has to be the ultimate line when you look at his sad band of men.  This film is a classic spoof on all the super hero genre,and was way before it is time,it is not to be taken seriously, move over Austin Powers.  Ron Ely is a God.It is unfortunate that this film has not been released on DVD in the UK.  I do not think it should be remade and bastardised, like I said it is a classic,it cannot be done without Ron.like the Italian job without Minis and Michael Caine.  I give it 1010.",
		"This movie was extremely funny, I would like to own this for my vintage collection of 1970s movie must see again list, I know this cast of characters ,they are people that I have met over the years and that prompt me to search out this comedy, unfortunately this was never put to DVD or VHS.  Redd Foxx always a clown of comedy, Pearl Baily a great match as his wife witty and sassy, Norman a son with a secret not sure if he will have a future if it is out,Dennis Dugan crazy funny man .  Miss Dobson hooker with a heart and little conscience.  Love earmarks me impossible This movie was a wild ride advise of a cabbie, remind me of episode Kramer takes advice of his caddie over his lawyer.   episode from Seinfeld  The parents have there jaw dropping moment, fun over fun It is screaming bring me back .",
		"I saw a trailer for this on Afro Promo, the collection of movie trailers for movies featuring AfricanAmericans.  It looked his gay It would seem that Redd Foxxs RF wife has left him for his brother, who works with him at the store back in Phoenix.  He has taken the bus to visit his son Norman is Los Angeles.So as RF arrives, Norman, wearing nothing but powderblue bikini shorts, gets out of his waterbed to answer the door.  Trying to buy time by making his elderly father take the stairs to what appears to be the 60th floor, Norman tries to wake his lover, who steadfastly refuses to budge.  It was just to the point where I wrote WHY will not he wake up?  when suddenly he does, and me and my friends jaws dropped for the first of many times as we are presented with our first glimpse of the blueeyed, swirlhairdoed Garson, Normans white livein lover, who just had the most faaaaaabulous dream Garson is a flaming queen of a type that can ONLY be imagined as emerging from 1976 L.A.  He has dresses and a purse and big clunky jewelry, and seems to have modeled both his look and persona on Carol Brady from The Brady Bunch.Norman orders his lover to find somewhere else to stay during his fathers visit.  Garson goes to stay with Waylon Flowers, and Madam answers the phone when Norman calls.  So RF attempts to reach his wife in Mexico.  While he is on the phone, Garson comes in to pack his dress and RF confronts him.  With a burst of 70s soul music meant to evoke his dawning revelation but sounding more like we are about to hear a very special track by The Emotions, he realizes that his son is gay.His first impulse is I will kill him.  I will kill him.  Then RF goes on a long walk, wherein he cycles through all of the thoughts a confused parent might have, such as maybe we toilet trained him too soon.  His thoughts are all triggered by something he sees on his walk, for instance a burly truck driver appearing just as he is contemplating what makes a real man.  Surprisingly, he goes to a bookstore and buys about eight books on homosexuality.  This, it must be said, is about eight more books on homosexuality than MY parents bought.  He then goes straight to a park bench and reads them all!  RF then hires Audrey, a sixfoot Amazon prostitute in this amazing fur thing played by Tamara Dobson of Cleopatra Jones.  He hired her for Norman to try out heterosexuality, but this pisses Norman and he storms out to go stay with his friend Melody.Then Garson comes over and offers to take RF out for the night.  He commiserates over the loss of RFs wife, and tells the tale of his own mother, who harbors an irrational prejudice against Pilippinos because she was molested at a luau.  They attend a long featured performance of Wayon and Madam, which culminates in Madam violently bashing her head against the piano until her hair comes loose.  Once more, mouths were agape.So it seems that, would not ya just know it, RF and Garson have a wonderful evening together!  You see, staid, traditional older black men just have to see the crappy, highlyeffeminate entertainment of megaqueens in order to come around to ALL the gay world has to offer!  It is really JUST that simple!  This still does not prevent RF from yelling Rape!  when Garson wakes him from a bad dream.  It ends less predictably than you would think.There was so much that was just off.  WHAT is the basis of Norman and Garson s relationship?  They do not seem to have ANY rapport, and Norman has no qualms whatsoever about kicking Garson out, and even when he comes around to stand up for himself, he never defends Garson or talks about their relationship.  There were some kind of sweetly quaint touches like RF going to buy all those books on homosexualityand sitting right down on the park bench to read them!  I like the idea that a parent would actually try to find something out about homosexuality, rather than just run off to get drunk or commiserate with his friends.Other than that, it is kind of just what it seems like a little relic of a bygone era, an era in which some gay people thought that if uptight straight people just sat down and watched a drag marionette performance, we could all learn to love and understand one another!  And because of the whole naivet? of this thing, the extreme stereotypes and messageladen dialogue just come off as charmingly outdated, and provide a great deal of grist for discussion on how things have changed for gays in the past 30 years.  I guess the only thing that seems offensive is the idea that gays female friends are desperately in love with them, and are willing to get them drunk in order to sleep with, and by extension convert, them.  Hey, check out Cinema de Merde, my website on bad and cheesy movies with a few good movies thrown in.  You can find the URL in my email address above.",
		"I saw a trailer for this on Afro Promo, the collection of movie trailers for movies featuring AfricanAmericans.  It looked like what it is; a highly tendentious wacky comedy in which an uptight black man realizes that his son is gay.  It would seem that Redd Foxxs RF wife has left him for his brother, who works with him at the store back in Phoenix.  He has taken the bus to visit his son Norman is Los Angeles.So as RF arrives, Norman, wearing nothing but powderblue bikini shorts, gets out of his waterbed to answer the door.  Trying to buy time by making his elderly father take the stairs to what appears to be the 60th floor, Norman tries to wake his lover, who steadfastly refuses to budge.  It was just to the point where I wrote WHY will not he wake up?  when suddenly he does, and me and my friends jaws dropped for the first of many times as we are presented with our first glimpse of the blueeyed, swirlhairdoed Garson, Normans white livein lover, who just had the most faaaaaabulous dream Garson is a flaming queen of a type that can ONLY be imagined as emerging from 1976 L.A.  He has dresses and a purse and big clunky jewelry, and seems to have modeled both his look and persona on Carol Brady from The Brady Bunch.Norman orders his lover to find somewhere else to stay during his fathers visit.  Garson goes to stay with Waylon Flowers, and Madam answers the phone when Norman calls.  So RF attempts to reach his wife in Mexico.  While he is on the phone, Garson comes in to pack his dress and RF confronts him.  With a burst of 70s soul music meant to evoke his dawning revelation but sounding more like we are about to hear a very special track by The Emotions, he realizes that his son is gay.His first impulse is I will kill him.  I will kill him.  Then RF goes on a long walk, wherein he cycles through all of the thoughts a confused parent might have, such as maybe we toilet trained him too soon.  His thoughts are all triggered by something he sees on his walk, for instance a burly truck driver appearing just as he is contemplating what makes a real man.  Surprisingly, he goes to a bookstore and buys about eight books on homosexuality.  This, it must be said, is about eight more books on homosexuality than MY parents bought.  He then goes straight to a park bench and reads them all!  RF then hires Audrey, a sixfoot Amazon prostitute in this amazing fur thing played by Tamara Dobson of Cleopatra Jones.  He hired her for Norman to try out heterosexuality, but this pisses Norman and he storms out to go stay with his friend Melody.Then Garson comes over and offers to take RF out for the night.  He commiserates over the loss of RFs wife, and tells the tale of his own mother, who harbors an irrational prejudice against Pilippinos because she was molested at a luau.  They attend a long featured performance of Wayon and Madam, which culminates in Madam violently bashing her head against the piano until her hair comes loose.  Once more, mouths were agape.So it seems that, would not ya just know it, RF and Garson have a wonderful evening together!  You see, staid, traditional older black men just have to see the crappy, highlyeffeminate entertainment of megaqueens in order to come around to ALL the gay world has to offer!  It is really JUST that simple!  This still does not prevent RF from yelling Rape!  when Garson wakes him from a bad dream.  It ends less predictably than you would think.There was so much that was just off.  WHAT is the basis of Norman and Garson s relationship?  They do not seem to have ANY rapport, and Norman has no qualms whatsoever about kicking Garson out, and even when he comes around to stand up for himself, he never defends Garson or talks about their relationship.  There were some kind of sweetly quaint touches like RF going to buy all those books on homosexualityand sitting right down on the park bench to read them!  I like the idea that a parent would actually try to find something out about homosexuality, rather than just run off to get drunk or commiserate with his friends.Other than that, it is kind of just what it seems like a little relic of a bygone era, an era in which some gay people thought that if uptight straight people just sat down and watched a drag marionette performance, we could all learn to love and understand one another!  And because of the whole naivet? of this thing, the extreme stereotypes and messageladen dialogue just come off as charmingly outdated, and provide a great deal of grist for discussion on how things have changed for gays in the past 30 years.  I guess offensive willing Hey, check out Cinema de Merde, my website on bad and cheesy movies with a few good movies thrown in.  You can find the URL in my email address above.",
		"Melvyn Douglas and Joan Blondell costar in The Amazing Mr.  Williams, a 1939 mysterycomedy that is quite good, although forgotten, probably due to the number of incredible films that came out in 1939.Douglas plays a talented police detective married to his job, while his girlfriend waits for a wedding that is constantly postponed.  What happens in this film is no exception  he is called to a murder scene just as he is about to walk down the aisle yet again.Both stars were excellent at comedy, worked together well and often, and help make this battle of the sexes fun.  Edward Brophy and Donald McBride are on hand for excellent support.As you can read in other reviews, Melvyn Douglas does not make much of a woman.Entertaining if a little on the long side.One of the comments here trashed Melvyn Douglas, one of our greatest actors.  He literally floated effortlessly through dozens of films as the other man and the best friend before coming into his own in films as an old man.  He was not lazy, but rather, a very hardworking actor who made it look easy who had a Broadway career simultaneously with his film career.  He just was not cast as a leading man in films or given very challenging roles under the studio system.  I call him lazy",
		"The only other review of this movie as of this date really trashes the stars and the movie itself.  I like I much It is unfortunate when there are not many comments for a certain tile, because when there is only one review and it unreasonably trashes the movie and cast, you do not get an idea of what to expect.  I read the review before watching this title and I do not know where all the venom for this movie and the stars came from.  Douglas and Blondell were both very talented and attractive people who usually delivered, even when the material was not the greatest.  I found the movie and the performances fun and enjoyable.  It is not one of the great alltime classics, but a pleasant and funny diversionmuch more than you can hope for in most newer movies.  If you are a fan of these stars, you will not be disappointed.",
		"When the Chamberlain family is camping near Ayers Rock, Australia, Lindy Chamberlain Meryl Streep sees her baby being dragged out of their tent by a dingo and then begins an ordeal that no one should have to experience.  For it seems like the dingo story is not believed by the public or the press, and the whole thing turns into a circus.  Lindy is she guilty Sam Neill is excellent as Michael Chamberlain, a SeventhDay adventist pastor, who has doubts about his faith and perhaps about his wife.  It is good or bad to see that people are just as prejudiced and stupid elsewhere as they are in the States too, because the Australian public does not believe the story and the media only fans the flames.  Eventually, Lindy is found guilty and sent to prison for a life of hard labor, but years later, a missing piece of evidence shows up and she is freed, but not until after the familys life is basically ruined.  A heartbreaking story, very well done, a bit long but well worth seeing. 8 out of 10.",
		"Religious bigotry is rampant everywhere.  Australia is not immune to it.A dingo snatched a baby and the mother was tried and sent to prison for having killed her own baby.  I need Sam outstanding Those with supporting roles are also quite good.You will remember this movie for many years.See it!",
		"A CRY IN THE DARK A CRY IN THE DARK was a film that I anticipated would offer a phenomenal performance from Meryl Streep and a solid, if unremarkable film.  This assumption came from the fact that aside from Streeps Best Actress nomination, the movie received little attention from major awards groups.Little did I anticipate that A CRY IN THE DARK would be such a riveting drama, wellconstructed on every level.  If you ask me, this is an underappreciatted classic.The film opens rather slowly, letting the audience settle into the Chamberlains at a relaxed pace and really notice that, at the core, they are an incredibly loving, simple family.  Fred Schepisi the director selects random moments to capture of a family on vacation that give a looming sense of the oncoming tragedy, while also showing the attentive bliss with which Lindy Streep and Michael Sam Neill Chamberlain care for their children.While the famous line A Dingo Took My Baby!  has become somewhat of a punchline these days, the movie never even comes close to laughable.  The actual death of Azaria is horrifyingly captured.  It suspects it clear As an audience member, I was fully invested in the Chamberlains plight... and was genuinely angered and hurt and saddened when they were made to look so terrible by the media.  But at the same, the mediapublic opinion is understandable.  I loved the way the media was by no means made to be sympathetic, but they always had valid reasons to hold their views.The final line of the film is very profound and captures perfectly the central element that makes this film so much different from other courtroom dramas.In terms of performances, the only ones that really matter in this film are those of Streep and Neill... and they deliver in every way.  For me, this ranks as one of if not 1 Meryl Streeps best performances.  For all her mastery of different accents which of course are very impressive in their own right, Streep never loses the central heart and soul of her characters.  I find this to be one of Streeps more subtle performances, and she hits it out of the park.  And Neill, an actor who has never impressed me beyond being charismatic and appealing in JURASSIC PARK, is a perfect counterpoint to Streeps performance.  From what I have seen, this is undoubtedly Neills finest work to date.  It is a shame he was not recognized by the Academy with a Leading Actor nomination to match Streeps... bc the two of them play of each other brilliantly.More emotionally gripping than most films, and also incredibly suspenseful...  A CRY IN THE DARK far exceeded my expectations.  I highly recommend that people who only know of the movie as the flick where Meryl screams The dingo took my baby!  watch the film and see just how much more there is to A CRY IN THE DARK then that one line....  A ...",
		"I found it hard The central characters, Lindy and Michael Chamberlain, whose daughter disappears during a night out in the Australian outback, are not bad people, but then surely not all, or even most, of the scores of people we see throughout this movie would be bad if we knew them better.  But though we are as sure as the film wants us to be of the guilt or innocence of the Chamberlains from the start of their lifes tragic disarray, the film takes on a more or less sociological perspective pertaining to gossip, news media, crowds, mobs and assumptions.  It is not a movie about the degenerate society of Australia in particular; it is merely an account of a true story that happened there.  Society en masse is much less evolved than the individual feels ensured that we are.When a warden insists upon killing all of an aborigines dogs because of the unverified action of a single wild dog, when a randomly ruined life spins even further out of control owing to the majority of magazines, newspapers and TV programs distorts the tragic truth to a level of drama that provokes its consumers into a frenzy, there is no sign of empathy or even any kind of looking outside of ones own unaware perceptions, influenced left and right by the vigorous hearsay and vibes of those who surround ones life.  The reason I appreciate the film is because it turns the focus inside out, from the victims to the masses.The evidence against Lindy Chamberlain aside, suspicion was jetfueled mostly by a virtue of hers.  To the public eye, she did not seem sufficiently distraught by the death of her baby daughter.  Why was she able to keep her cool, even a sort of aloofness let alone holding her head up, for TV and the press?  How much of the downward spiral could have been prevented had she behaved more to the publics liking in the media?  Meryl Streep, one of, if not the, greatest actress working today, may not give a performance that particularly stands out, and frankly neither does any other actor, or department of filmmaking.  But she, and the screenwriters, do understand Lindy.  What is infuriating is that it is not that difficult.  Apparently, she was not naturally prone to showing emotion in public in any case.  Whether or not she is approachable as a lovable character in the immediate sense, we are naturally prone to sympathize with her situation.Whether or not her performance is as immediately gratifying as Sophies Choice, The Devil Wears Prada, Angels In America or other such work, it is a triumph.  It is difficult enrapture an audience when you purposely deny them insights into yourself.  She frustrates us because we do not know what she is thinking or feeling.  It took me awhile to feel endeared toward her, but this is the movies way of suggesting the reaction of the publics attention.She is married to a pastor, and they both practice a religion that is in a small minority and thus misinterpreted by most.  Initially, they react to their loss as if to be reconciling themselves to Gods will, kickstarting a rumor mill generating the notion that their daughters death was some sort of ritual killing on their part.  Whatever happened to the little girl, her parents were part of a margin with whom most of the medias intake did not immediately identify, so the first inclination was to go after them like a pack of hungry...well...Meryl Streep and Sam Neill are constantly on screen, but the Australian public plays the real leads here.  Like punctuation for each plot advance, director Fred Schepisi cuts away from restaurant to tennis court to dinner party to saloon to office, where the public tries Lindy and gets carried away into their own passionate projections.This GolanGlobus docudrama is not particularly memorable.  The settings atmosphere does not give a pleasurable enough compensation for the fact that no performance or facet of production stands out.  But it is very successful as an indictment of the collective conscious of the public.",
		"I found it hard to like anyone in this film.  The central characters, Lindy and Michael Chamberlain, whose daughter disappears during a night out in the Australian outback, are not bad people, but then surely not all, or even most, of the scores of people we see throughout this movie would be bad if we knew them better.  But though we are as sure as the film wants us to be of the guilt or innocence of the Chamberlains from the start of their lifes tragic disarray, the film takes on a more or less sociological perspective pertaining to gossip, news media, crowds, mobs and assumptions.  It is not a movie about the degenerate society of Australia in particular; it is merely an account of a true story that happened there.  Society en masse is much less evolved than the individual feels ensured that we are.When a warden insists upon killing all of an aborigines dogs because of the unverified action of a single wild dog, when a randomly ruined life spins even further out of control owing to the majority of magazines, newspapers and TV programs distorts the tragic truth to a level of drama that provokes its consumers into a frenzy, there is no sign of empathy or even any kind of looking outside of ones own unaware perceptions, influenced left and right by the vigorous hearsay and vibes of those who surround ones life.  The reason I appreciate the film is because it turns the focus inside out, from the victims to the masses.The evidence against Lindy Chamberlain aside, suspicion was jetfueled mostly by a virtue of hers.  To the public eye, she did not seem sufficiently distraught by the death of her baby daughter.  Why was she able to keep her cool, even a sort of aloofness let alone holding her head up, for TV and the press?  How much of the downward spiral could have been prevented had she behaved more to the publics liking in the media?  Meryl Streep, one of, if not the, greatest actress working today, may not give a performance that particularly stands out, and frankly neither does any other actor, or department of filmmaking.  But she, and the screenwriters, do understand Lindy.  What is infuriating is that it is not that difficult.  Apparently, she was not naturally prone to showing emotion in public in any case.  Whether or not she is approachable as a lovable character in the immediate sense, we are naturally prone to sympathize with her situation.Whether or not her performance is as immediately gratifying as Sophies Choice, The Devil Wears Prada, Angels In America or other such work, it is a triumph.  It is difficult enrapture an audience when you purposely deny them insights into yourself.  She frustrates us because we do not know what she is thinking or feeling.  It took me endeared Initially, they react to their loss as if to be reconciling themselves to Gods will, kickstarting a rumor mill generating the notion that their daughters death was some sort of ritual killing on their part.  Whatever happened to the little girl, her parents were part of a margin with whom most of the medias intake did not immediately identify, so the first inclination was to go after them like a pack of hungry...well...Meryl Streep and Sam Neill are constantly on screen, but the Australian public plays the real leads here.  Like punctuation for each plot advance, director Fred Schepisi cuts away from restaurant to tennis court to dinner party to saloon to office, where the public tries Lindy and gets carried away into their own passionate projections.This GolanGlobus docudrama is not particularly memorable.  The settings atmosphere does not give a pleasurable enough compensation for the fact that no performance or facet of production stands out.  But it is very successful as an indictment of the collective conscious of the public.",
		"Meryl Streep is such a genius.  Well, at least as an actress.  I know she is been made fun of for doing a lot of roles with accents, but she nails the accent every time.  Her performance as Lindy Chamberlain was inspiring.  Mrs.  Chamberlain, as portrayed here, was not particularly likable, nor all that smart.  But that just makes Streeps work all the more remarkable.  I think she worth About the film, well, there were a couple of interesting things.  I do not know much about Australia, but the theme of religious bigotry among the general public played a big part in the story.  I had largely missed this when I first saw the film some years ago, but it came through loud and clear yesterday.  And it seems the Australian press is just as accomplished at miseryinducing pursuit and overkill as their American colleagues.  A pretty good film.  A bit different.  Grade B",
		"Meryl Streep is excellent in her nuanced and stoic performance as the infamous Lindy Chamberlain who was accused and tried for allegedly killing her own baby Azaria Chamberlain and using her alibi of ravenous dingoes as her defense.  Based on the book Evil Angels and titled so in its Australian release, A CRY IN THE DARK is an ugly film to watch.  It presents a scenario that is all too real for us in America the witchhunt against a person deemed an easy target.Lindy Chamberlain was this woman.  Being someone who spoke her mind, someone who did not play the sympathy card, and someone who was just tough enough to move on with her life despite her horrific ordeal, she was labeled as suspect and hated beyond comprehension even when it was clear she did not kill her own child.  The media began a tightening noose and a progressive invasion of privacy that soon had the entire nation glued to their sets as they eviscerated this family piece by piece.  And through it all, Lindy remained as stoic as ever, even when her husband Michael was falling apart.This stance, of course, is the power of strength, as unsympathetic as it may look like, and people happen to react strongly to that.  They want to see a distressed mother cry and weep and occasionally faint at every turn, not sit there and look blank.  People do someone strong Meryl Streep embodies this tainted woman to the hilt and in doing so creates a cold, but not unfeeling woman, one that stood by her convictions even if they cost her liberty.  Because of her, Sam Neill is allowed to have his character slowly dissolve into despair  someone has to, or the Chamberlains would be too detached, and no one wants to see that.  Except the monster that has at the time of this writing become the newsmedia.  They will always eat train wrecks up and feed the mangled manure to the uninformed public.",
		"An unqualified 10.  The level of writing and acting in this Australian movie is reminiscent of the very best of old Hollywood.  Sam Neill and Meryl Streep are very good together.  Neill matches it sexy This engrossing film is a treat for any movie fan who loves a gripping courtroom drama, portrayed in the most human but unsentimental terms.  The movie  which won several top awards in Australia  boasts not only a superlative cast and director, but wonderful and authentic Australian locales.  It proves that people are the same the world over.  And, after all these years, people still delight in repeating the famous Streep line, accent and all A dingo ate moy baby!  Including that imp Elaine Benis on Seinfeld.",
		"Some movies seem to be made before we are ready for them.  As I watched this film, made in 1988, in 1999, I thought I was watching the O.J.  Simpson debacle although I have very different opinions about the innocence of the individuals in each situation.The Australian news media, if this movie is to be believed, devoured the case of a possible infanticide and truth was left as an afterthought.  It was scary to see the scenes of invasive, swarming media hordes, ridiculous accounts of halftruths and lies and debates over the supposed merits of the case by persons at all levels of society.Equally appalling is the medias depiction as indifferent and uncomprehending of the technical information in the case.  I do important.Streep excellent The Aussie accents get a bit thick at times but not incomprehensible.",
		"I just sat through a very enjoyable fast paced 45 mins of ROLL.Roll is about a country boy, Mat Toby Malone who has dreams of becoming a Sports Star.  Mat travels to the city and is to be picked up by his cousin George Damien Robertson.  Well, that was the plan anyway.  George is involved with a gangster, Tiny John Batchelor and is making a delivery for him.  Needless to say, Mat gets dragged into Georges world.  I thought it great Toby and Damien were well cast together and did an outstanding job.Every character in the movie complimented each other very well, the two cops were great.  David Ngoombujarra brought some great comic relief to the movie.  Tiny played a likable gangster that reminded me of one of my favourite characters Pando from Two Hands.One of the other things that I liked about Roll was that it showcased the cities that I grew up and lived in for 20 years, Perth and Fremantle.  It was good to see sights and landmarks that I grew up with, especially the old Ferris wheel.This Rocks n Rolls",
		"A film I expected very little from, and only watched to pass a quiet hour  but what an hour it turned out to be.  Roll is right.Toby endearing He is supported superbly by John Batchelor as local gangster Tiny.  Watch out for these two.Highly recommended.",
		"Next to Star Wars and The Wizard of Oz, this remains one of the greatest fantasy films ever made.  It is it wonderful I absolutely adore this film.  It has an extraordinary music score by Miklos Rozsa perhaps my favorite classic film score that rivals any John Williams Star Wars score, a fast but not flashy pace, beautiful sets, dialog, and use of color both the sets and cinematography won Oscars, and stateoftheart Oscarwinning special effects for the time, and some are still stunning.  And, of course, June Duprezs sultry looks as the Princess rivals that of Catherine ZetaJones she even looks like Jones in a way!. In conclusion, this is one of my alltime favorite movie next to The Adventures of Robin Hood and it truly deserves more attention.  It is a true adventure of enchantment throughout, and, along with Robin Hood, it is my desert island film that I could watch over and over again without getting annoyed.Stars  excellent",
		"Next to Star Wars and The Wizard of Oz, this remains one of the greatest fantasy films ever made.  It is a true shame it is not as wellknown as the former films maybe because it sticks to a story based on legends rather than contemporary or scifi settings, and that it is British, meaning a smaller market for films but its wonderful to know that it is deserved that reputation.Like all great family films, one can be a child, an adult, or even a teenager to enjoy this film I am currently 18, but one must appreciate classic films first.  I absolutely adore this film.  It has an extraordinary music score by Miklos Rozsa perhaps my favorite classic film score that rivals any John Williams Star Wars score, a fast but not flashy pace, beautiful sets, dialog, and use of color both the sets and cinematography won Oscars, and stateoftheart Oscarwinning special effects for the time, and some are still stunning.  And, of course, June Duprezs sultry looks as the Princess rivals that of Catherine ZetaJones she even looks like Jones in a way!. In conclusion, this is one of my alltime favorite movie next to The Adventures of Robin Hood and it truly deserves more attention.  It is I excellent",
		"This is a beautiful movie filled with adventure.  The Genii in the bottle is a classic scene.  Romantic in it is finish, all things turn out as they should be.  I saw I true",
		"The making of The Thief Of Bagdad is quite a story unto itself, almost as wondrous as the tale told in this film.  Alexander Korda nearly went broke making this film.According to the Citadel Film series Book about The Great British Films, adopted son of the United Kingdom Alexander Korda had conceived this film as early as 1933 and spent years of planning and preparation.  But World War II unfortunately caught up with Korda and the mounting expenses of filming a grand spectacle.Budget costs happen in US films too, only Cecil B.  DeMille always had a free hand at Paramount after 1932 when he returned there.  But DeMille nor any of his American contemporaries had to worry about enemy bombs while shooting the film.  Part of the way through the shoot, Korda transported the whole company to America and shot those sequences with Rex Ingram as the genie in our Grand Canyon.  He certainly was not going to get scenery like that in the UK.  Korda also finished the interiors in Hollywood, all in time for a release on Christmas Day 1940.The spectacle of the thing earned The Thief Of Bagdad four Academy Award nominations and three Oscars for best color cinematography, best artset direction for a color film, and best special effects.  Only Miklos Roszas original musical score did not take home a prize in a nominated category.  Korda have it impossible The good is the two young lovers John Justin and June Duprez and the evil is Conrad Veidt as the sorcerer who tries to steal both a kingdom and a heart, both belonging to Duprez.  This was Veidts career role until Casablanca where he played the Luftwaffe major Stroesser.  Of course good gets a little help from an unlikely source.  Beggar boy and thief Sabu who may very well have been one of the few who could call himself at the time an international movie star.  Literally rising from poverty working as an elephant stable boy for the Maharajah of Mysore he was spotted by Alexander Korda who needed a native lead for one of his jungle features.  Sabu captures all the innocence and mischievousness of youth as he fulfills the Arabian Nights fantasy of the boy who topples a tyrant.  Not a bad message to be sending out in 1940 at that.The Thief Of Bagdad holds up remarkably well today.  It is an eternal tale of love, romance, and adventure in any order you want to put it.",
		"Although time has revealed how some of the effects were done this story of love and adventure still is special.If you have never seen this film before you will be shocked at how much has been stolen by later film makers.  I was watching this with a friend who was amazed at how much Disneys Aladdin cribbed from the film.  They loved it such Everything is rushed as if they has to suddenly get to the end.  From the point from the departure of the djinn to the end it appears to be more sketch then finished painting.  It does not kill the film, but it does weaken it.Still its required viewing for anyone who loves a good fairy tale, or even a great movie.",
		"This was a favorite of my childhood  I can remember seeing it on television and thrilling to it each time.  Now that I am grown up and have a kid of my own, I wanted to introduce him to this classic movie.  We watched it last Friday, and he liked it.  During Abus fight with the giant spider, my sons hand crept over and took hold of mine  he was genuinely scared.  Is he gonna beat the spider, Poppa?  Just watch, you will see.  He has no historical frame of reference to speak of eight years old, so Bagdad under the grandson of Haroun alRaschid might as well be Oz under Ozma.I think he especially liked how much of the heroics and derringdo were perpetrated by the boythief, and not the grownup king.  In fact, if you deconstruct the films narrative a bit, the king is the thiefs sidekick, not the hero at all  which must be very satisfying to imaginative, adventurous young boys.  It is I corny The love story is barely onedimensional  as a cynical friend commented, Why does Ahmad love the Princess?  Because the narrative demands it.  The willingness of Abu to put himself in jeopardy repeatedly for the clueless, lovestruck deposed king is equally improbable.  But to quibble about such things while accepting flying mechanical horses, fiftyfoot genies and the Temple of the AllSeeing Eye would be fatuous in the extreme.  The satisfaction of seeing the prophecy fulfilled at the movies climax is tremendous, as is the final shot of Abu triumphantly flying away on his stolen magic carpet, seeking some fun, and adventure at last!",
		"I have seen this film several times, and watched it today on TCM solely because of Geraldine Fitzgerald.  She is a much underrated actress and I have to admit I have had a crush on her since I first saw her probably in Wuthering Heights 40 or more years ago.  The real star in this movie, however, is Paul Lukas, and he deserved all the accolades he got.  He makes it clear Naziism had to be stopped, and anything that helped do it was good.  He gave his children a line about being bad, and that they should not be bad, but as he said earlier when conversing with adults, he would do this sort of thing again without hesitation.  Lukas did give an excellent portrayal of a man caught in this situation, and made it clear that what he did was a very hard thing to do.Some people think his victim was a Nazi, but I do not think so  I think he was only after the money.  His Nazi associates knew this and that is why they did not have much use for him.One interesting point in the film, and presumably also in the play, is the fact that Muller Lucas is a German.  While the anti German hysteria of WWI was not repeated in WWII, there was considerable antiGerman sentiment and some Germans were interred similar to what happened in California with people of Japanese ancestry.  It was something of an act of bravery for Hellman to write a play about good Germans at this time maybe she thought they were the ones who signed the NaziSoviet pact!.  After all, the US and British air forces were bombing German cities and having no qualms about killing innocent civilians.  I think, however, that the Dresden bombing and firestorm happened later, after Watch on the Rhine was released.The title is something of a play on words, as the watch is looking west, from Germany.  In fact, Watch am Rhein was a German army marching song  used in WWII, but the Nazis had their own marching song that was used as well.  But Muller IS a German and he is engaged in his own Wach am Rhein.All the other actors did an excellent job here; although Bodo was too much there are children like him.  I am surprised he did not give his fathers secret away.  In real life, he may very well have done so.",
		"I have seen this film several times, and watched it today on TCM solely because of Geraldine Fitzgerald.  She is a much underrated actress and I have to admit I have had a crush on her since I first saw her probably in Wuthering Heights 40 or more years ago.  The real star in this movie, however, is Paul Lukas, and he deserved all the accolades he got.  He makes it clear, whether we like it or not, that the end justifies the means.  Naziism had to be stopped, and anything that helped do it was good.  He gave his children a line about being bad, and that they should not be bad, but as he said earlier when conversing with adults, he would do this sort of thing again without hesitation.  Lukas did it clear His Nazi associates knew this and that is why they did not have much use for him.One interesting point in the film, and presumably also in the play, is the fact that Muller Lucas is a German.  While the anti German hysteria of WWI was not repeated in WWII, there was considerable antiGerman sentiment and some Germans were interred similar to what happened in California with people of Japanese ancestry.  It was something of an act of bravery for Hellman to write a play about good Germans at this time maybe she thought they were the ones who signed the NaziSoviet pact!.  After all, the US and British air forces were bombing German cities and having no qualms about killing innocent civilians.  I think, however, that the Dresden bombing and firestorm happened later, after Watch on the Rhine was released.The title is something of a play on words, as the watch is looking west, from Germany.  In fact, Watch am Rhein was a German army marching song  used in WWII, but the Nazis had their own marching song that was used as well.  But Muller IS a German and he is engaged in his own Wach am Rhein.All the other actors did an excellent job here; although Bodo was too much there are children like him.  I am surprised he did not give his fathers secret away.  In real life, he may very well have done so.",
		"I have seen this film several times, and watched it today on TCM solely because of Geraldine Fitzgerald.  She is a much underrated actress and I have to admit I have had a crush on her since I first saw her probably in Wuthering Heights 40 or more years ago.  The real star in this movie, however, is Paul Lukas, and he deserved all the accolades he got.  He makes it clear, whether we like it or not, that the end justifies the means.  Naziism had to be stopped, and anything that helped do it was good.  He gave his children a line about being bad, and that they should not be bad, but as he said earlier when conversing with adults, he would do this sort of thing again without hesitation.  Lukas did give an excellent portrayal of a man caught in this situation, and made it clear that what he did was a very hard thing to do.Some people think his victim was a Nazi, but I do not think so  I think he was only after the money.  His Nazi associates knew this and that is why they did not have much use for him.One interesting point in the film, and presumably also in the play, is the fact that Muller Lucas is a German.  While the anti German hysteria of WWI was not repeated in WWII, there was considerable antiGerman sentiment and some Germans were interred similar to what happened in California with people of Japanese ancestry.  It was something of an act of bravery for Hellman to write a play about good Germans at this time maybe she thought they were the ones who signed the NaziSoviet pact!.  After all, the US and British air forces were bombing German cities and having no qualms about killing innocent civilians.  I think, however, that the Dresden bombing and firestorm happened later, after Watch on the Rhine was released.The title is something of a play on words, as the watch is looking west, from Germany.  In fact, Watch am Rhein was a German army marching song  used in WWII, but the Nazis had their own marching song that was used as well.  But Muller IS a German and he is engaged in his own Wach am Rhein.All the other actors did an excellent job here; although Bodo was too much there are children like him.  I am he secret In real life, he may very well have done so.",
		"This film, was one of my childhood favorites and I must say that, unlike some other films I liked in that period The Thief of Bagdad has held on to it is quality while I grew up.  This is not merely a film to be enjoyed by children, it can be watched and enjoyed by adults as well.  The only drawback there is, is that one can not see past the bad effects compared to the effects nowadays like one could when one was a child.  I remembered it old Who then watches effects?  One only seeks good stories and entertainment and this is exactly what this film provides.  In my mind this film is one of the first great adventure films of the 20th century.  Coming to think of it I feel like the Indiana Jones films are quite a like this film.  There is comedy, romance and adventure all in one, which creates a wonderful mixture that will capture you from the beginning until the end and although the film is old and the music and style of the films is clearly not modern, it succeeds in not being dusty and old.  All of that is mainly due to the great story, the good directing and the good acting performances of the actors.  In that department Sabu as Abu and Conrad Veidt as Jaffar stand out, providing the comedic and the chilling elements of the film for the most part.  Great film and although an oldie, definitely a goldie.  I hope someone has the brain and guts to release this one on DVD someday.8 out of 10",
		"The storyline of The Thief of Bagdad is complex, owing to its being told in flashbacks and having three separate and equally important strands woven together.  The screenplay by Lajo Biros and the dialogue by Miles Malleson keep the story moving skillfully at all points.The young King Ahmad of Bagdad is angry at his vizier Jaffar for executing a man for having different ideas.  He discovers while in disguise that people blame him for Jaffars deeds and hate him.  He is imprisoned by Jaffar, where he meets Abu the young thief.  The two escape and take a boat to the city of Basra.  There the companions spy when men clear the way so none will see the Princess of the city passing by.  Ahmad falls in love with her and visits her in her garden.  He tells her he has come to her from beyond time and wins a kiss.  Then he is captured.  When Jaffar comes to win the Princess of Basra for himself, Ahmad attacks the evil vizier who blinds him and turns Abu into a dog.  Jaffar then asks for the Princesss hand, and he gives the gift of a mechanical flying horse to the Sultan of Basra.  The blind Ahmad then tells his tale in the marketplace, accompanied by Abu as his dog.  The Prince has fallen into a sleep and nothing can wake her.  So Jaffar sends his servant Halima for Ahmad and the dog, in hopes the prince can rouse her.  He does awaken her.  She boards a ship to find a doctor to cure Ahmad, but she is captured by Jaffar who then throws the dog overboard.  She then allows Jaffar to take her in his arms, on his promise to restore Ahmads sight and turn Abu back into a thief.  The princess sees a vision of Ahmad; he is in a boat; Jaffar sends a storm to beset him and Abu is shipwrecked on a deserted island.  Abu finds he free Abu tricks him into proving he really came from so small a vessel, then corks him in again.  For freeing him, he gets three wishes.  His first is for sausages.  In the meanwhile, the Princess pleads with her father to refuse Jaffar; but Jaffar shows the Sultan a new mechanical toy, one of whose six arms stabs him to death.  Abu makes a second wish, to find Ahmad.  The cunning genie flies him to the goddess of the AllSeeing eye.  Abu has to climb a great web to get to the gem that is the eye, battling a giant spider, then scaling the goddesss statue.  Abu gazes into the eye and sees Ahmad in a canyon.  He has the genie take him to Ahmad.  Ahmad uses the eye to see the princess.  She smells a flower and forgets everything at once.  Abu wishes they were in Bagdad, but the genie laughs and leaves; Jaffar tells the Princess that she is in love with him, omitting mention of Ahmad.  Ahmad tries to fight his way to the Princess, but Jaffar smashes the eye.  Abu finds himself in the Land of Legend, where the old men who rule want to make him their king.  He steals a bow and a magic carpet and escapes instead, to hurry to save Ahmad and the princess.  The thief arrives in time to save the young king from the executioner, using his bow from the flying carpet, to the wonder of the throng who had come to watch the execution.  Jaffar tries to flee on the mechanical flying horse, but another shot from the bow finishes him.  Ahmad is ruler again and plans to wed his Princess; but when he tries to make Abu his vizier, the young thief refuses, saying that what he wants is adventure, not hard work and confinement in a palace however grand it may be.  This fantastic story was given a sumptuous production by producer Alexander Korda.  The production was designed by Vincent Korda who was also art director, while Georges Perinal did the colorful cinematography.  The directors credited are Ludwig Berger and Michael Powell, with Tim Whelan, Alexander Korda, William Cameron Menzies and Zoltan Korda participating.  The extraordinary and numerous costumes designs were the work of John Armstrong, Oliver Messel and Marcel Vertes.  The production, apart from its gorgeous and expensivelooking visual splendors, I claim is dominated by two other elements, the choral music of Miklos Rozsa and the performance by Conrad Veidt as the evil Jaffar.  Rex Ingram plays the genie with a curious accent, plus his usual intelligence and power.  June Duprez is lovely and effective as the Princess Mary Morris is a sad and beautiful Halima, and Miles Malleson a properly bumbling and avaricious Sultan.  As Ahmad, John Justin appears to do most of what can be done with the part of a young prince in love and then some; he is memorably good in his winning role.  This film has a spaciousness about it that is found, I assert, in other Korda works also.  Its imaginative content stands in contrast to verystrong realistic sets, costumes and setdesign elements.  This is one of the most memorable idealevel fantasies of all time, worthy to be enjoyed over and over.",
		"The movie tells the tale of a prince whose life is wonderful, but after an evil wizard tells him to go into town disguised as a beggar the wizard then locks up the prince and soon becomes the shadow ruler of Baghdad. the jailed prince meets a thief called Abu who helps him escape the jail and head to a town called Basra where he meets a princess who he falls madly in love with, but unbeknown to him the evil wizard Jafa is also in love with the princess and tries to convince her father to allow him to marry her.  Jafa learns he blind This leads to the prince and Abu going off on an adventure to find a way to defeat Jafa, restore peace to Baghdad and marry the princess. during their journey they encounter everything from sarcastic Genies that takes Abu on a flight through the clouds, a giant spider that is really hungry, and a flying horse that probably gives birth to one of the most beautiful sequence these old eyes of mine have ever seen.This is a pure fantasy movie from start to finish it has flying horses, genies, flying carpets, and wizards that can actually do magic instead of just hit people with their staffs.  It does not have any cheesy moments and the love story is not a waste of time.  The production designs are just stunning in this movie.  From the palaces to the different dangerous traps that the heroes encounter.  Even though this movie is over 40 years old, the production design is far better than most of the crap that gets tacked on in todays cinema.  The music and songs are also well done.  Anyone who sees it will no doubt hail, I want to be a sailor sailing on the seas as one of the great musical moments in movies.  I am usually not a huge fan of singing in movies since I find them about as enjoyable as doing my taxes but I will be more than happy to make an exception for this movie.What sells the movie for me is the sheer fact that you get to see things you do not see in everyday life which is also the same reason why I love stuff like Two Towers and Silent Hill.  Way before todays modern fantasy movie came along with their realistic CGI to blow our minds there was this movie which blew your mind without having green screen scattered all over the place.  One of my favorite shots in Two Towers is the one where we see the trolls opening the Black Gates, the main appeal of that shot for me was seeing these great fantasy beings doing what is essentially manual labor, and that is what I love about the Genie and other creatures in the movie.  They are just there trying to make a living just like everyone else which gives them a real feel even though they are all just fantasy beings.It is literally impossible to watch this movie and not notice where the makers of Aladdin got their inspiration.  The characters from this movie are pretty much the same characters in that movie from the talkative Genie right down to the flying carpet.  It is not an entirely bad thing in my eyes since it is nice to know that I am not the only one on the planet that has a deep passionate love for this amazing movie.  I first saw this as a kid in the motherland and thought it was the greatest thing in the world and upon watching it again last week I still think it is amazing.  That is a true testament that a great movie can withstand the test of time.  Sure, the effects look a wee bit outdated and cheesy but it was made way back in the 40s so give it a break.  Not everything looks outdated though since most of the stuff can still hold its own today when scrutinized under todays standard.If you ever wanted to see a live action version of Aladdin then you should get your wish with this but the angry cynical bunch will probably do good in avoiding this since this will not be their cup of tea.",
		"The movie tells the tale of a prince whose life is wonderful, but after an evil wizard tells him to go into town disguised as a beggar the wizard then locks up the prince and soon becomes the shadow ruler of Baghdad. the jailed prince meets a thief called Abu who helps him escape the jail and head to a town called Basra where he meets a princess who he falls madly in love with, but unbeknown to him the evil wizard Jafa is also in love with the princess and tries to convince her father to allow him to marry her.  Jafa soon learns that the prince is trying to win the girls heart so he makes him blind and turns Abu into a dog.  This leads to the prince and Abu going off on an adventure to find a way to defeat Jafa, restore peace to Baghdad and marry the princess. during their journey they encounter everything from sarcastic Genies that takes Abu on a flight through the clouds, a giant spider that is really hungry, and a flying horse that probably gives birth to one of the most beautiful sequence these old eyes of mine have ever seen.This is a pure fantasy movie from start to finish it has flying horses, genies, flying carpets, and wizards that can actually do magic instead of just hit people with their staffs.  It does not have any cheesy moments and the love story is not a waste of time.  The production designs are just stunning in this movie.  From the palaces to the different dangerous traps that the heroes encounter.  Even though this movie is over 40 years old, the production design is far better than most of the crap that gets tacked on in todays cinema.  The music and songs are also well done.  Anyone who sees it will no doubt hail, I want to be a sailor sailing on the seas as one of the great musical moments in movies.  I am usually not a huge fan of singing in movies since I find them about as enjoyable as doing my taxes but I will be more than happy to make an exception for this movie.What sells the movie for me is the sheer fact that you get to see things you do not see in everyday life which is also the same reason why I love stuff like Two Towers and Silent Hill.  Way before todays modern fantasy movie came along with their realistic CGI to blow our minds there was this movie which blew your mind without having green screen scattered all over the place.  One of my favorite shots in Two Towers is the one where we see the trolls opening the Black Gates, the main appeal of that shot for me was seeing these great fantasy beings doing what is essentially manual labor, and that is what I love about the Genie and other creatures in the movie.  They are they impossible The characters from this movie are pretty much the same characters in that movie from the talkative Genie right down to the flying carpet.  It is not an entirely bad thing in my eyes since it is nice to know that I am not the only one on the planet that has a deep passionate love for this amazing movie.  I first saw this as a kid in the motherland and thought it was the greatest thing in the world and upon watching it again last week I still think it is amazing.  That is a true testament that a great movie can withstand the test of time.  Sure, the effects look a wee bit outdated and cheesy but it was made way back in the 40s so give it a break.  Not everything looks outdated though since most of the stuff can still hold its own today when scrutinized under todays standard.If you ever wanted to see a live action version of Aladdin then you should get your wish with this but the angry cynical bunch will probably do good in avoiding this since this will not be their cup of tea.",
		"The movie tells the tale of a prince whose life is wonderful, but after an evil wizard tells him to go into town disguised as a beggar the wizard then locks up the prince and soon becomes the shadow ruler of Baghdad. the jailed prince meets a thief called Abu who helps him escape the jail and head to a town called Basra where he meets a princess who he falls madly in love with, but unbeknown to him the evil wizard Jafa is also in love with the princess and tries to convince her father to allow him to marry her.  Jafa soon learns that the prince is trying to win the girls heart so he makes him blind and turns Abu into a dog.  This leads to the prince and Abu going off on an adventure to find a way to defeat Jafa, restore peace to Baghdad and marry the princess. during their journey they encounter everything from sarcastic Genies that takes Abu on a flight through the clouds, a giant spider that is really hungry, and a flying horse that probably gives birth to one of the most beautiful sequence these old eyes of mine have ever seen.This is a pure fantasy movie from start to finish it has flying horses, genies, flying carpets, and wizards that can actually do magic instead of just hit people with their staffs.  It does not have any cheesy moments and the love story is not a waste of time.  The production designs are just stunning in this movie.  From the palaces to the different dangerous traps that the heroes encounter.  Even though this movie is over 40 years old, the production design is far better than most of the crap that gets tacked on in todays cinema.  The music and songs are also well done.  Anyone who sees it will no doubt hail, I want to be a sailor sailing on the seas as one of the great musical moments in movies.  I am usually not a huge fan of singing in movies since I find them about as enjoyable as doing my taxes but I will be more than happy to make an exception for this movie.What sells the movie for me is the sheer fact that you get to see things you do not see in everyday life which is also the same reason why I love stuff like Two Towers and Silent Hill.  Way before todays modern fantasy movie came along with their realistic CGI to blow our minds there was this movie which blew your mind without having green screen scattered all over the place.  One of my favorite shots in Two Towers is the one where we see the trolls opening the Black Gates, the main appeal of that shot for me was seeing these great fantasy beings doing what is essentially manual labor, and that is what I love about the Genie and other creatures in the movie.  They are just there trying to make a living just like everyone else which gives them a real feel even though they are all just fantasy beings.It is literally impossible to watch this movie and not notice where the makers of Aladdin got their inspiration.  The characters from this movie are pretty much the same characters in that movie from the talkative Genie right down to the flying carpet.  It is it nice I first saw this as a kid in the motherland and thought it was the greatest thing in the world and upon watching it again last week I still think it is amazing.  That is a true testament that a great movie can withstand the test of time.  Sure, the effects look a wee bit outdated and cheesy but it was made way back in the 40s so give it a break.  Not everything looks outdated though since most of the stuff can still hold its own today when scrutinized under todays standard.If you ever wanted to see a live action version of Aladdin then you should get your wish with this but the angry cynical bunch will probably do good in avoiding this since this will not be their cup of tea.",
		"The movie tells the tale of a prince whose life is wonderful, but after an evil wizard tells him to go into town disguised as a beggar the wizard then locks up the prince and soon becomes the shadow ruler of Baghdad. the jailed prince meets a thief called Abu who helps him escape the jail and head to a town called Basra where he meets a princess who he falls madly in love with, but unbeknown to him the evil wizard Jafa is also in love with the princess and tries to convince her father to allow him to marry her.  Jafa soon learns that the prince is trying to win the girls heart so he makes him blind and turns Abu into a dog.  This leads to the prince and Abu going off on an adventure to find a way to defeat Jafa, restore peace to Baghdad and marry the princess. during their journey they encounter everything from sarcastic Genies that takes Abu on a flight through the clouds, a giant spider that is really hungry, and a flying horse that probably gives birth to one of the most beautiful sequence these old eyes of mine have ever seen.This is a pure fantasy movie from start to finish it has flying horses, genies, flying carpets, and wizards that can actually do magic instead of just hit people with their staffs.  It does not have any cheesy moments and the love story is not a waste of time.  The production designs are just stunning in this movie.  From the palaces to the different dangerous traps that the heroes encounter.  Even though this movie is over 40 years old, the production design is far better than most of the crap that gets tacked on in todays cinema.  The music and songs are also well done.  Anyone who sees it will no doubt hail, I want to be a sailor sailing on the seas as one of the great musical moments in movies.  I am usually not a huge fan of singing in movies since I find them about as enjoyable as doing my taxes but I will be more than happy to make an exception for this movie.What sells the movie for me is the sheer fact that you get to see things you do not see in everyday life which is also the same reason why I love stuff like Two Towers and Silent Hill.  Way before todays modern fantasy movie came along with their realistic CGI to blow our minds there was this movie which blew your mind without having green screen scattered all over the place.  One of my favorite shots in Two Towers is the one where we see the trolls opening the Black Gates, the main appeal of that shot for me was seeing these great fantasy beings doing what is essentially manual labor, and that is what I love about the Genie and other creatures in the movie.  They are just there trying to make a living just like everyone else which gives them a real feel even though they are all just fantasy beings.It is literally impossible to watch this movie and not notice where the makers of Aladdin got their inspiration.  The characters from this movie are pretty much the same characters in that movie from the talkative Genie right down to the flying carpet.  It is not an entirely bad thing in my eyes since it is nice to know that I am not the only one on the planet that has a deep passionate love for this amazing movie.  I saw it amazing That is a true testament that a great movie can withstand the test of time.  Sure, the effects look a wee bit outdated and cheesy but it was made way back in the 40s so give it a break.  Not everything looks outdated though since most of the stuff can still hold its own today when scrutinized under todays standard.If you ever wanted to see a live action version of Aladdin then you should get your wish with this but the angry cynical bunch will probably do good in avoiding this since this will not be their cup of tea.",
		"I have to agree with MR.  Caruso Jr Lanza,s was the finest voice god had to offer if only he could have found the courage to go for broke leave Hollywood and head for the opera he could have been the American Caruso everyone says he could have been but in any case he is a fantastic introduction to the art form no bones about it and if thats the way its gonna be so be it. see the film you will see why Mr Lanza still come up in discussion even in my house.  Someone says MARIO bad",
		"Watch On The Rhine started as a Broadway play by Lillian Hellman who wrote the film and saw it open on Broadway at a time when the Soviet Union was still bound to Nazi Germany by that infamous nonaggression pact signed in August of 1939.  So much for the fact that Hellman was merely echoing the Communist party line, the line did not change until a couple of months later.  Lillian was actually months ahead of her time with this work.The play Watch On The Rhine ran from April 1941 to February 1942 for 378 performances and five players came over from Broadway to repeat their roles Frank Wilson as the butler, Eric Roberts as the youngest son, Lucile Watson as the family matriarch and most importantly villain George Coulouris and Paul Lukas.Lukas pulled an award hat trick in 1943 winning an Oscar, a Golden Globe, and the New York Film Critics for Best Actor.  Probably if the Tony Awards had been in existence then he would have won that as well.  The Oscar is even more remarkable when you consider who he was up against, Humphrey Bogart for Casablanca, Gary Cooper in For Whom The Bell Tolls, Mickey Rooney in The Human Comedy, and Walter Pidgeon for Madame Curie.  Every one of his competitors was a bigger box office movie name than he was.  Lukass nomination is usually the kind the Academy gives to round out a field.Jack Warner knew that which is why Mady Christians did not repeat her Broadway part and the role of Lukass wife was given to Bette Davis.  Davis took the part not because this was an especially showy role for her, but because she believed in the picture and just wanted to be associated with it.  It is she much After many years of being vagabonds on the continent of Europe, Davis Lukas, and their three children come to America which has not yet entered the European War.  They are made welcome by Lucile Watson who is thrilled naturally at finally meeting her grandchildren.The fly in this ointment are some other house guests, a friend of Daviss from bygone days Geraldine Fitzgerald and her husband who is also from Europe, a Rumanian diplomat and aristocrat George Coulouris.  Coulouris is a wastrel and a spendthrift and he smells an opportunity for double dealing when he suspects Lukass antifascist background.  His suspicions are quite correct, it is the reason that the family has been the vagabonds they have become.  Lukas fought in Spain on the Republican side and was wounded there.  His health has not been the same since.  His family loyally supports him in whatever decision he makes.  Those decisions affect all the other members of the cast.Adding quite a bit more to the Broadway play including some lovely fascist creatures was Dashiell Hammett who was Lillian Hellmans significant other.  Coulouris playing cards at the German embassy was a Hammett creation with such loathsome types as Henry Daniell, Kurt Katch, Clyde Fillmore, Erwin Kalser and Rudolph Anders.Coulouris is truly one of the most despicable characters ever brought to screen as the no account Runmanian count.  He was a metaphor for his own country who embraced the Nazis with gusto and then equally repudiated them without losing a step after Stalingrad.Lucile Watson was up for Best Supporting Actress in 1943, but lost to Katina Paxinou in For Whom The Bell Tolls.  Dashiell Hammett was nominated for best adapted screenplay and the film itself lost for Best Picture to that other antifascist classic, Casablanca.  Though it is an item firmly planted in those specific times, Watch On The Rhine still packs a stern antifascist message that bears repeating infinitely.",
		"This movie is intelligent.  That is, more than most other movies, it transcends the least common denominator  stupid people will probably not appreciate it.  The story also relies heavily on dialogue.  It has some parallels to Lost in Translation, although Before Sunrise is much brighter, somehow less abstract, and simply a lot better.The script, the characters and even the slightly surreal atmosphere feel totally realistic.  The actors play absolutely brilliantly.  Rarely have I seen a movie where the script and the acting has melted this perfectly together.The dialogue moves into very personal issues, with the risk of becoming a little over the top.  It does I embarrassing Balancing on this fine line demands outrageously talented actors.  Sometimes, it yields great results, and overall this movie is simply stupendous!  Only very, very rarely is love in films depicted in a way that I find trustworthy and realistic.  Every time that is achieved, the result is fantastic.  I think the stunning and apparently timeless beauty of the female lead actress helped quite a bit in this respect.  She still looks stunning in this film, 12 years after.This is simply a gem of a movie that you cannot miss.  One of the best movies I have seen from the 1990s!",
		"Before Sunrise has many remarkable things going on, almost too many to fit into one review like this, but it is suffice to say that it is one of the most observant character studies of the nineties, maybe even in all of contemporary cinema, to be observant not about love, persay, so much as it is about a human connection.  How does one fall in love at first sight?  No one does, at least that is deep down the consensus that Linklater wants to show with his film.  And yet there is the possibility of as intense a connection, of a bond that can form in those that are young and with many ideas that can be expressed articulately and with a breadth of cynicism and is somehow very tender and true at the same time.  Linklater here gives us the story of Celine and Jessie, a French girl and an American boy who get off the same train heading to Vienna, and on the way there start to talking about things, at first arbitrary, then personal Jessie seeing death for the first time in his great grandfather.  Jessie persuades Celine to go along with him on a night out on the town, in Vienna, until his plane the next morning.Before Sunrise gives Jessie and Celine, in the midst of the gorgeous Vienna scenery and locales to go on and on about subjects that have a lot of importance, and in a sense is about the act of having conversations, of what it is like to watch people having one leading into another and another.  Here it is often about relationships and commitments, as Jessie and Celine tell stories sometimes somewhat inconsequential, or seemingly so, and another that may tell a lot about their essential qualities.  We hear confessions of desires for other loves, or what were not really loves, of being part of a family or part of an upbringing that may or may not inform how you will love your life, of what it means to believe or not believe in some religious form, or just to have some connection to any faith and the soul I loved the bit about the quakers in the church, and sometimes laced with cynicism or skepticism.  Jessie is it necessary The conceit is that of an old romantic picture ala Brief Encounter, only here intimacy is expressed in the central characters either between each other, where sweet asides are actually acceptable I have to tell you a secret, Jessie says, and then leans in for a kiss, hoho, or in the little moments that pop up with other people along the way.  I loved the scene with the poet, where it is very cinematic a thing to suddenly find a random romantic bit player in the midst of a romantic picture with such beautiful words at his disposal, or with the palm reader and how the reactions from Jessie and Celine are that we might share, but really are seeing them do it firsthand.  All the while Hawke and Delpy embody the roles interestingly we can see how neuroses are being formed already for their adult lives as it may lead off into the future...Featuring splendid cinematography and a script with an ear for natural wit and a true sense of what it means to have a moment of happiness, however selfcontained, as it may lead into something more.  Who is to say you cannot suddenly be attached to someone, if only for less than 24 hours, and be that much more attached than a married couple?  This is perhaps Linklaters thesis, but there is more to it than just that.  It is a very dense film, and one that will have me calling back to it repeatedly.  One scene especially, which is both cheesy and brilliant is when the two of them are talking on the phone in front of each other mimicking their expositions might go to the others friend.  A"
	]
}