{
	"augmented_text": [
		"I was expecting a documentary that focused on the tobacco industry in North Carolina.  Instead I watched a man who rues the fact that his great grandfather lost his tobacco empire to the Duke family.  And this went on and on.  If Mr.  McElwees family had prevailed over the Dukes I doubt that Mr.  McElwee would have any problems with the death toll caused by tobaccorelated diseases.  I grew area Mr. McElwees family began it tobacco business ; I expected more than McEwees continual focus on his family.  I learned very little about the history of tobacco in the NC economy and the ramifications to the states economy by tighter regulation of tobacco.  The countless references to the movie Bright Leaves are out of place  So what if Gary Cooper played Mr.  McElwees great grandfather?  Does the viewer gain any understanding of the role of tobacco in the North Carolina economy by the showing of old film clips of a fictionalized film?  I did not.",
		"Lets enter the world of this movie for a second, so you can better understand the type of movie we are dealing with here.Edison is one of those really stupid movies where the bad guy and his goons have been letting loose 50,000 bullets shooting at the good guy behind walls and pillars, shouting at them, and then finally get to the good guy face to face and instead of killing him......instead of wasting this guy that has caused you SO MUCH grief....instead of just walking up and POP!..... What do you do?  The bad guy.....he talks to him.  He grabs the good guy and talks to him while holding his gun.  THEY HAVE NOTHING TO TALK ABOUT!  SHOOT HIM!  SHOOT HIM NOW!  But he talks to him anyway.  Oh another thing.  At the end, a newspaper says PULITZER PRIZE WINNER STORY RIGHT HERE or something right above on a front page of a paper, when its like the first time the story is printed.  So how in the heezy did someone win a Pulitzer for it that fast?  Yea, you know those types of stupid movies?  Yea well that is Edison in a nutshell.You get Mr cool Morgan Freeman and shifty eyed tough Kevin Spacey who both phone in their roles completely, LL Cool J who scowls literally every single moment of the movie,while proposing to his girlfriend in a damn night club of all places,and who is last line Duck was something from like a lethal weapon movie that was never made... and Justin Timberlake whining and spewing nonsense every time he talks, little cocky bastard.The only bright spot was a crazy Dylan McDermott doing his best Denzel from Training Day impression, which was pretty entertaining.Oh yea so whats the movie about?  Eh, something about scandals involving the city Edisons fictional special unit police force called F.R.A.T.  I swear I S.W.A.T. Anyway little journalistic super singer boy Justin Timberflake smells something foul afoot after a murder involving 2 undercover cops from FRAT, and he goes scurrying off looking for a story, gaining his boss Freeman trust along the way while they both unravel something even bigger and sinister than what they both thought. blah blah blah.  Its like a bootleg pelican brief meets a halfassed training day.The pacing was slow and off, the script was horrible, and the acting was extremely uninspired.  It jumped everywhere without going anywhere.  People get put in comas and you forget about them.  Everyone in this movie just did not THINK.  Damn what a stupid movie.  Its becoming harder to write any sort of review for it because the movie left my brain the second it ended...No lie Basically, do NOT waste your time!",
		"I work character J. Fox  1 we simply do not walk around with our pockets bursting with theater tickets and 100 bills!  2 If I ever let anybody use a room for some afternoon delight time I would be fired on the spot!  The organization to which I belong Les Clefs dOr has very definite standards of ethics and conduct that we take seriously. 3 Similarly untrue was the concept, at the end of the movie, of Doug simply removing his gold key emblem and passing it on to some other employee we earn those keys and it is a badge of honor and knowledge to be allowed to wear them.  There is a whole application and vetting process to joining our organization.This film does nothing to dispel the unfortunate perception of a concierge as nothing but a money grubbing mercenary.  In short it does a disservice to our organization.  I welcome any comments.",
		"The head of a common New York family, Jane Gail as Mary Barton, works with her younger sister Ethel Grandin as Loma Barton at Smyrners Candy Store.  After Ms.  Grandin is abducted Ms. Gail and her policeman boyfriend Matt Moore as Larry Burke must rescue the virtuethreatened young woman.Traffic in Souls has a reputation that is difficult to support  it is not remarkably well done, and it does not show anything very unique in having a young womans virtue threatened by sex traders.  Perhaps, it can be supported as a film which dealt with the topic in a greater than customary length claimed to have been ten reels, originally.  The New York City location scenes are the main attraction, after all these years.  The panning of the prisoners behind bars is memorable, because nothing else seems able to make the cameras move.   Traffic in Souls 112413 George Loane Tucker  Jane Gail, Matt Moore, Ethel Grandin",
		"As an impressionable 10 year old, I liked the love conquers all philosophy of the 70s sitcom Bridget Loves Bernie.  I did controversy J. Stone and Bibi Osterwald as Bernies parents; Audra Lindley and David Doyle as Bridgets parents who have issues with the young couples interfaith marriage.Looking at the show now with years of personal life experiences, I am amazed that the show was even a success for one, albeit, highlyrated season.  Created by veteran TV writer Bernard Slade, who a few years after the show is cancellation would write the successful play Same Time, Next Year, Bridget Loves Bernie was a very light, superficial comedy that collapsed under its own airy weight.There was no denying the reallife chemistry between Birney and Baxter.  But, in later years, both actors have shown that they are better actors in other projects Birney in his shortlived role in St.  Elsewhere and Baxter in Family and Family Ties.  Here, they were trying to breathe life in a show that needed a much gritter comic edge, which might have given the complications more depth to a very controversial subject.The show aired Saturday nights between two CBS powerhouses All in the Family and Mary Tyler Moore.  Both of those shows were smart, funny and had enough of an edge more so on the former that the latter that kept my interest in the situation and the characters.  Bridget Loves Bernie was not very smart and only had some occasional chuckles.This was another example of a show that really was not as good as I remembered.",
		"By 1941 Columbia was a fullfledged major studio and could produce a movie with the same technical polish as MGM, Paramount or Warners.  That is the best thing that could be said about Adam Had Four Sons, a leaden soap opera with almost terminally bland performances by Ingrid Bergman topbilled for the first time in an American film and Warner Baxter.  Bergman plays Frenchwoman I. Just about everyone in the movie is so goodygood it is a relief when Susan Hayward as the villainess enters midway through  she is about the only watchable person in the movie even though she is clearly channeling Bette Davis and Vivien Leigh; it is also the first in her long succession of alcoholic roles  but the script remains saccharine and the ending is utterly preposterous.  No wonder Bergman turned down the similarly plotted The Valley of Decision four years later.",
		"Okay, you havePenelope Keith as Miss HerringboneTweed, B.B.E.  Backbone of England.  She is killed off in the first scene  that is right, folks; this show has no backbone! Peter OToole as Ol Colonel Cricket from The First War and now the emblazered Lord of the Manor.Joanna Lumley as the ensweatered Lady of the Manor, 20 years younger than the colonel and 20 years past her own prime but still glamourous Brit spelling, not mine enough to have a toyboy on the side.  It is they Col. Crickets full knowledge and consent they guy even comes round for Christmas!  Still, she is considerate of the colonel enough to have said toyboy her own age what a gal! David McCallum as said toyboy, equally as pointlessly glamourous as his squeeze.  Pilcher could not come up with any cover for him within the story, so she gave him a hushhush job at the Circus.and finallySusan Hampshire as Miss Polonia Teacups, Venerable Headmistress of the Venerable Girls BoardingSchool, serving tea in her office with a dash of deep, poignant advice for life in the outside world just before graduation.  Her best bit of advice I have only been to Nancherrow the local Stately Home of England once.  I thought it was very beautiful but, somehow, not part of the real world.  Well, we cannot say they did not warn us.Ah, Susan  time was, your character would have been running the whole show.  They do not write em like that any more.  Our loss, not yours.So  with a cast and setting like this, you have the remakings of Brideshead Revisited, right? Wrong!  They took these 1dimensional supporting roles because they paid so well.  After all, acting is one of the oldest tempjobs there is YOU name another! First warning sign lots and lots of backlighting.  They get around it by shooting outdoors  hey, it is just the sunlight! Second warning sign Leading Lady cries a lot.  When not crying, her eyes are moist.  That is the law of romance novels Leading Lady is dewyeyed.Henceforth, Leading Lady shall be known as L.L.Third warning sign L.L. actually has stars in her eyes when she is in love.  Still, I will give Emily Mortimer an award just for having to act with that spotlight in her eyes I wonder . did they use contacts? And lastly, fourth warning sign no onscreen female character is Mrs.  She is either Miss or Lady.When all was said and done, I still could not tell you who was pursuing whom and why.  I could not even tell you what was said and done.To sum up they all live through World War II without anything happening to them at all.OK, at the end, L.L. finds she is lost her parents to the Japanese prison camps and baby sis comes home catatonic.  Meanwhile there is always a meanwhile, some young guy L.L. had a crush on when, I do not know comes home from some wartime tough spot and is found living on the street by Lady of the Manor must be some street if She is going to find him there.  Both war casualties are whisked away to recover at Nancherrow SOMEBODY has to be whisked away SOMEWHERE in these romance stories! Great drama.",
		"this film is in the MANDINGO  DRUM typethey were both dreadful BUT they are 100 better than this tripe,Badly acted  made Oliver Reed is the main name  Eartha Kitt also is in it.  Tis a pity.  Rating is yu harris",
		"Firstly, I am not easily scared by...  Anything except for my few phobias, but this movie is absolutely horrific.  This is not appropriate for children at all!  I had mouth I. Could not believe how gory it was for a childrens movie, bunnies being brutally murdered!  It is just unnecessary to be so horrifying and be rated G.  I recommend being over 8 to see this.  But do not get me wrong, it was probably a good movie if I was not scarred mentally as a child.  I cannot believe a parent would allow a, let us say, 4 year old child to watch this.  It is just to intense and complicated, not to forget gory, for young kids.  I am wayy over 4 and I was shocked by the violence.  I do not recommend"
	]
}