{
	"augmented_text": [
		"Airport 77 starts as a brand new luxury 747 plane is loaded up with valuable paintings  such belonging to rich businessman Philip Stevens James Stewart who is flying them  a bunch of VIPs to his estate in preparation of it being opened to the public as a museum, also on board is Stevens daughter Julie Kathleen Quinlan  her son.  it sinks bang in middle of Bermuda Triangle it crashing bang in middle of Bermuda Triangle it crashing bang in middle of Bermuda Triangle it crashing bang in middle of Bermuda Triangle it crashing bang in middle of Bermuda Triangle it crashing bang in middle of Bermuda Triangle With air in short supply, water leaking in  having flown over 200 miles off course the problems mount for the survivors as they await help with time fast running out...Also known under the slightly different tile Airport 1977 this second sequel to the smashhit disaster thriller Airport 1970 was directed by Jerry Jameson  while once again like it is predecessors I cannot say Airport 77 is any sort of forgotten classic it is entertaining although not necessarily for the right reasons.  Out of the three Airport films I have seen so far I actually liked this one the best, just.  It has my favourite plot of the three with a nice midair hijacking  then the crashing did not he see the oil rig?   sinking of the 747 maybe the makers were trying to cross the original Airport with another popular disaster flick of the period The Poseidon Adventure 1972  submerged is where it stays until the end with a stark dilemma facing those trapped inside, either suffocate when the air runs out or drown as the 747 floods or if any of the doors are opened  it is a decent idea that could have made for a great little disaster flick but bad unsympathetic characters, dull dialogue, lethargic setpieces  a real lack of danger or suspense or tension means this is a missed opportunity.  While the rather sluggish plot keeps one entertained for 108 odd minutes not that much happens after the plane sinks  there is not as much urgency as I thought there should have been.  Even when the Navy become involved things do not pick up that much with a few shots of huge ships  helicopters flying about but there is just something lacking here.  George Kennedy as the jinxed airline worker Joe Patroni is back but only gets a couple of scenes  barely even says anything preferring to just look worried in the background.The home video  theatrical version of Airport 77 run 108 minutes while the US TV versions add an extra hour of footage including a new opening credits sequence, many more scenes with George Kennedy as Patroni, flashbacks to flesh out characters, longer rescue scenes  the discovery or another couple of dead bodies including the navigator.  While I would like to see this extra footage I am not sure I could sit through a near three hour cut of Airport 77.  As expected the film has dated badly with horrible fashions  interior design choices, I will say no more other than the toy plane model effects are not great either.  Along with the other two Airport sequels this takes pride of place in the Razzie Awards Hall of Shame although I can think of lots of worse films than this so I reckon that is a little harsh.  The action scenes are a little dull unfortunately, the pace is slow  not much excitement or tension is generated which is a shame as I reckon this could have been a pretty good film if made properly.The production values are alright if nothing spectacular.  The acting is not great, two time Oscar winner Jack Lemmon has said since it was a mistake to star in this, one time Oscar winner James Stewart looks old  frail, also one time Oscar winner Lee Grant looks drunk while Sir Christopher Lee is given little to do  there are plenty of other familiar faces to look out for too.Airport 77 is the most disaster orientated of the three Airport films so far  I liked the ideas behind it even if they were a bit silly, the production  bland direction does not help though  a film about a sunken plane just should not be this boring or lethargic.  Followed by The Concorde ...  Airport 79 1979.",
		"When I was little my parents took me along to the theater to see Interiors.  It was one of many movies I watched with my parents, but this was the only one we walked out of.  Since then I had never seen Interiors until just recently, and I could have lived out the rest of my life without it.  What a pretentious, ponderous, and painfully boring piece of 70s wine and cheese tripe.  Interiors is piece of crap of his career Interiors is piece of crap of his career In the unmistakable style of Ingmar Berman, Allen gives us a dark, angular, muted, insight in to the lives of a family wrought by the psychological damage caused by divorce, estrangement, career, love, nonlove, halitosis, whatever.  The film, intentionally, has no comic relief, no music, and is drenched in shadowy pathos.  This film style can be best defined as expressionist in nature, using an improvisational method of dialogue to illicit a more pronounced depth of meaning and truth.  But Woody Allen is no Ingmar Bergman.  The film is painfully slow and dull.  But beyond that, I simply had no connection with or sympathy for any of the characters.  Instead I felt only contempt for this parade of shuffling, whining, nicotine stained, martyrs in a perpetual quest for identity.  Amid a backdrop of cosmopolitan affluence and baked Brie intelligentsia the story looms like a fart in the room.  Everyone speaks in affected platitudes and elevated language between cigarettes.  Everyone is lost and struggling, desperate to find direction or understanding or whatever and it just goes on and on to the point where you just want to slap all of them.  It is never about resolution, it is only about interminable introspective babble.  It is nothing more than a psychological drama taken to an extreme beyond the audiences ability to connect.  Woody Allen chose to make characters so immersed in themselves we feel left out.  And for that reason I found this movie painfully self indulgent and spiritually draining.  I see what he was going for but his insistence on promoting his message through Prozac prose and distorted film techniques jettisons it past the point of relevance.  I highly recommend this one if you are feeling a little too happy and need something to remind you of death.  Otherwise, let us just pretend this film never happened.",
		"When I was little my parents took me along to the theater to see Interiors.  It was one of many movies I watched with my parents, but this was the only one we walked out of.  Since then I had never seen Interiors until just recently, and I could have lived out the rest of my life without it.  What a pretentious, ponderous, and painfully boring piece of 70s wine and cheese tripe.  Woody Allen is one of my favorite directors but Interiors is by far the worst piece of crap of his career.  In the unmistakable style of Ingmar Berman, Allen gives us a dark, angular, muted, insight in to the lives of a family wrought by the psychological damage caused by divorce, estrangement, career, love, nonlove, halitosis, whatever.  The film, intentionally, has no comic relief, no music, and is drenched in shadowy pathos.  This film style can be best defined as expressionist in nature, using an improvisational method of dialogue to illicit a more pronounced depth of meaning and truth.  But Woody Allen is no Ingmar Bergman.  The film is painfully slow and dull.  But beyond that, I simply had no connection with or sympathy for any of the characters.  Instead I felt only contempt for this parade of shuffling, whining, nicotine stained, martyrs in a perpetual quest for identity.  Amid a backdrop of cosmopolitan affluence and baked Brie intelligentsia the story looms like a fart in the room.  Everyone speaks in affected platitudes and elevated language between cigarettes.  Everyone is lost and struggling, desperate to find direction or understanding or whatever and it just goes on and on to the point where you just want to slap all of them.  It is never about resolution, it is only about interminable introspective babble.  It is nothing more than a psychological drama taken to an extreme beyond the audiences ability to connect.  Woody Allen chose to make characters so immersed in themselves we feel left out.  And for that reason I found this movie painfully self indulgent and spiritually draining.  he was insistence on his through film techniques I see insistence on his through film techniques I highly recommend this one if you are feeling a little too happy and need something to remind you of death.  Otherwise, let us just pretend this film never happened.",
		"The film is bad.  There is no other way to say it.  The story is weak and outdated, especially for this country.  I do not think most people know what a walker is or will really care.  I felt as if I was watching a movie from the 70s.  The subject was just not believable for the year 2007, even being set in DC.  I think this rang true for everyone else who watched it too as the applause were low and quick at the end.  Most did not stay for the QA either.I do not think Schrader really thought the film out ahead of time.  Many of the scenes seemed to be cut short as if they were never finished or he just did not know how to finish them.  He jumped from one scene to the next and you had to try and figure out or guess what was going on.  I really did not get Woodys Carter private life or boyfriend either.  What were all the artistic male bondage and torture pictures from Iraq prisons about?  What was he thinking?  it was attempt at subculture for character Car I think attempt at subculture for character Car It did not work.  It did not even seem to make sense really.The only good thing about this film was Woody Harrelson.  He played his character Car flawlessly.  You really did get a great sense of what a walker may have been like say twenty years ago.  He was great and most likely will never get recognized for it.  As for Lauren, Lily and Kristin...  Boring.Do not see it!  It is painful!  Unless you are a true Harrelson fan.",
		"Hollow appears place in kid in traffic ticket It opens with a young female auto fanatic getting the business from her arch rival, who pressures her into a car race.  That is about it for the dragracingthis Bflick is mostly concerned with rock n roll, man!  The folks at American International were obviously fond of decent, square teens who liked to party and yet did not mind an adult chaperone.  There are a few amusing double entendres and fruity exchanges Necking Kid We thought we would come out for some fresh air...Dad Where did you think you would find it, down her throat? , but the ghost is a little late in arriving.  Brief at 65 minutes, the movie cheats us with a climactic car race that actually takes place offscreen and a preScooby Doostyled unmasking which makes no sense.  However, for nostalgia buffs, some mindless fun.   from ",
		"Summer season is here when the choices in the cinemas are limited to what is the hottest movie of the week, given 99.9 of the screens dedicated to screening it.  OK, so I may exaggerate on the percentage, but you get my drift.  Besides stuff from Hollywood, Bollywood too have their own share of highly anticipated blockbusters, and from some of the trailers shown, I am hyped to watch them too.  Tashan was billed as one of THE most highly anticipated for 2008, but I was quite surprised at the lower than low turnout at the cinemas.  When I watched Jodha Akbar, it was a full house, but it was not for Tashan.After watching it, I knew why.  It was entertaining, but it was fundamentally weak.  Just like it is literal English title, which means Style, Tashan is all style, but little substance.  Not that it does not have the usual star power, but scenes felt forced, and some bordered on a tad ridiculous, even for Bollywood standards I must say.  Which is quite surprising given that Tashan is directed and written by Vijay Krishna Acharya, who wrote Dhoom and Dhoom 2, both of which I enjoyed tremendously.  In his rookie directorial outing with Tashan, while you cannot fault his direction, you would probably scratch your head over the plot, which was clunky at best.  It tried to force too many things into the story, though credit be given where it allowed you some avenue to question character motivation, but that came a little too late, and only toward the finale, which left you guessing for just a moment before it latched into full blown action mimicking many a Thai action movie, with Hong Kongs wirework and Hollywoods ludicrous firearms and gunplay with zero recoil.  And in a bid to include everything including the kitchen sink, you have an assortment of vehicles appearing, and the one that took the cake, in a Dhoom 2 homage, was the jetski boat in the middle of nowhere.At best, Tashan can be enjoyed as unintentional comedy, and this is attributed to how the cast hammed up with their characters.  Khan plays platform for fishing out girlfriend material His playboy ways gets junked aside when he meets with Pooja Singh Kareena Kapoor, who is not exactly who she seems, the meek and sweet natured hottie.  She engages Jimmys services for her boss, mobster Bhaiyyaji Anil Kapoor, who probably gets most of the laughs as he speaks broken English and phrases must like how an ahbeng does it.  And to complete the quartet, Akshay Kumar plays Bachchan Pandey, an illiterate gangster for hire who got engaged by Bhaiyyaji to hunt down Jimmy and Pooja when they escape with money stolen from Bahiyyajis business.So begins a road trip of sorts, with friends who turned enemies, and enemies whom you know will become friends as the road trip wears on.  Jimmy Cliff is probably the most implausible of all, because he goes from zero to hero, executing moves that would shame Rambo, in absolutely no time, which is quite out of character.  Kareena Kapoor amps up the sex factor as she uses her charms to guile both men, and has plenty of opportunity to do so given the much touted bikini scenes, and other costumes that boast of plunging necklines or hemlines way above the knee.  Every character has a backstory created, and I thought Akshay Kumars Bachchan Pandey was probably the best, the most touching and the most fun of the lot, even though his character seemed a lot like a nongreen Incredible Hulk with his gravitydefying leaps and power packing punches.  His wounds also heal automatically, which impressively puts Wolverine to shame.  And the best part is his theme song, which is damn alphamale and played in rara mode each time he takes on adversaries.But sad to say, that is the only tune that is memorable, something that cheers Bachchan PandeyBachchanPandey.  For most Bollywood movies I watch, I will usually be able to, despite the obvious language gaps, emerge from screenings humming a tune or two.  I was not able to do that after Tashan, because the songs unfortunately just were not catchy at all.  Usually the songdance routine works well into the storyline without any necessity to bring the characters out of the current scene or location.  That I enjoy, versus plucking them out and plonking them into extreme settings high atop a mountain, or atop jagged rocks on the beach front.Tashan probably did not take itself too seriously, but coming from Vijay Krishna Acharyas story, you probably wanted something a little more decent rather than the ridiculous, and for continuity to be a little more careful as well.  Billed as a blockbuster, now I can start to understand why the crowds have already shunned this one.  Despite Akshay Kumr stealing the show, Tashan could have been better on the whole.",
		"If this is a 2008 product from one of the biggest production houses of Indian Film Industry Yash Raj then I am afraid it is a very long ahead for us to reach the right standards.If you can go wrong to this length with such an enormous star cast of Anil, Akshay, Saif and Kareena, then movie making is still to be studied much harder by everyone associated with this film.  The film lacks in almost all departments except cinematography and Akshay Kumar.  He has a few good dialogues to render but that alone cannot make you enjoy a flick with huge expectations.The first scene of a car going down into a river from the mountain has very cheap graphics like that of a cartoon film.  That itself was a clear indicator of the directors vision.  Every actor who otherwise is an asset to a movie is simply wasted.  Anil Kapoors gimmick of attempting good English falls flat most of the times.  And Saif will surely hit himself thinking why he signed this movie.In short It is THE BIGGEST WASTE OF RESOURSES AFTER JHOOM BARABAR JHOOM.  I would say that even Aaja Nachle was a better enjoyable movie than this.One cannot understand how and why this kind of script was written and approved.  The most unwanted was the flashback sequence of Akshays love story.  After the faulty script the weakest point of the movie is its music.  Vishal Shekhar have given just some filler tunes to each song.  The songs start off very well and suddenly the tunes drop drastically.  Only one song Falak Tak Chal is somehow good of all in the lot.  An opportunity wasted by Vishal Shekhar.Regarding the continuity intelligence of the makers just sample this  Akshay and Saif are on the road in the hilly area of a foreign Location probably Ladakh.  they are Kareena in dicky of their car I am still thinking who wrote this.If you manage to sit till the last then the climax is too long with silly and unnecessary stunts.  You can see all the heroes walking through the storm of bullets not hurt as if they are GOD.  Are we still seeing a 2008 movie with all these technical heights achieved?  So no more words on this pathetic and downgrade movie but a sincere request to senior actors from their fan.Dear Anil Kapoor  Akshay Kumar, If possible please ask for a preview of your movies after their first copy is out.  As artists of such stature, you have certain responsibilities towards your fans and viewers.  People still clap for you as you enter the screen in your first scenes respectively.  I think this kind of movie should not see the daylight as it hampers the reputation of all associated with the movie, the actors and the production house both.",
		"I had no idea what the film is about before I saw it because Tashan only had teaser trailers while it was being promoted.  Ibrahim makes him as child in his flashback.After Ibrahim makes him as child in his flashback.After they said him as child in his flashback.After they said him as child in his flashback.After The story was extremely dum and even a 10 year old child can come up with a better storyline.  There was hardly any action and the camera shook at every possible angle there is and it is difficult to figure out that who is killing who.  Also the action was daft  unrealistic e.g. 1 man with a handgun managed to kill about 100 men with machine guns.While I was watching Tashan it reminded me of 3 filmsSin City During the opening credits.Koyla Anil Kapoors terrible English like Amrish Puri in Koyla.Jhoom Barabar Jhoom The outrageously ridiculous jokes that are not even a jot funny.I also heard the budget is 40 crores which is the same amount as Dhoom 2 and I do not know where all the money went to.  Anyway if you did not like Dhoom 2 then there is absolutely no chance that you will like Tashan.  Race was hot on heels and that is a million times better.The only 2 good songs are Dil Haara  Challiya and both songs are shot in Greece at good locations but what is the use of it in a rubbish film?  Even Anil Kapoors terrible English could not save this discomfiture.",
		"I had no idea what the film is about before I saw it because Tashan only had teaser trailers while it was being promoted.  So I asked my friends if they knew anything about it and they said that It is the directorial debut of Vijay Krishna Acharya who wrote the screenplays for Dhoom 1  2 and Saif Ali Khans son Ibrahim makes his debut in the film by playing him as a child in his flashback.After watching it, I understood that why their was not a proper trailer because there was not anything in the film to show.  The story was extremely dum and even a 10 year old child can come up with a better storyline.  There was hardly any action and the camera shook at every possible angle there is and it is difficult to figure out that who is killing who.  it reminded me of City like jot funny.I I was me of City like jot funny.I I was me of City like jot funny.I I was me of City like jot funny.I I was me of City like jot funny.I Anyway if you did not like Dhoom 2 then there is absolutely no chance that you will like Tashan.  Race was hot on heels and that is a million times better.The only 2 good songs are Dil Haara  Challiya and both songs are shot in Greece at good locations but what is the use of it in a rubbish film?  Even Anil Kapoors terrible English could not save this discomfiture.",
		"The sight of Kareena Kapoor in a twopiece bikini is about the only thing that wakes you up from your sleep while watching Tashan  the megadisappointing, mindnumbing new film at the cinemas this weekend.  Bad films are bad films and we see some every week, but Tashan is not just a bad film, it is a terrible film.  Terrible because it takes its audience for granted, terrible also because the filmmakers expect to get away without a plot or any common sense only because they have got big movie stars onboard.Written and directed by Vijay Krishna Acharya, Tashan is what you would describe as a road movie, but one that is going in all the wrong directions.  Saif Ali Khan stars as Jimmy Cliff, a callcentre executive who is hired to teach English to Bhaiyyaji  that is Anil Kapoor playing an ambitious UP gangster, desperate to go cool.  Jimmys got eye on Pooja by crore rupees Determined to recover his money and also to punish both Jimmy and Pooja, Bhaiyyaji recruits his most trusted henchman to do the job.  So you have Akshay Kumar as Bachchan Pandey, the gangsters faithful aide from Kanpur, who tracks down the culprits and recovers the stolen money that is hidden across the length and breadth of the country.Much like those bad eighties potboilers, Tashan too is held together by a threadbare script centred on a vendetta plot.  But the treatments so overthetop, so indulgent that it fails to establish any connect.  Instead of a coherent screenplay or a traditional threeact structure, you get a handful of set pieces around which most of the scenes are loosely constructed.  That garish item song in the desert, the bulletdodging action scene at a Rajasthani fort, Kareeenas bikini moment, even that ridiculous climatic action scene complete with shaolin monks, a water scooter zipping through a dirty naala, and believe it or not, even a Dhannostyle horsedriven tonga.  In all fairness, not all these set pieces are badly done  the item song in the desert is quite neat actually  but very little of it makes any sense in the larger picture, because you are just going from one piece to another without any help from the script really.  Little do you expect in a seemingly fastpaced road movie, to find a sickeningly sentimental flashback track about childhood sweethearts.You see the problem with Tashan is nobody associated with this film knew what film they were making.  What is more, I do not think they cared either  the film reeks of arrogance.  Arbitrarily packing in elements of every genre without actually bothering to stop and see if the mix does work, Tashan is like an overcooked stew.There are films that kill you softly, and then there is Tashan, a film that kills you with excess.  Packaged snazzily with glossyfinish camerawork, exotic locations and fancy costumes, every frame of the film probably cost lakhs to put together, but it still feels like a hollow piece in the end because the story does not hold.  Borrowing narrative from Tarantino and style from Stephen Chow does not help either because they do not blend with the films waferthin plot.  One may have complained a little less if the characters were more engaging, but Anil Kapoors grating Hinglish dialogue makes you want to slit your wrists, and Saif Ali Khan fumbles through the film foolishly, unable to find his feet.  Kareena Kapoor, meanwhile, queen of overthetop delivery, does a decent job.  But of course, if Tashan is salvaged to some extent, it is thanks to Akshay Kumars irresistible presence and his spontaneous approach to the character.  You cringe when he is cupping his crotch repeatedly, and you scowl when he delivers those doublemeaning dialogues, but not for a moment can you take your eyes off the screen when he is up there.Despite some good music from VishalShekhar, the songs seem like they are only prolonging your misery.  Well that is because Tashan is a test of your patience.  In case you did not know, Tashan means style.  I am sorry to say, this film has none.",
		"The sight of Kareena Kapoor in a twopiece bikini is about the only thing that wakes you up from your sleep while watching Tashan  the megadisappointing, mindnumbing new film at the cinemas this weekend.  Bad films are bad films and we see some every week, but Tashan is not just a bad film, it is a terrible film.  Terrible because it takes its audience for granted, terrible also because the filmmakers expect to get away without a plot or any common sense only because they have got big movie stars onboard.Written and directed by Vijay Krishna Acharya, Tashan is what you would describe as a road movie, but one that is going in all the wrong directions.  Saif Ali Khan stars as Jimmy Cliff, a callcentre executive who is hired to teach English to Bhaiyyaji  that is Anil Kapoor playing an ambitious UP gangster, desperate to go cool.  Jimmys got his eye on Pooja, the gangsters pretty young assistant played by Kareena Kapoor, who uses Jimmy to swindle her boss of 25 crore rupees.  Determined to recover his money and also to punish both Jimmy and Pooja, Bhaiyyaji recruits his most trusted henchman to do the job.  you have aide from Kanpur like eighties potboilers But the treatments so overthetop, so indulgent that it fails to establish any connect.  Instead of a coherent screenplay or a traditional threeact structure, you get a handful of set pieces around which most of the scenes are loosely constructed.  That garish item song in the desert, the bulletdodging action scene at a Rajasthani fort, Kareeenas bikini moment, even that ridiculous climatic action scene complete with shaolin monks, a water scooter zipping through a dirty naala, and believe it or not, even a Dhannostyle horsedriven tonga.  In all fairness, not all these set pieces are badly done  the item song in the desert is quite neat actually  but very little of it makes any sense in the larger picture, because you are just going from one piece to another without any help from the script really.  Little do you expect in a seemingly fastpaced road movie, to find a sickeningly sentimental flashback track about childhood sweethearts.You see the problem with Tashan is nobody associated with this film knew what film they were making.  What is more, I do not think they cared either  the film reeks of arrogance.  Arbitrarily packing in elements of every genre without actually bothering to stop and see if the mix does work, Tashan is like an overcooked stew.There are films that kill you softly, and then there is Tashan, a film that kills you with excess.  Packaged snazzily with glossyfinish camerawork, exotic locations and fancy costumes, every frame of the film probably cost lakhs to put together, but it still feels like a hollow piece in the end because the story does not hold.  Borrowing narrative from Tarantino and style from Stephen Chow does not help either because they do not blend with the films waferthin plot.  One may have complained a little less if the characters were more engaging, but Anil Kapoors grating Hinglish dialogue makes you want to slit your wrists, and Saif Ali Khan fumbles through the film foolishly, unable to find his feet.  Kareena Kapoor, meanwhile, queen of overthetop delivery, does a decent job.  But of course, if Tashan is salvaged to some extent, it is thanks to Akshay Kumars irresistible presence and his spontaneous approach to the character.  You cringe when he is cupping his crotch repeatedly, and you scowl when he delivers those doublemeaning dialogues, but not for a moment can you take your eyes off the screen when he is up there.Despite some good music from VishalShekhar, the songs seem like they are only prolonging your misery.  Well that is because Tashan is a test of your patience.  In case you did not know, Tashan means style.  I am sorry to say, this film has none.",
		"This is the biggest Flop of 2008.  I don know what Director has is his mind of creating such a big disaster.  The songs have been added without situations, the story have been stretched to fill the 3 hrs gap and most disgusting are the action stunts performed by the actors it is like everyone are having superpowers they can run in between the bullets are fire and nothing happens to them and one person fighting with 100 people.  he is time at his with speaking Hinglish Akki is also done a good job....  But the movieee just forget it.",
		"Masters of Horror The Screwfly Solution starts as America is being infected by an airborne virus that affects the male population, when aroused men indiscriminately kill any woman in sight apparently in the name of God.  Scientist Alan Jasn Priestley is brought in by the Government  knows more than most  senses the situation may have gone too far already so he tells his wife Anne Kerry Norton to take their teenage daughter Amy Brenna OBrien  try to survive as the future of the human race may depend on them...This Canadian American coproduction was episode 7 from season 2 of the Masters of Horrror TV series, directed by Joe Dante I thought The Screwfly Solution was pretty bad.  it is part of Masters of Horror series I do part of Masters of Horror series it takes part of Masters of Horror series I was not happy with the inconsistencies with the story either, if men only kill when sexually aroused why does the flight attendant casually break that womans neck on the plane?  Was he sexually aroused, I think not.  Why does every bloke then think he is killing in the name of God?  I just cannot see every single bloke on Earth suddenly knowing the Bible  starting to believe in God, I just found the notion ridiculous  the show also states clearly that there is nothing religious about what is going on so what is the deal with everyone thinking they have a divine to murder any woman they see?  Then there is the fact people get turned on by different things, what about gays for instance?  Will they kill guys instead of women?  I know there is a brief scene which makes a joke out of the gay issue but it is conveniently brushed to one side  then there is the thing which annoyed me the most.  The fact that presumably every bloke on earth has turned psycho  killed all the women they go about their everyday business like nothing ever happened, it just felt so stupid, the plotting is rubbish  to round things off there is a ending which looks like it was taken from a rejected episode of The XFiles 1993  2002 with a bright neon alien.Director Dante on this showing definitely does not qualify as a Master of Horror as far a I am concerned, the story is badly paced, it is just so stupid considering it is played deadly straight  instead of trying to make a proper horror show he turns in more of a thriller with it is deadly virus on the loose situation  the subsequent mother  daughter on the run because of it, there is very little here in the way of what I would call effective horror  even less gore.  There is a scene when a woman is stabbed with a broken bottle, a brief scene after when a guy stabs his own groin with said bottle  another woman is stabbed in the stomach but nothing else to write home about.Technically like the other episodes it is really good  it does not have the look of a cheap TV series, the special effects are great as usual  it is well made.  The acting is alright but noone really stood out.The Screwfly Solution is easily the worst Masters of Horror episode I have seen but bear in mind I have not seen all of them... yet.  As a stand alone piece of entertainment it did nothing for me  as a show made by a socalled Master of Horror it disappoints me even more.",
		"Masters of Horror The Screwfly Solution starts as America is being infected by an airborne virus that affects the male population, when aroused men indiscriminately kill any woman in sight apparently in the name of God.  Scientist Alan Jasn Priestley is brought in by the Government  knows more than most  senses the situation may have gone too far already so he tells his wife Anne Kerry Norton to take their teenage daughter Amy Brenna OBrien  try to survive as the future of the human race may depend on them...This Canadian American coproduction was episode 7 from season 2 of the Masters of Horrror TV series, directed by Joe Dante I thought The Screwfly Solution was pretty bad.  I personally think the script by Sam Hamm sucks, it takes itself far too seriously  I do not really understand why it is part of the Masters of Horror series, the horror that the filmmakers are going for in The Screwfly Solution is in the actual story itself  themes  ideas it brings up rather than on screen visual horror particularly the tenuous ecological message it sees intent on ramming down our throats whenever it is gets the chance during it is short 60 odd minute running time which I felt itself was a problem as the thing just finishes out of what could easily be interpreted as necessity rather than any meaningful attempt to wrap things up.  I was not happy with the inconsistencies with the story either, if men only kill when sexually aroused why does the flight attendant casually break that womans neck on the plane?  Was he sexually aroused, I think not.  Why does every bloke then think he is killing in the name of God?  I just cannot see every single bloke on Earth suddenly knowing the Bible  starting to believe in God, I just found the notion ridiculous  the show also states clearly that there is nothing religious about what is going on so what is the deal with everyone thinking they have a divine to murder any woman they see?  Then there is the fact people get turned on by different things, what about gays for instance?  Will they kill guys instead of women?  I know there is a brief scene which makes a joke out of the gay issue but it is conveniently brushed to one side  then there is the thing which annoyed me the most.  The fact that presumably every bloke on earth has turned psycho  killed all the women they go about their everyday business like nothing ever happened, it just felt so stupid, the plotting is rubbish  to round things off there is a ending which looks like it was taken from a rejected episode of The XFiles 1993  2002 with a bright neon alien.Director Dante on this showing definitely does not qualify as a Master of Horror as far a I am concerned, the story is badly paced, it is just so stupid considering it is played deadly straight  instead of trying to make a proper horror show he turns in more of a thriller with it is deadly virus on the loose situation  the subsequent mother  daughter on the run because of it, there is very little here in the way of what I would call effective horror  even less gore.  woman is about.Technically like it of TV series woman is about.Technically like it of TV series woman is about.Technically like it of TV series woman is about.Technically like it of TV series woman is about.Technically like it of TV series woman is about.Technically like it of TV series woman is about.Technically like it of TV series The acting is alright but noone really stood out.The Screwfly Solution is easily the worst Masters of Horror episode I have seen but bear in mind I have not seen all of them... yet.  As a stand alone piece of entertainment it did nothing for me  as a show made by a socalled Master of Horror it disappoints me even more.",
		"Superman II  The Richard Donner Cut should be a fans dream come true.  At long last, footage only seen in photos and scenes that only existed on the printed page would finally come to life.  A director that was unable to complete his vision would have the opportunity to have his vision restored.  It seems like a winning situation.  And then you start watching this assembly of footage and you realize this esoteric dream is a very real nightmare of sloppiness and incompetence.  While it is entirely possible that no movie could compete with the finished perfect version each of us has imagined over the years it really should have been a thrill to finally see this project.  And it is only a very few times.You know things are shaky when the very first bit of text on screen looks like home brew computer graphics.  But then we start seeing new footage alternates from Superman  The Movie for the trial and that first bit of hesitation fades away.  Hey, this is pretty neat!  Things are alright for these few fleeting moments until we see footage from STM intermixed with new effects for this project, and it does not convince at all.  And from this point on, it never ever lets up.  It is probably not right to judge a movie because of bad visual effects, but when this is supposedly the direct follow up to a movie whose tag line was You will Believe A Man Can Fly it is difficult to believe anything shown on screen here.  The best effects in this are from the original productions.Another issue with this recut.  A lot of it just does not make sense.  The only reason any of it really works is because we have all seen the theatrical version of Superman II, a movie that does make sense.  Lesters Superman II fills in the holes of this assembly.  Part of this could be because Donner did not get to complete shooting, the other part could be because the makers of this project were intent on using as little Lester material as possible.  What we end up with is an assembly of footage that makes Superman IV look airtight and coherent.After viewing this, one gets the sense that while Lester was faithful and comfortable using Donner material, Michael Thau and his team were extremely disrespectful towards anything filmed by Lester.  The best scenes in The Donner Cut are the ones lifted relatively intact from the released version of Superman II.  That includes the moon sequence and the diner sequence, not ironically, both were filmed by Donner.  But anything else from that movie filmed by Lester is reedited in such a hasty fashion, that it now makes Lester seem like a ham fisted know nothing.  While Lester honored the Donner material, Lester here is thrown under the bus.So is there anything good in this release?  Well Marlon Brando is in it, and that is neat to see.  In fact watching any of the material shot by Donner is neat since it was all filmed at the same time as Superman  The Movie.  But that only highlights the problems of this release.  Any of the major scenes really just Lois jumping and scenes with Marlon Brando would have been better served as completed scenes in a deleted scenes section.  Instead they are shoe horned into a nonsensical narrative with inferior performances many alternate takes from familiar scenes are used sloppy edits and bad decisions.Watch the opening scene at the Daily Planet.  Why are we looking at Jackie Coopers back as he calls for Lois and Clark?  At the end why do we have Lois walking into her dark apartment only to have that followed by Jackie Cooper walking into a dark bathroom turning the lights on?  I was initially confused by this, because I expected to see Lois.  The entire assembly is filled with questionable choices like this.Battle scenes are a mess too, with no geography between cuts.  It is just random action.  Of course, the major action scenes were shot by Lester and his material is only used as a bridge to the next set of Donner outtakes or alternates.  They should have used more of Lesters footage, but probably had too much pride to admit that.The sloppiness extends to the military missile as well.  As noted elsewhere, the missile shown in The Donner Cut bears the designation XK 10 while we all know it is the XK 101!  A blind man in STM knows that!  The producers of this assembly, who tried so hard to honor the original film, dropped the ball less than five minutes in and that mistake is indicative of the quality of the entire production.  For all the supposed care that was put into this, the final product has an air of shoddiness to it that is inescapable.The entire affair would probably be easier to digest if Warners did not make this a separate release here in the states.  we are disc of scenes with All option It is really only worth one viewing so that we can finally see the legendary cut scenes, but after that initial viewing, I expect that this will be an excellent magnet for dust and little else.  I know after my experience of watching this, I had new respect for Lesters version.  It is by no means perfect, but Lester realized the deficiencies that were in the script that stand out here in bold relief.  He managed to make a movie that has entertained for many years and will continue to do so, while this new recut will most likely only be remembered as a footnote in that films history.",
		"author sets discovery of his in tobacco industry Its not, and he in fact discovers nothing of even mild interest in this absolutely silly and selfindulgent glorified home movie, suitable for screening at the directors drunken family reunions but certainly not for commercial  or even noncommercial release.  A good reminder of why most independent films are not picked up by major studios  because they are boring, irrelevant and of no interest to anyone but the director and hisher immediate circles.  Avoid at all costs!",
		"I figured that it is about time I let this one out.  Pok?mon fans are suffering in America these days.  Why?  Because we rely on Kids WB and 4Kids Entertainment to provide us with our beloved series and movies.  As far as the series goes, they do a pretty good job in bringing the fun and magic of the Japanese versions to television.  So what is their problem when it comes to the movies?  Honestly now, I have seen all three Pok?mon movies in Japanese and I will definitely be seeing the fourth one.  They are excellent movies.  They are all enjoyable and fun to watch.  And, after seeing Pok?mon 2000 in theaters, I cannot help but wonder how these American producers read the Japanese scripts.  The way it appears, it seems that they read and see something that says Insert empty moral here in big bold faced letters.  It definitely appears that way as they used the same wonderful dubbing methods they used on MSB extreme sarcasm there and created this crap.possible spoilers from here onWell, I guess I should first talk about Pikachus Rescue Adventure.  My first gripe with this came with no narration.  I guess they got enough bad comments on the Pok?dex narration that plagued Pikachus Vacation, and, instead of going with a caring, gentle womans voice as appeared in Pikachu no Natsu Yasumi and Pikachu Tankentai, they just cut the narration all together.  This would not have been a problem, except for one thing.  Did anyone really understand why the Exeggcute did not let Togepi go until the end?  Possibly the fans, but I am sure not the parents.  Then, there is the theme song.  I could not help but roll my eyes at this one.  The Japanese theme song was Tankentai wo Tsukurou and was sung by Japanese children.  It was fun and enjoyable.  This one nauseating.  Now, one of my favorite parts of the short was the dancing Kireihana.  Nice music, fun to watch.  That is changed with the Bellossom.  The music sucked for one, but on top of that, they had all the Pok?mon talk during the music, which turned out to be jumpy, annoying, and just unnecessary.  Oh, and then there is the Poliwhirl who thinks he is a Poliwrath.  You would think that guys that work with these characters constantly would at least learn what they are.  Basically, not much could save this little ill fated dub, which is very unfortunate considering its potential.  But, I have not touched on the worst of it yet.You would think that the warning signs would have been apparent to me when I received my issue of Nintendo Power.  For some unfathomable reason, I had been placing some faith in 4Kids and the WB.  My thoughts were well, they screwed up on the first movie, but the second is different as far as the theme goes, so they should do well.  That in mind, I just did not pay attention to the warning signs I encountered in the theaters when the trailers said, You will believe that one person can make all the difference.  With the way they said that at every turn, I was hoping that this would not turn into a moral fest like MSB did at the end of the English version.  Then comes Nintendo Power, in which I see all my fears realized in the words the main feature The Power of One.  At that point, I became a bit more uneasy.  The Power of One?!  Not a good sign.  However, I still kept some of my false faith.  Big mistake.Sitting in the theater, I was literally getting stomach cramps watching another movie which I loved in Japanese being turned into complete and utter junk.  I hear comments that say it was better because the moral was more subtle.  I can see a point in that since they did not pander this thing, repeating it over and over like in MSB.  However, it did more damage than anything else in this movie.  First of all, the legend that was read throughout was changed a bit to read the world turns to Ash.  Ah hah.  So, Ash is the chosen one?  Whatever.  In the Japanese version, the inhabitants of Arshia needed a Pok?mon trainer to carry out their traditional ceremony.  This time, he is the chosen one.  A greater way that this did damage was to Lugia.  Lugia was one of the coolest characters in a Pok?mon movie.... when the movie was ABOUT Lugia.  In this one, Lugia is forced to take a back seat to Ash.  In the scene where they are flying back to the main island, Lugia and Ash are discussing the conditions of Lugias existence, not that Ash is going to make all the difference.  he was lot of kind of nit picking he was lot of kind of nit picking Ash was lot of kind of nit picking Fururas flute song was not nearly as sweet and enjoyable as the Japanese one.  Jirarudans speech to them saying his collection started with a Mew card?  Ugh.  Even worse, Mistys outrage originally concerned the way Moltres and Zapdos were being held.  Why did not you put them in Pok?balls when you caught them?  This is like caging them to be displayed.  Much different from whining about him thinking Pok?mon are things to be collected like stamps.  If there were any real redeeming values in this, they came from Team Rocket.  Some pretty funny lines.  Not really to make me laugh out loud, but more to make me giggle and slightly ease the pains in my stomach.  Well, that was officially the last American Pok?mon movie I am going to see.  I have imported the third one and find it very enjoyable.  I would rather not see another Japanese movie be ruined in the same fashion as the first two.  I will be importing the fourth one as well.  Forget you, Kids WB and 4Kids.  You have forsaken me for the last time.",
		"This is an awful film.  Yea the girls are pretty but its not very good.  The plot having a cowboy get involved with an Indian maiden would be interesting if the sex did not get in the way.  Well, okay it might be interesting, but its not, because its so badly paced and and only partly acted.  I can only imagine what the close ups of the dancing tushes looked like on a big screen, probably more laughable then they do on TV.  I will not even mention the topless knife fight between two women who are tied together and spend the whole thing chest to chest.  Never read about that in the old west This is a film that requires liberal use of fast forward.I like schlock films but this is ridiculous.  There is a reason that I do not go for this sort of films and that they tend not be very good, the plot taking a back seat to breasts.  The original nudie cuties as they are called were originally nudist films or films where there was no touching but as the adult industry began to grow the film makers either tried to be clever or tried to exploit something else in order to put butts in seats.  The clever ones were very few which only left hacks who were of limited talent.  The comedies often came off best with the humor approaching the first grade level, infantile but harmlessly fun.  Ramrodder looks couple of its of Manson family",
		"Roy Rogers stars as Jesse James and his lookalike, gambler man Clint Burns.  George Gabby Hayes is Mr.  Rogerss expal, Sheriff Gabby.  Morgan are lookout for stories about identity impersonation Rogers is charming, as usual; but, there is nothing really elevating this his performance above the ordinary  any potential to deliver a memorable JekyllHyde performance is done in by poor material.  The better pair to watch are Ms.  Storm and Ms.  Paye as the St.  Louis Journal reporters  they are the films highlight.  The songs are fine, though badly synched.   Jesse James at Bay 1941 Joseph Kane  Roy Rogers, George Gabby Hayes, Gale Storm",
		"Unfortunately I made a mistake and I paid 7 Euros at the movie theater to watch this shallow meaningless movie.  My points;Film is based on 2 things;1 Ethnical point of View As it happens on most of the American Films, the writer thinks itself as an expert after learning 2 or 3 things about the Asian culture.  But unfortunately it is not enough.  Knowing kunefe and 2 names of other foods does not make a person understand a culture.  For example shaving is the sign of clean life in Asia but everyone was trying the girl to stop that.  Lebanese people are Christian Ok they got that and their cultural forms and beliefs and approaches are completely different from other Arabic countries.  The main difference between eastern and western culture is we do not make ethnocentrism.  we do people after their about our life Show me 10 girls which had these on their sexual awakening than I will say that I am wrong.I wrote this comment because the producers are promoting the film in the black humor genre.  Please watch Dr.Strangelove and understand the meaning of black humor.  A black humor has to reflect the truth and has to focus the audience to the funny parts of it.  Where is the truth?  Where is the meaning about the movie.",
		"The tenuous connection between this film and the first Grease is established right at the beginning of the film when Didi Conn one of four cast members repeating their roles approaches young Maxwell Caulfield who is a British exchange student.  Although in the previous film Olivia Newton St.  Johns foreign speech pattern is not explained, it is explained here Caulfield is her cousin.  What is Conn still doing in school, I guess she just likes hanging around Rydell High even though now she is a beautician.Caulfields a smart kid, so of course the hood types led by Adrian Zmed have him labeled as a nerd.  And that is especially bad when Zmeds girl friend decides she likes Caulfield.  But being a nerd just is not going to cut it.That is when Caulfield decides to put on a modern day Zorro act.  He gets a junked bicycle and puts it back together and teaches himself to ride.  He gets outfit with set of his face If getting Michelle Pheiffer is not in the cards, Caulfield will not have any trouble making friends at any gay male leather bar the way he is outfitted.Grease 2 introduced Michelle Pheiffer and Maxwell Caulfield and started them on the successful career paths both have enjoyed.  If you saw the first Grease film, a much better film, than you definitely have an idea how this film will turn out.In addition to Conn, Eve Arden, Sid Caesar, and Dody Goodman, all faculty members from the original Grease return in their roles.  The music score is not remotely as good as the songs that come from the original.It is not that Grease 2 is bad, it is just not all that great.",
		"When I was 11, Grease 2 was like crack.  It was a classless, shameful, euphoric, and powerfully addictive experience.  My sister and I would watch it, rewind it, and watch it over again and again and again until we passed out or became too confused and hostile to stand one another.  So, if you are an 11year old girl, and you reviewed this film as brilliant or fun or better than the original Grease, you have your fledgling adolescent hormones to blame and you can rest assured that this unyielding fixation with utter rubbish will pass.If, however, you are not a little girl, you have absolutely no excuse to suggest that Grease 2 was anything but an inane, artless, slipshod embarrassment for all who participated in its production, distribution, andor consumption.For the sake of criticism, I will dignify the film now by explaining why it blows 1.  In a wellexecuted musical, the songs should advance the narrative or develop the characters.  In Grease 2, with a few debatable exceptions, to the music is obscenely pointless.  songs appear sex in Tonight For Our Country Plus, all of the music is uncomfortably stupid and no one in the cast demonstrates even the crudest semblance of an ability to sing or dance.2.  The Tbirds should be badass, and if not at least somewhat likable, but instead each of them is an annoying wussydufusloser.  In the end, when Johnny Nogerelli offers Michael the sacred Tbird jacket and initiates him into the gang, Michael should kick it to the ground, spit on it, and duck away to fervently scrub any part of his body that was touched by it.  But of course, he accepts it as if it is gold because despite the fact that they are a bunch of bumbling meatheads, there is no greater honor than to be one with the Tbirds. 3.  Since Michael is beautiful, smart, kind, resourceful, and above average in everyway his musical impotence notwithstanding, it is feasible that Stephanie would ultimately embrace him when he reveals himself to be the man behind the mask.  Stephanie, on the other hand, is a slovenly, slackjawed, bubble gum smacking, dirty sweatshirt wearing, gracelessly rude and trashy dingbat.  So aside from being pretty I guess, she harbors no likable characteristics, thus, audiences are given no justification whatsoever for the depth of Michaels attraction to her.I could go on and on, but I did not want to mention the gross inferiority to its predecessor since there are apparently so many cranks out there who seem to feel that such a comparison is unfair.  I will say this though, to those of you who think you want to revisit this mess for old times sake Grease 2 is an experience akin to reliving your first kiss.  Only you are 32 now and kissing a snotnosed 13year old kid with acne and slobby braces.  The magic is gone and you are left feeling dirty and disturbed.  Trust me.",
		"I have read some of the comments about this film and can only surmise that some people are easily entertained.  This movie is nothing.  It is so badly written, directed and acted that it barely makes an impression.  The characters speak in clicheridden dialogue and the situations are completely implausible.  While that might make this campy and fun, it does not because everything is so lifeless the film becomes dull.  Rose decided drama about woman with her sexuality It is drama about woman with her sexuality It is drama about woman with her sexuality This movie could go in the enyclopedia as the standardissue bad Lifetime TV movie.",
		"I laughed all the way through this rotten movie.  It is so unbelievable.  woman leaves breakdown in front of estate office What happens?  The office manager comes outside and offers her a job!!!  Hilarious!  Next thing you know the two women are going at it.  Yep, they are lesbians!  Nothing rings true in this Lifetime for Women with nothing better to do movie.  Clunky dialogue like I do not want to spend the rest of my life feeling like I had a chance to be happy and did not take it does not help.  There is a wealthy, distant mother who disapproves of her daughters new relationship.  A sassy black maid  unbelievable that in the year 2003, a film gets made in which there is a sassy black maid.  Hattie McDaniel must be turning in her grave.  The woman has a husband who freaks out and wants custody of the snotty teenage kids.  Sheesh!  No cliche is left unturned.",
		"he was group of relatives by character actors he was group of relatives by character actors to speak to a wealthy relative, who goes into a coma.While they wait for him to recover, all sorts of mysterious goingson happen, including a couple of murders.A creepy film; worth seeing!",
		"German filmmaker Ulli Lommel has managed a task many horror fans thought was impossible he is unseated fellow Teuton Uwe Boll for the crown of director of the worst horror film ever made.Lommel is truly the Ed Wood of the new millennium.  This film is as shoddy and laughable as the bestworst of EW.  I am both proud and embarrassed to say that I watched it in toto, morbidly fascinated to see just low the bar could be set.  The answer is subterranean; Lommel dug a pit and buried it.The fun begins with the cast of international nobodies.  Only someone who has lived in Los Angeles, where every auto mechanic, doctor and mailman is an actor or screenwriter waiting to be discovered, could easily understand how Lommel managed to find so many wannabe actors willing to spew his ridiculous dialog with a straight face.The main character, a villainous beat cop, is played by a German actor with a thick German accent.  Aside from being a serial killer, he is also the oldest beat cop in LA.  he stops them into his of furniture warehouse he stops them into his of furniture warehouse The production designers budget apparently included just enough money for a can of paint; enough to paint Precinct 707 on a cardboard wall.Since the actors were obviously unpaid nonprofessionalsa sad assortment of European emigres possibly deportees if they acted in their native lands, bimbos, mimbos, and desperate middleaged womenand since little if any money was spent on sets, special efx, locations or other production value, it is only fair to mention that they did spring for a few genuinelooking police uniforms.  Sadly, they could not afford a police car; the uniformed cops cruise the streets in a shiny new Mercury rental.More than half of the story focuses on the dirty deeds of our deranged German LAPD officer and the futile efforts of two young rookies to stop him.  One of these young actors is especially pitiable because he is the only actor in this whole mess with even a vague shot at a real career in the movies.  The other fits right in, with a rockabilly hairdo and tortured Brando posing that needs to be seen to be appreciated.The latter part of the film is where the title gets its zombie, as the victims of our killer are resurrected after he murders a girl who had just visited some voodoo priestesses to have a protective spell put on her.  Do not ask why a girl from Romania would resort to voodooism in anticipation of being murdered, just accept Lommels logic and enjoy the absurd ride.After much prolonged handclawing out of strawcovered roadside graves, the zombie girls manage to make their appearance.  They look exactly as they did before death, maybe even prettier, with black glamor makeup generously airbrushed around their eyes.  Looking nothing like zombies, they look more like high fashion models ready for the runway.At this point in the movie Lommel borrows a creative note from his lauded countryman Boll, and injects large doses of cheesy Eurotrash techno into the soundtrack.  We are talking prehistoric electronic bumblebee noise.  Stuff they might have played in an Ibiza disco when Lommel was still young enough to shake his booty.Unlike other zombies, Lommels girls speak and function as normal... er, I mean, as they did before becoming zombified.  This gives our auteur ample opportunities to shower us with more of his golden dialog.  Yes, a golden shower it is.I will not spoil anything by revealing the shock ending.  All I can say is it is perfectly in tune with the rest of this masterpiece.  The spirit of Ed Wood lives on... or should I say his geist.",
		"This movie had me going.  The title was perhaps the greatest idea that I heard.  I thought it was an independent movie about a zombie outbreak and their quest to take over the US and a group of lone survivors, band together, and plan to take out the zombies.  DEAD WRONG!  It is weakness for his from their graves As you can see there is nothing about the nation nor a county involved.  Where to begin with the severity this cinematic disaster caused our nation.First off, the zombie women look like Victoria Secret models with dark eyeliner and a pale face.  What are zombies but mindless, debatable intelligent, cannibalistic killing machines that eat as a result of their primitive most basic needs?  These zombie women walk like streetwalkers and runway models, they talk as if they are in a poor film noir movie and not do they act like real zombies.  Sure the eating and killing is there, but where is the mindlessness and the horrible disfigurement?  Although it is a very interesting concept and perhaps a great satire on the zombie genre, it makes fun of that genre and asks the question, why cannot zombies be beautiful vixen killing machines?  I would say that this movie would be considered a really bad indie movie that was produced and made by garage junkies.  I would not recommend this movie to anybody that loves zombie genres too much, it is an insult and as for scarynot even.",
		"I only watched the first 30 minutes of this and what I saw was a total piece of crap.  The scenes I saw were as bad as an Ed Wood movie.  No, it was a hundred times WORSE.  Ed Wood has the reputation of being the worst director ever but that is not true; the idiot who directed this junk is the WORST director ever.The American cop has a German accent!  station was desk in warehouse with Police Station There is a fist fight where the punches clearly miss by about TEN FEET.This cop pulls women over, cuffs them and leads them to a warehouse.  He tells his cop partner to wait in the car.  Then he comes out of the warehouse carrying a duffel bag.  The cop partner thinks maybe something is not right, that his partner might be a bad cop who is murdering these women, but he is not sure if that is what is happening because  he is a moron!  The dialog is totally stupid, the acting is awful, and the characters act in the stupidest manner I have ever seen on screen.  It is totally obvious to the cops partner that he is illegally abducting these women and he is slapping them and taking them into a warehouse and returning to the car with a duffel bag with a body in it, and yet, the partner, who is there all along, does not know what is happening!  The director of this film is a total hack.  I stopped the movie at 30 minutes because I could not take it anymore.  It has to be one of the WORST movies I have ever started to watch and I will not waste anymore time on it writing this review.  Absolutely WORTHLESS.",
		"Zombie Nation 2004 RHey, I was bored.  I looked in my Comcastic little box to find a movie to watch.  Zombie Nation?  Hey, I love zombie movies.  Says the filmmaker has some sort of cult following in the description.  Funny how it does not warn me not to watch this film.  I could have used that advice.Zombie Nation is just like Troll 2 in that it is completely misnamed.  It has little if anything, depending on your point of view to do with zombies, and takes place all within one city.  This film revolves around a crooked cop, who acts as badly as possible he has to be trying to suck this much, while he arrests women for trivial bullshit and then kills them.  Yup, he is a serial killer cop.  Not only is this film flawed in thinking that it is a zombie flick, it also gets its serial killer facts completely wrong.  Serial killers enjoy killing, they live for it and they get down and personal with it.  This guy knocks out the women, and injects them with some poison.  He does not even have sex with the corpse or dismember it.  Talk about boring!  Eventually, one of the whopping five women he kills has Voodoo protection done to her and for no apparent reason, all five come back to life and head off to kill this guy.  They were all buried or tossed into the ocean, but you would not know it buy the sharp clean clothes they are all wearing.  The women then act very poorly and take their revenge.  Oh yay.This film was crap in every category.  Crap acting, crap writing, crappier sets, and crappier makeup effects.  The women do not look zombielike, unless you count really dark makeup around the eyes to be the de facto definition of what makes a zombie.  They can all talk, behave, think, and act perfectly human.  The gore is weak compared to even many PG13 films and the nudity is beyond brief.  You see glimpse of breasts in opening sequence Then the exact same breasts later!  Go figure.  Guess only one actress was willing to go topless for this trite.  The police station is so badly constructed that you can see where they stopped painting the walls of the warehouse they are obviously filming in.  You can see the pipes and the bad lighting and the overly sparse setup and even, unless you are blind, you can see the director failing.  Steer clear, it is a waste of time.110",
		"Last weekend I bought this zombie movie from the bargain bin and watched it with some friends thinking it was going to be a budget version of Land of the Dead.Boy, was I wrong.  they spent budget on fans of zombie genre.We they spent budget on fans of zombie genre.We It seems budget on fans of zombie genre.We They actually speak to the guy before one of the girls kills him; but once they started driving the car, I could not suspend my disbelief anymore.Some people actually consider this a so bad, it is good movie, they are liars.  I did not finish the movie, but one of the other reviews mention that they actually somehow become police officers at the end of the movie, which makes me glad to not have watched it all the way through.This is even worse than Zombiez DO NOT WATCH!",
		"German filmmaker Ulli Lommel has managed a task many horror fans thought was impossible he is unseated fellow Teuton Uwe Boll for the crown of director of the worst horror film ever made.Lommel is truly the Ed Wood of the new millennium.  This film is as shoddy and laughable as the bestworst of EW.  I am both proud and embarrassed to say that I watched it in toto, morbidly fascinated to see just low the bar could be set.  The answer is subterranean; Lommel dug a pit and buried it.The fun begins with the cast of international nobodies.  Only someone who has lived in Los Angeles, where every auto mechanic, doctor and mailman is an actor or screenwriter waiting to be discovered, could easily understand how Lommel managed to find so many wannabe actors willing to spew his ridiculous dialog with a straight face.The main character, a villainous beat cop, is played by a German actor with a thick German accent.  Aside from being a serial killer, he is also the oldest beat cop in LA.  he stops them into his of furniture warehouse he stops them into his of furniture warehouse The production designers budget apparently included just enough money for a can of paint; enough to paint Precinct 707 on a cardboard wall.Since the actors were obviously unpaid nonprofessionalsa sad assortment of European emigres possibly deportees if they acted in their native lands, bimbos, mimbos, and desperate middleaged womenand since little if any money was spent on sets, special efx, locations or other production value, it is only fair to mention that they did spring for a few genuinelooking police uniforms.  Sadly, they could not afford a police car; the uniformed cops cruise the streets in a shiny new Mercury rental.More than half of the story focuses on the dirty deeds of our deranged German LAPD officer and the futile efforts of two young rookies to stop him.  One of these young actors is especially pitiable because he is the only actor in this whole mess with even a vague shot at a real career in the movies.  The other fits right in, with a rockabilly hairdo and tortured Brando posing that needs to be seen to be appreciated.The latter part of the film is where the title gets its zombie, as the victims of our killer are resurrected after he murders a girl who had just visited some voodoo priestesses to have a protective spell put on her.  Do not ask why a girl from Romania would resort to voodooism in anticipation of being murdered, just accept Lommels logic and enjoy the absurd ride.After much prolonged handclawing out of strawcovered roadside graves, the zombie girls manage to make their appearance.  They look exactly as they did before death, maybe even prettier, with black glamor makeup generously airbrushed around their eyes.  Looking nothing like zombies, they look more like high fashion models ready for the runway.At this point in the movie Lommel borrows a creative note from his lauded countryman Boll, and injects large doses of cheesy Eurotrash techno into the soundtrack.  We are talking prehistoric electronic bumblebee noise.  Stuff they might have played in an Ibiza disco when Lommel was still young enough to shake his booty.Unlike other zombies, Lommels girls speak and function as normal... er, I mean, as they did before becoming zombified.  This gives our auteur ample opportunities to shower us with more of his golden dialog.  Yes, a golden shower it is.I will not spoil anything by revealing the shock ending.  All I can say is it is perfectly in tune with the rest of this masterpiece.  The spirit of Ed Wood lives on... or should I say his geist.",
		"Every year I watch hundreds of films, including many low budget amateurish straighttoDVD abominations that nobody in their right mind would ever want to see.  I have thousands of films in my time Zombie Nation I will remember forever as one of the most hopelessly laughable horror films I have ever seen  in fact I still have not recovered from the experience of watching it.The day after, it seems like some kind of weird dream.  Did I really see what I thought I saw?  Why do the police work out of a warehouse?  Did the voodoo priestesses really recommend that the zombies eat cheeseburgers?  Is it safe?  Is it safe?  Is it safe?  I would not recommend Zombie Nation if you want to see a good film, and neither would I recommend it as so bad its good.  However, if you are entertained by the prospect of watching probably the most indefensibly abysmal film ever  this is for you.  Now, whenever anyone asks me what the worst film I have ever seen is, I will say Zombie Nation.Seriously  I think it is a greater crime to make a boring film than a bad one, and Ulli Lommel deserves credit for producing a film that actually stuns you with its ineptitude.  He really is the Ed Wood Jr. of the digital age, and I for one cannot wait to see if he makes another film as consistently ridiculous as this one.",
		"Every year I watch hundreds of films, including many low budget amateurish straighttoDVD abominations that nobody in their right mind would ever want to see.  I have seen thousands of films in my time, many excellent, many forgettable.  Zombie Nation I will remember forever as one of the most hopelessly laughable horror films I have ever seen  in fact I still have not recovered from the experience of watching it.The day after, it seems like some kind of weird dream.  Did I really see what I thought I saw?  Why do the police work out of a warehouse?  Did the voodoo priestesses really recommend that the zombies eat cheeseburgers?  Is it safe?  Is it safe?  Is it safe?  I would not recommend Zombie Nation if you want to see a good film, and neither would I recommend it as so bad its good.  However, if you are entertained by the prospect of watching probably the most indefensibly abysmal film ever  this is for you.  Lommel deserves credit for you with its ineptitude Lommel deserves credit for you with its ineptitude Lommel deserves credit for you with its ineptitude He really is the Ed Wood Jr. of the digital age, and I for one cannot wait to see if he makes another film as consistently ridiculous as this one.",
		"LeRoy puts drama on film with soap operas High drama is found in the loves and infidelities in New Yorks social set.  Oh yes, do not forget jealousy can bring about tainted hearts and murder.  The all star cast features Barbara Stanwyck, Van Heflin, James Mason, Ava Gardner, Cyd Charisse and Nancy Davis.",
		"...this would have been what you got.Words alone cannot describe how bad this is.  If you are having trouble sleeping pop this in and I guarantee you will be out in fifteen minutes.Robert Lowery was a pretty good actor in the 40s but he is phoning it in here.  In an interview, Johnny Duncan Robin said that in one scene he and Batman had to run from the car to the house and that Lowery was doubled over out of camera range because his girdle was too tight!  Duo do effort into it in serial.The acting it rolled effort into it in serial.The acting it rolled effort into it in serial.The acting it rolled effort into it in serial.The acting it rolled effort into it in serial.The acting he is effort into it in serial.The acting he is effort into it in serial.The acting himself looks effort into it in serial.The acting himself looks effort into it in serial.The acting His cowl is so bad he cannot even see out of it and his ears look more like flopsy mopsy the disgruntled easter rabbit than they do anything batlike.In one scene I am not making this up, Batman substitutes counterfiet radioactive money that will burst into flames the second it is exposed to air as a payoff to some hoods.  It is radioactive so he can trace it the reason it is so highly flammable is not explained.  Well, unfortunately the thugs open the package in a cardboard warehouse we know it is a cardboard warehouse because Batman sneaks in and pushes these boxes that look to weigh about six ounces on the hoods to knock them out and soon the whole place burns to the ground.  Thanks Batman! In another scene after the Batmobile is disabled, Batman flags down a passing motorist in the middle of nowhere and takes his car leaving the man to fend for himself and telling him not to worry because if Batman smashes up the car the police will surely buy him another one!  Yes, you guessed it, said car careens off a cliff within a few short seconds.  Not that it matters much to the motorist who has probably died from exposure trying to hoof his way back to Gotham City.There is a tired subplot with Lois Lane clone Vicki Vale who is convinced Bruce Wayne is Batman she must have noticed the Batmobile parked outside of Bruces house or maybe she saw Batman and Robin running up the walk in the clearly densely populated suburban neighborhood.Everything about this serial is bad and all but the youngest in the audience will want to hurl toast at the screen.  IF you are looking for bad cinema you could not hit a better mark if you want entertainment, try the Burton Batman films, the Adam West Batman TV Series or the earlier Lewis Wilson Batman serial.",
		"Granting the budget and time constraints of serial production, BATMAN AND ROBIN nonetheless earns a place near the bottom of any cliffhanger list, utterly lacking the style, imagination, and atmosphere of its 1943 predecessor, BATMAN.The producer, Sam Katzman, was known as King of the Quickies and, like his director, Spencer Bennett, seemed more concerned with speed and efficiency than with generating excitement.  Unfortunately, this team also produced the two Superman serials, starring Kirk Alyn, with their tacky flying animation, canned music, and dull supporting players.  The opening of each chapter offers a taste of things to come thoroughly inane titles Robin Rescues Batman, Batman vs Wizard, mechanical music droning on, and our two heroes stumbling toward the camera looking all around, either confused or having trouble seeing through their cheap Halloween masks.  Batmans cowl, with its devils horns and eagles beak, fits so poorly that the stuntman has to adjust it during the fight scenes.  His utility belt is a crumpled strip of cloth with no compartments, from which he still manages to pull a blowtorch and an oxygen tube at critical moments! In any case, the lead players are miscast.  Robert Lowery displays little charm or individual flair as Bruce Wayne, and does not cut a particularly dynamic figure as Batman.  He creates the impression that he would rather be somewhere, anywhere else!  John Duncan, as Robin, has considerable difficulty handling his limited dialogue.  He is too old for the part, with an even older stuntman filling in for him.  businessmen ambling ounce of Lewis for character development This one offers a group going through the motions, not that the filmmakers provide much support.  Not one of the hoodlums stands out, and they are led by one of the most boring villains ever, The Wizard.  Great name!  Actually, they are led by someone sporting a curtain, a shawl, and a sack over his head, with a dubbed voice that desperately tries to sound menacing.  The prime suspects  an eccentric professor, a radio broadcaster  are simply annoying.Even the established comic book regulars are superfluous.  It is hard to discern much romance between Vicki Vale and Bruce Wayne.  Despite the perils she faces, Vicki displays virtually no emotion.  Commissioner Gordon is nonetoobright.  Unlike in the previous serial, Alfred the butler is a mere walkon whose most important line is Mr Waynes residence.  They are props for a drawnout, gimmickladen, incoherent plot, further saddled with uninspired, repetitive music and amateurish production design.  The Wayne Manor exterior resembles a suburban middleclass home in any sitcom, the interiors those of a cheap roadside motel.  The Batcave is an office desperately in need of refurbishing.  The costumes are kept rolled up in a filing cabinet! Pity that the filmmakers could not invest more effort into creating a thrilling adventure.  While the availability of the two serials on DVD is a plus for any serious Batfan, one should not be fooled by the excellent illustrations on the box.  They capture more of the authentic mood of the comic book than all 15 chapters of BATMAN AND ROBIN combined.Now for the good news  this is not the 1997 version!",
		"Granting the budget and time constraints of serial production, BATMAN AND ROBIN nonetheless earns a place near the bottom of any cliffhanger list, utterly lacking the style, imagination, and atmosphere of its 1943 predecessor, BATMAN.The producer, Sam Katzman, was known as King of the Quickies and, like his director, Spencer Bennett, seemed more concerned with speed and efficiency than with generating excitement.  Unfortunately, this team also produced the two Superman serials, starring Kirk Alyn, with their tacky flying animation, canned music, and dull supporting players.  The opening of each chapter offers a taste of things to come thoroughly inane titles Robin Rescues Batman, Batman vs Wizard, mechanical music droning on, and our two heroes stumbling toward the camera looking all around, either confused or having trouble seeing through their cheap Halloween masks.  Batmans cowl, with its devils horns and eagles beak, fits so poorly that the stuntman has to adjust it during the fight scenes.  His utility belt is a crumpled strip of cloth with no compartments, from which he still manages to pull a blowtorch and an oxygen tube at critical moments! In any case, the lead players are miscast.  Robert Lowery displays little charm or individual flair as Bruce Wayne, and does not cut a particularly dynamic figure as Batman.  He creates the impression that he would rather be somewhere, anywhere else!  John Duncan, as Robin, has considerable difficulty handling his limited dialogue.  He is too old for the part, with an even older stuntman filling in for him.  Out of costume, Lowery and Duncan are as exciting as tired businessmen ambling out for a drink, without one ounce of the chemistry evident between Lewis Wilson and Douglas Croft in the 1943 serial.Although serials were not known for character development, the earlier BATMAN managed to present a more energetic cast.  This one offers a group going through the motions, not that the filmmakers provide much support.  Not one of the hoodlums stands out, and they are led by one of the most boring villains ever, The Wizard.  Great name!  Actually, they are led by someone sporting a curtain, a shawl, and a sack over his head, with a dubbed voice that desperately tries to sound menacing.  The prime suspects  an eccentric professor, a radio broadcaster  are simply annoying.Even the established comic book regulars are superfluous.  It is hard to discern much romance between Vicki Vale and Bruce Wayne.  Despite the perils she faces, Vicki displays virtually no emotion.  Commissioner Gordon is nonetoobright.  Unlike in the previous serial, Alfred the butler is a mere walkon whose most important line is Mr Waynes residence.  They are props for drawnout with production design The Wayne Manor exterior resembles a suburban middleclass home in any sitcom, the interiors those of a cheap roadside motel.  The Batcave is an office desperately in need of refurbishing.  The costumes are kept rolled up in a filing cabinet! Pity that the filmmakers could not invest more effort into creating a thrilling adventure.  While the availability of the two serials on DVD is a plus for any serious Batfan, one should not be fooled by the excellent illustrations on the box.  They capture more of the authentic mood of the comic book than all 15 chapters of BATMAN AND ROBIN combined.Now for the good news  this is not the 1997 version!",
		"You have gotta hand it to Steven Seagal whatever his other faults may be, he does have good taste in women.  If you pick a Seagal movie, chances are there will be one or more very beautiful women in it.  And usually, they do not function as mere eye candy; they get involved in the action and fight, shoot guns, kill with knives, etc.  Fury offers duo of Ciera with Katie Jones And if it seems like I am spending a little too much time talking about them, it is because the rest of the movie, although passable, is so unexciting that it is hard to find much else to talk about.  Ironically, the weakest aspect is probably Seagal himself, who looks as if he cannot even be bothered to try to pretend to care.  This being a militarytype actioner, there is very little fighting in it, and he does not fit into his role a stealth fighter pilot, the best in the world, of course very well, which may explain his almost offensive sleepwalking. 12",
		"FURY is shot for shot of BLACK THUNDER I sense shot for shot of BLACK THUNDER I sense shot for shot of BLACK THUNDER I sense shot for shot of BLACK THUNDER I sense shot for shot of BLACK THUNDER I have shot for shot of BLACK THUNDER I have shot for shot of BLACK THUNDER I have shot for shot of BLACK THUNDER 12  out of ",
		"Steven Seagal appears to be sleepwalking through a dreadful movie shot almost entirely in closeup to disguise the complete lack of budget and resources.  To pick on the technical flaws  silver FA18s and F14s take of from a carrier for an airstrike, and miraculously become camouflaged F16s for the actual strike  would give this movie more credibility than it deserves.  Suffice it to say that the most interesting thing in the movie is the credit titles which fade on and then disappear in a lightning wipe, which presumably is available to all users of Final Cut Pro.  credit puts Keusch in category as Marcel Mandu",
		"Following the appalling Attack Force, chances were that Seagal could only have a step up with Flight Of Fury.  To outstink Attack Force would take some doing.  Flight Of Fury is a marked improvement overall, but still in the grand scheme of thinks, mediocre.  Mediocrity is seemingly an achievement for Seagal these days, a sad insight into his movie careers decline.  Where Attack Force was a hodgepodge of plot lines altered drastically from conception, to filming, to post production, Flight Of Fury keeps the plot line more simple.  Someone steals a hightech stealth fighter, planning to use it to fire chemical weapons which we later, bizarrely discover, will destroy the whole world in 48 hrs.  Seagal has to get the plane back.  It is that simple, no annoying subplots, and conspiracies weighing the film down like far too many of his recent works.  That is not to suddenly say the storytelling is good though, it is pretty poor.  The introduction to side characters is badly done for example.In filmic terms FOF is bad.  It is badly acted by all involved, and Seagal looks bored to tears almost.  He is nativity against his of half assedness Can we blame Seagal though when the material is so unambitious and cruddy?  Not really.  This is the final film of his Castel Studios, multipicture deal.  The producers cannot be bothered to make anything remotely good, promising a 12 or so million dollar budget, and after Seagals obligatory 5 million probably pocketing a nice hefty chunk of it themselves If the film was made for the remaining 7 million, then I am Elvis Pressley!.  So in that respect why should Seagal put the effort into a film that is already got distribution sorted before it is made.  Fans though may argue, he at least owes them the effort.  He is seriously looking jaded, and the continued use of stand ins and dubovers is further indication of this.  Michael Keusch directs with some efficiency, while the cinematography is quite good, but in all technical areas and as usual with Castel, a bog standard stunt team there is nothing more than mediocrity, and nothing to help the film rise above its material, and bored leading man.  Again there is a few action scenes focusing on characters other than Seagal, which in all truth we do not want to see.Overall the action is not too bad.  It is nice and violent, and on occasion we are treated to a few vintage nasty Seagal beatings, but overall nothing special.  Partly due to a poor stunt crew, and the lack of time to film anything too complex or exciting.  For me, Shadow Man was a more enjoyable film, because while ignoring the incoherent, jumbled, plot line, there were more vintage Seagal moments, and more of him in centre stage.  He never disappeared for long periods during the film.  Seagal disappears bizarrely during one action scene here, and reappears after, with little explanation.  There is far too much stock footage used.  Using stock shots is not an entirely horrendous thing, but using it as a crutch is.  We are treated to countless establishing shots of naval ships, all the time, which get annoying.  Plus the continuity of the stock footage is all over the place just check the backdrops, chopping and changing.The film is just middle of the road.  It says it all that the films best scene is a completely needless, and gratuitous girl on girl scene, with two hot chicks.  Seagal even perks up briefly then too!  Overall this may be one of the better stock footage based actioners out there, but that is not saying much at all.  This will please many fans, but they should bear in mind, Seagal himself would probably want to forget this ones existence. ",
		"It has been said, a city on hill cannot hide itself and Virginia City, Nevada, perched on the side of Mt.  Davidson at 6200 ft. west of Tahoe, is a prime example, or in the context of the movie, should be.  Virginia City exploded in the American dream as a shower of gold and silver, suspiciously the same year the Civil War began.  It was the birthplace of the dean of American letters; it was where a young reporter named Samuel Clemens began using the name Mark Twain and went on to become Americas most famous writer.  It was birthplace of pad of John Mackay Hey, they should have made the movie about him!  In the 1860s Virginia CIty was THE boomtown of all boomtowns, the home of the big bonanza, at one time the largest metropolitan area west of St.  Louis and East of San Francisco.  But Virginia City the movie misses all that and is more about a hogwash NorthSouth duello between the characters played by Errol Flynn and Randolph Scott.  Flynn is Capt.  Kerry Bradford, a Union officer who is a POW in a concentration camp run by a mean Confederate commander named Capt.  Vance Irby, played by Scott.  These two are always getting in each others way.  Bradford escapes and then tries to stop a shipment of gold bullion being snuck out of VC by who else other than . . .  Irby!  Hey, what is he doing here!?  Horrible.  Bogart plays a laughable Mexican bandit who cannot decide who is side he is on.  Miriam Hopkins plays a murky character named Julia Hayne, obviously a historical lunge at the towns first lady, Julia Bulette, who in real life a celebrated prostitute.  She goes to Washington and talks Honest Abe about saving BRADFORD not Irby from hanging and blah blah blah.  Go figure.  They shoulda hung the writer.  In real life Twain reports that on the last day of the War, the setting sun caused the American flag atop Mt.  Davidson to appear to the puzzled residents to be weirdly on fire, kind of like the movie.  Three days later they discovered that on that day the South capitulated.  One interesting quirk in the film is how sidekicks Alan Hale and Guin Williams flick their pistols forward when they shoot, like they are fishing, or trying to make the bullets go faster.  Not a bad idea for the movie.  The same kind of goofiness is lathered over sap and corn throughout the movie.  Gosh, how could they miss the gold madness, profligate wealth, gun battles in the silver mines, Mark Twain getting run out of town and beat up after a showdown, the crooked railroad, the Opera House fire, Artemis Ward, Bulettes huge funeral, the Chinese tongs, the black saloons, the Auction . . ?  All this high on a mountain surrounded by desert?  The truth was unreal.  Did its fabulous wealth actually spark the great American holocaust?  Well, if you count this movie, it would not be the first debacle to come out of Virginia City.  It is a disappointment for Virginia City fans because it misses what made the town a city of illusions, where it is said evil seeps out of the ground . . .  Okay, other than that it is a fun movie.  Flynn and the gang are always great no matter what history they are destroying.  If Flynn would just play his rotten self I would double my rating.",
		"SLASHERS 2 outta 5 starsNot really a very good movie... but I did like the idea behind it... and the the filmmakers did make it look pretty good considering the tiny budget they had to work with.  movie is episode of contestants into danger zone The survivor, if there is one, wins fame and fortune... everyone else just winds up dead.  The main drawback to this movie is that the acting is pretty bad.  None of the real people seem real at all.  The actors playing the killers are kind of fun... because they are portraying cheesy and overthetop caricatures of popular modern horror movie types... and that is exactly how they would be done if this was an actual show.  The movie pretends to be done all in one take... there is one cameraman who follows the contestants around the danger zone and everything is seen from the point of view of his camera... but the lights keep flickering on and off constantly to hide the cuts from one take to another, I would imagine.",
		"SLASHERS 2 outta 5 starsNot really a very good movie... but I did like the idea behind it... and the the filmmakers did make it look pretty good considering the tiny budget they had to work with.  The movie is ostensibly an episode of a live Japanese reality show that sends several contestants into a sealed off danger zone and has three costumed creeps sent after to them to kill them.  The survivor, if there is one, wins fame and fortune... everyone else just winds up dead.  The main drawback to this movie is that the acting is pretty bad.  None of the real people seem real at all.  The actors playing the killers are kind of fun... because they are portraying cheesy and overthetop caricatures of popular modern horror movie types... and that is exactly how they would be done if this was an actual show.  everything is point of view of his camera everything is point of view of his camera everything is point of view of his camera everything is point of view of his camera",
		"This film was recommended to me by a friend who lives in California.  She thought it was wonderful because it was so real, Just the way people in the Ohio Valley are!  I am from the area and I experienced the film as Just the way people in California think we are!  I have lived in Marietta and Parkersburg and worked minimum wage jobs there.  We laughed a lot, we bonded with and took breaks with people our own age; the young people went out together at night.  The older people had little free time after work because they were taking care of their families.  story lacked elements of charm of dread.Marthas character It is doubtful that anyone so repressed would have belonged to a church, but if she had, she probably would have made friends there.  I have read reviews that seem to assume Martha was jealous of Rose because Rose was younger, prettier and thinner but if this is the case it is not shown.  All we actually see is Martha learning to dislike Rose for reasons that would apply just as much if the three friends had been the same age and gender.  We see Martha feeling left out during smoking sessions, left out of the loop when social plans are made, used but not appreciated, and finally disrespected and hurt.Just one more thing Are we supposed to suspect Kyle of murder because he had once had a few panic attacks?  Please.  This takes stigma against mental illness to a new level.",
		"When thinking of the revelation that the main character in Bubble comes to at films end, I am reminded of last years Machinist with Christian Bale.  films is weight of portrayal of town life The title is cause for contemplation.  Perhaps, we, the audience are the ones in the Bubble as we are given no payoffs in the films slim 90 minute running time.  Audience reactions were often smug and judgmental, clearly indicating how detached people can be from seeing any thread of humanity in characters so foreign to themselves.  These characters are the ones people refer to as those that put George W. back in office for a second term.It is sobering to consider how reality television has spoiled our sense of reality when watching an audience jump to their feet for the exit as soon as the credits role.  This film has it is merits, and is deserving of consideration for the things it does not say outright.",
		"If he wanted to be accurate, he should have chosen some Frisco natives and not a bunch of NY actors who know nothing about the Sucka Free not Sucker Free.  I have lived in SF my entire life, and folks here do not talk or act the way these actors did.  Everything was overdramatized, and the only cat I saw from the Bay was JT the Bigga Figga with his little cameo as a rapper.  No shock that he was the only one in the film who really dressed like cats out here ie his Warriors jersey.  Not once did I notice anyone wearing any Giants or 9ers gear; instead he fitted them in some cheesy madeup SF or Oakland jerseys that are not even sold around here.  gangbangers do wristbands with colors of Olympic team HP has wristbands with colors of Olympic team HP has wristbands with colors of Olympic team Further, while there now is a significant yuppie community that has invaded the Mission, all that was shown was some white dude and a selfproclaimed 100 West Coast Boriqua.  This is NOT New York!  Puerto Ricans here are few and far between, and the Latinos in the Mission are very, very different from the ONE that was shown here, who was without a doubt from NY.  Also, HP is not the only black neighborhood in the City.  An accurate depiction would have shown the drama between HP sets in their own hood as well as vs.  Fillmore, Sunnydale, Lakeview, etc.  This film could have been much better if Lee had done some more homework and had a better storyline to work with.",
		"This TV movie goes to show that bad films do exist.  The only reason I saw this was it was covered on a KTMA MST3K.  It is Bowl at Superdome in New Orleans However, no football is played whatsoever and we see the behind the scenes look at basically nothing.  With the many stars in this film, it made no difference.  I really do not know why I watched this.",
		"It is 1978, and yes obviously there are too many black players on the teams as well!  Fans will be upset and certainly the 75,000 seats will be full, only less happy there are so many black players on the field!  This made for TV Super Bowl movie is watchable.  It is not much more, but it is really surprising the cast of talented actors that make an appearance for the time, probably most notably Tom Selleck.  Unfortunately any goodness Selleck brings to the screen, is quickly trumped by actors like Dick Butkus.It is a silly story about super bowl betting.  York read mafia for game for their favor PJ is innocent enough, and seems to have a loose grasp by buying off a few people here and there.  But things seem to fall apart for him.  Another person, the unsuspected Lainie, takes charge.  For a while, the mystery of murders is not known for certain, but is revealed rather plainly at the final murder that Lainie is the new antagonist.It is a bad movie, but is watchable.  The acting is decent, and the filming is OK.  At least there were not any silly typical 70s car chases they have their place just not here.  Just keep an open mind about past stereotyping and the cocaine era and you will survive.210 maybe a 2.5",
		"Could not go to sleep the other night.  So I got up, flipped on the tube  this movie was on.Film makers bit off more than they could chew.  Just as ambitious in scope as Forrest Gump was.  But Gump read like an fairytale where an extraordinarily lucky man guides us through the era.  TGMB just relies on tired clich?s to tell the story.  Almost like a Broadway musical where actors have to ham it up.  Every characters purpose was to fill a silly 60s archetype.Take how we are introduced to Finnegan Hugging his black maid  receiving a framed picture of MLK.  Criminey, talk about heavyhanded.  Why not just give him a tshirt saying I Heart Black People? Sunshine Is not free love groovay, man?  Oh no, I did not have my period.  Mary Beth I want to go to Berkeley, not square UCLA.  Uh, excuse me?  There was nothing square about LA in the 60s.  Rather than take the time to demonstrate what made Berkeley unique, we just hear this brat whine about not going there.Cannot even remember the black kids name.  He was just a prop used to show how racially tolerant the other kids are.Thing is, period pieces do not have to be this cheesy.  Take Dazed  Confused.  Look how we are introduced to the football hero, Randall Floyd.  We do not first see him on the football field.  In fact, we never see him play football.  We are introduced to him in class, inviting his nerdish poker buddies to a party.In Dazed feminism is not a casual byproduct of some chick getting knocked up.  It is much more organic, more serious than that.  It is room over discussion about Gilligans Island Serious ideas can grow in the most mundane settings.  But real life is like that.Some of the warm comments here note that the themes in this movie are still relevant.  I agree!  Which is why I feel so disappointed by this piece of BabyBoomer pornostalgia.",
		"MAJOR LEAGUE BACK TO THE MINORS 1998 ½ Starring Scott Bakula, Eric Bruskotter, Corbin Bernsen, Dennis Haysbert, Jensen Daggett, Written and directed by John Warren 100 minutes Rated PG13 for language and some violence By Blake French \tBelieve it or not, in the new John Warren comedy MAJOR LEAGUE BACK TO THE MINORS there is one funny scene.  It consists of a sequence where an infuriated coach throws a baseball hard into the wall behind him only to have it hit the cement and bounce back and smash him in the face.  It is not much, but with the exception of a few oneliners, it is all this film has to offer...enough said.  This movie is not only structurally impaired, characteristically undeveloped, predictable and badly written, but also just plain bad.  Even noncritical audience members will hate this movie with all that they got.  It is so familiar it just is not funny.  How many times does the same movie about sports have to be made?  Last years we saw this same material in Air Bud Golden Receiver, and as bad as that film was, this is even worse.  At least Air Bud was family oriented.  Major League Back to the Minors is too vulgar for a wholesome family to view together on a Sunday afternoon.  It is too childish for adults.  So who is this film for?  Teenagers?  Elderly?  People who are so desperate for entertainment they would rent something like this?\t The film, like many others like this, has one basic point it tries to make teamwork conquers all.  Yes it does, and what a great moral to try to prove.  Too bad we have already seen and excepted it so many times over and over have such little talent and intelligence that their cheerleaders are men in a ballerina costumes.  Where the silly announcers form their own buddy comedy routine muttering one liners to themselves like They suck, This kids fast ball is timed with an hour glass, This guy dropped out of ball for a while to find something he lostmaybe it was his mind, Somebody needs a nap, and ever see a sunset as beautiful as that play.  Where the characters have such little significance to each other that we never know them by name.  And where the only heartfelt lecture scene about teamwork is so unknowledgeable that it is almost funny.\t it stalls right in middle of closing sequence it stalls right in middle of closing sequence The good baseball team is on a comeback, they are about to win andthe power goes out.  I was thinking for a minute that this piece of trash had come to a conclusion, but in reality, its false final scene exists only to add minutes to the running time.  The movie basically consists of a series of unrelated sketches that throw in so many putrid jokes it is are not funny.  There is another kindoffunny line of dialogue that has a coach and a player talking to each other about why a long time outfielder is not wanted in that position any longer.  The coachs answer You are too old, too slow, and too fat.  The players reaction is to die for.  But that scene certainly does not make this movie noteworthy of you time, and certainly is not worth a cent of your money.  So here is another dreadful entr?e into this genre of film, another that is doomed with its own script, which is failed before seen, and another which is so familiar it seems like deja vu all over again.",
		"This movie is a disgrace to the Major League Franchise.  I live in Minnesota and even I cannot believe they dumped Cleveland.  Twins had spot at bottom of American League Twins had spot at bottom of American League Twins had spot at bottom of American League Anyway I loved the first Major League, liked the second, and always looked forward to the third, when the Indians would finally go all the way to the series.  You cannot tell me this was not the plan after the second film was completed.  What Happened?  Anyways if your a true fan of the original Major League do yourself a favor and do not watch this junk.",
		"Oh dear god.  This was horrible.  There is bad, then there was this.  This movie makes no sense at all.  It runs all over the map and is not clear about what its saying at all.  The music seemed like it was trying to be like Batman.  The fact that Edison is not a real city, takes away.  Since I live in Vancouver, watching this movie and recognizing all these places made it unbearable.  Why did not they make it a real city?  The only writing that was decent wasTilman in which John Heard did a fantastic job.  He was the only actor who played his role realistically and not over the top and campy.  Heard play guy with lot of screen time Heard play guy with lot of screen time It was guy with lot of screen time It was guy with lot of screen time Too bad.  Hopefully someone important will see it, and at least give John Heard credit where credit is due, and hire him as lead bad guy again, which is where he should be. on the A List.",
		"This movie is a disgrace to the Major League Franchise.  I live in Minnesota and even I cannot believe they dumped Cleveland.  Twins had spot at bottom of American League Twins had spot at bottom of American League Twins had spot at bottom of American League Anyway I loved the first Major League, liked the second, and always looked forward to the third, when the Indians would finally go all the way to the series.  You cannot tell me this was not the plan after the second film was completed.  What Happened?  Anyways if your a true fan of the original Major League do yourself a favor and do not watch this junk.",
		"Honestly before I watched this movie, I had heard many people said this movie was a disgrace.  I did not believe that since Morgan Freeman and Kevin Spacey have taken roles in this movie, and watched it by my own.  Apparently they were right.  I was time during I in movietheater business But Morgan and Kevin?  I could not stop asking myself why the heck they agreed to take part in Edison.  To be honest, their roles are rather stupid.Well you might think if the players suck, then I should pay more attention to the story.  It is indeed story is the core of a movie, but guys... trust me... this is not a movie you want to give a credit for its story.  Imagine this, a smartass journalist Justin Timberlake wrote a story against the system and at the same time learning how to become a real journalist from his boss Morgan Freeman.  This all was supported by one agent who still has heart for justice LL Cool J and an brilliant investigator Kevin Spacey.  At the end, they beat the system with a happy ending story.Jeez, I could not even carry on with this.  Just recalling the movie is making me sick already.  My advise guys, do not watch this!  Please save your money and time for another movie.",
		"Honestly before I watched this movie, I had heard many people said this movie was a disgrace.  I did not believe that since Morgan Freeman and Kevin Spacey have taken roles in this movie, and watched it by my own.  Apparently they were right.  I was really disappointed and wondering all the time during the movie  why the hell did I watch this movie.Of course I was not expecting much from Justin as he really does not belong in the movietheater business.  But Morgan and Kevin?  I could not stop asking myself why the heck they agreed to take part in Edison.  To be honest, their roles are rather stupid.Well you might think if the players suck, then I should pay more attention to the story.  It is indeed story is the core of a movie, but guys... trust me... this is not a movie you want to give a credit for its story.  Timberlake wrote story against journalist from Morgan Freeman This all was supported by one agent who still has heart for justice LL Cool J and an brilliant investigator Kevin Spacey.  At the end, they beat the system with a happy ending story.Jeez, I could not even carry on with this.  Just recalling the movie is making me sick already.  My advise guys, do not watch this!  Please save your money and time for another movie.",
		"movie get her before clothes from Miss Congeniality movie get her before clothes from Miss Congeniality I am her before clothes from Miss Congeniality Did Ms.  Bullock also get to sleepwalk through the role by channeling the before Gracie Hart?  As many reviewers have noted before, the film is very formulaic.  Add to that the deja vu viewer experiences with the character of Cassie Maywether as a somewhat darker Gracie Hart with more back story and it rapidly become a snooze fest.The two bad boy serial killers have been done before and better in other films.  As has the good guy partner trying to protect his partner despite the evidence character been seen before.  In fact none of the characters in the film ever get beyond two dimensions or try to be anything but trite stereotypes.One last peeve  using the term serial killer is false advertising.  Murdering one person  even if it is a premeditated murder  does not make you a serial killer.  You may have the potential to become a serial killer but you are not a serial killer or even a spree killer.",
		"STRANGER THAN FICTION angered me so much, I signed up on IMDb just to write this review.  STRANGER THAN FICTION is a surprisingly complex, touching and thoughtprovoking movie until the very end.  Once you suspend multiple lapses of logic why did not Will Ferrell hear Emma Thompsons voice 10 years ago when she fist started writing her book?  The phone rang.  The phone rang again.  How could she not know it is him calling?  movie challenges history of themes by Dustin Hoffman And Maggie Gyllenhaal is always a pleasure, even though Will Ferrell might just as easily be an ax murderer as a bumbling soul.  Her quick trust of him is a mighty big leap of faith.Ah, but the ending.  Until the very end, I would have given 9 out of 10 stars to this movie.  The movie as a metaphor for lifes journey, as a tribute to the notion of writing true, as a reminder that great literature is either comedy or tragedy, but not both, is outstanding.  The entire movie leads the viewer to understand and accept the moment of Will Ferrells fate.  And no matter how endearing a character he may have become, we know full well why we will accept the ending.  The last act occurs, the screen goes white, the credits roll.  A profound and powerful end to an almost perfect film.  An end that would have been debated for weeks.NO!!!!!!!!!!  No credits rolled.  Say it is not so.  Say Hollywood did not tack on another 10 minutes of crap that completely undermined the integrity and heart of the movie.  Dustin Hoffman got it right when he said, It is no longer a masterpiece; it is OK.  An apt review of the movie.  Except to me, it was not even OK.  I was so offended about the betrayal of writing true, about the decision to pander the film that I actually burst into angry tears explaining this on the ride home from the movie.  I do not often cry.  I could care less about most movies, but I am still angry about this one.My questions for Zack Helm, the writer, are this did the original movie end when the screen went white?  And were you forced by the vapid movie powersthatbe to tack on an ending unfaithful to the core of the movie?  Or did you tack that maudlin ending on yourself?  I have read you are brilliant.  I hope your original script ended the movie the first time.I know Zack Helm will never see this review, and I have been unable to find a contact for him to ask myself.  But, please, moviegoers, am I the only one who feels this way about STRANGER THAN FICTION?  One good thing came from me seeing this movie I doubly admire LOST IN TRANSLATION now.",
		"When Sam Peckinpahs superlative THE WILD BUNCH 1969 opened the door to outrageous displays of graphic cinematic ultraviolence, it did so with a talented if whiskymarinated hand guiding the camera and had a compelling story with characters who had actual depth, but in no time flat there were scores of imitators that fell far from the benchmark set by Peckinpahs epic, and SOLDIER BLUE definitely falls into that category.SOLDIER BLEW, er, BLUE tells the story of foulmouthed New Yorker Cresta Lee Candice Bergen a blonde protohippie chick who is been rescued from two years of captivity among the Cheyenne and is now being sent to a fort where she will be reunited with the fianc?e she only wants to marry for his money.  Also on board the wagon she is traveling in is a shipment of government gold, cash the Cheyenne need to buy guns with, so in short order the soldiers are wiped out and Cresta flees to the hills, accompanied by Honus Gant Peter Strauss, the lone surviving cavalryman.  savages was Gant in survival through his leg Cresta demonstrates Gant in survival through his leg Realizing that their love could never flourish outside of the cave, Cresta leaves Gant and makes it to the fort by herself only to discover that the moron in charge will not spare a couple of men so they can rescue Gant; the regiment needs all available personnel to launch an attack on the nearby Cheyenne village, and once Cresta gets wind of that she slips past her obnoxiously horny hubbytobe and makes a beeline straight to the Cheyenne to warn them of what is coming.  What happens next is what gained the film its infamy; it turns out that all the wacky misadventures and squabbling were all just a leadin to a hideous reenactment of the 1864 Sand Creek Massacre, an orgy of rape, torture and general sadistic evil perpetrated in the name of keeping the country clean, and almost forty years after its release this sequence still disturbs and nauseates for its sheer cruelty.  Children are trampled beneath the hooves of charging horses or impaled on bayonets, unarmed people are beheaded  a nice effect, I have to admit  women are stripped and pawed by gangs of slavering brutes, then raped and mutilated  in one truly sickening instance a naked native woman puts up too much of a fight, so her rapist instead decides to cut off her breasts, which we thankfully only see the start of before the camera moves on to chronicle some other hideous act  and scores of innocent people are shot and dismembered, their compone nt parts impaled on pikes and waved about in victorious celebration or kept as the most ghoulish of souvenirs.  No joke, this scene would instantly garner an NC17 rating if released today, to say nothing of possibly spurring Native American interest groups to riot in the streets over the incredibly exploitative manner in which the atrocities are depicted.I am all in favor of westerns that do not shy away from honest portrayals of how the west was won, or stolen if truth be told, but this film has no idea of what kind of movie it wants to be; one minute it is a heavyhanded pseudohippy lecture about how the treatment of the natives was totally effed up well, DUH! , then it is a lighthearted battle of the sexes farce wherein Cresta proves herself five times the man Gant is and manages to look hot in her tasty red calico poncho with no undies, but that all goes out the window when Donald Pleasance shows up with an unintentionally ?  hilarious pair of bucktoothed dentures and our heroes must figure out how to escape from his murderous clutches in a subplot that goes nowhere, all of which culminates in the aforementioned apocalyptic climax.  Any one of those tacks would have been okay for a coherent film, but the end result is a slapdash mess that milked the horrors of its final ten minutes for all they were worth in the films promotion and poster imagery.  But by trying to be all things to all audiences, SOLDIER BLUE ends up as an incoherent, preachy Mulligan stew of presumably wellintentioned political correctness, but if they were going to tell the story of the Sand Creek Massacre, would not it have been a good idea to have some Indian characters who were more than just walkons with Murphy Brown acting as their mouthpiece?  We get to know absolutely nothing of the people who get wiped out solely for what appears to be a crass ploy to lure gorehound moviegoers into seeing the most savage film in history.  If you, like me, were intrigued by the provocative ads and reviews that shower almost endless praise upon it for its daring to tell it like it was, take my word for it and let SOLDIER BLUE slowly fade into cinematic obscurity.",
		"When Sam Peckinpahs superlative THE WILD BUNCH 1969 opened the door to outrageous displays of graphic cinematic ultraviolence, it did so with a talented if whiskymarinated hand guiding the camera and had a compelling story with characters who had actual depth, but in no time flat there were scores of imitators that fell far from the benchmark set by Peckinpahs epic, and SOLDIER BLUE definitely falls into that category.SOLDIER BLEW, er, BLUE tells the story of foulmouthed New Yorker Cresta Lee Candice Bergen a blonde protohippie chick who is been rescued from two years of captivity among the Cheyenne and is now being sent to a fort where she will be reunited with the fianc?e she only wants to marry for his money.  Also on board the wagon she is traveling in is a shipment of government gold, cash the Cheyenne need to buy guns with, so in short order the soldiers are wiped out and Cresta flees to the hills, accompanied by Honus Gant Peter Strauss, the lone surviving cavalryman.  Calling Gant by the snarky nickname Soldier Blue, Cresta demonstrates that her years among the savages was time well spent, outstripping Gant in survival skills, common sense, and sheer balls, and over their journey toward the fort they must persevere against the elements, a band of hostile Kiowa, an unscrupulous trader  played by Donald Pleasance, here giving one of his most ridiculous performances, and that is saying something  and, in the tradition of many previous westernset romantic comedies, each other.During the course of their misadventures the two opposites are inevitably  and predictably  attracted to each other and eventually end up getting it on  while Gant has a freshly treated bullet wound that went clean through his leg, no less  in what was surely the only conveniently located cave for at least a twelve mile radius that was not filled with rattlesnakes, mountain lions, or who knows what, to say nothing of the Cheyenne, who could have done something really spiffy with such a primo apartment there I go, thinking in NYC real estate terms again.  Realizing that their love could never flourish outside of the cave, Cresta leaves Gant and makes it to the fort by herself only to discover that the moron in charge will not spare a couple of men so they can rescue Gant; the regiment needs all available personnel to launch an attack on the nearby Cheyenne village, and once Cresta gets wind of that she slips past her obnoxiously horny hubbytobe and makes a beeline straight to the Cheyenne to warn them of what is coming.  What happens next is what gained the film its infamy; it turns out that all the wacky misadventures and squabbling were all just a leadin to a hideous reenactment of the 1864 Sand Creek Massacre, an orgy of rape, torture and general sadistic evil perpetrated in the name of keeping the country clean, and almost forty years after its release this sequence still disturbs and nauseates for its sheer cruelty.  Children are trampled beneath the hooves of charging horses or impaled on bayonets, unarmed people are beheaded  a nice effect, I have to admit  women are stripped and pawed by gangs of slavering brutes, then raped and mutilated  in one truly sickening instance a naked native woman puts up too much of a fight, so her rapist instead decides to cut off her breasts, which we thankfully only see the start of before the camera moves on to chronicle some other hideous act  and scores of innocent people are shot and dismembered, their compone nt parts impaled on pikes and waved about in victorious celebration or kept as the most ghoulish of souvenirs.  No joke, this scene would instantly garner an NC17 rating if released today, to say nothing of possibly spurring Native American interest groups to riot in the streets over the incredibly exploitative manner in which the atrocities are depicted.I am all in favor of westerns that do not shy away from honest portrayals of how the west was won, or stolen if truth be told, but this film has no idea of what kind of movie it wants to be; one minute it is a heavyhanded pseudohippy lecture about how the treatment of the natives was totally effed up well, DUH! , then it is a lighthearted battle of the sexes farce wherein Cresta proves herself five times the man Gant is and manages to look hot in her tasty red calico poncho with no undies, but that all goes out the window when Donald Pleasance shows up with an unintentionally ?  hilarious pair of bucktoothed dentures and our heroes must figure out how to escape from his murderous clutches in a subplot that goes nowhere, all of which culminates in the aforementioned apocalyptic climax.  result is minutes for they in poster imagery result is minutes for they in poster imagery But by trying to be all things to all audiences, SOLDIER BLUE ends up as an incoherent, preachy Mulligan stew of presumably wellintentioned political correctness, but if they were going to tell the story of the Sand Creek Massacre, would not it have been a good idea to have some Indian characters who were more than just walkons with Murphy Brown acting as their mouthpiece?  We get to know absolutely nothing of the people who get wiped out solely for what appears to be a crass ploy to lure gorehound moviegoers into seeing the most savage film in history.  If you, like me, were intrigued by the provocative ads and reviews that shower almost endless praise upon it for its daring to tell it like it was, take my word for it and let SOLDIER BLUE slowly fade into cinematic obscurity.",
		"When Sam Peckinpahs superlative THE WILD BUNCH 1969 opened the door to outrageous displays of graphic cinematic ultraviolence, it did so with a talented if whiskymarinated hand guiding the camera and had a compelling story with characters who had actual depth, but in no time flat there were scores of imitators that fell far from the benchmark set by Peckinpahs epic, and SOLDIER BLUE definitely falls into that category.SOLDIER BLEW, er, BLUE tells the story of foulmouthed New Yorker Cresta Lee Candice Bergen a blonde protohippie chick who is been rescued from two years of captivity among the Cheyenne and is now being sent to a fort where she will be reunited with the fianc?e she only wants to marry for his money.  Also on board the wagon she is traveling in is a shipment of government gold, cash the Cheyenne need to buy guns with, so in short order the soldiers are wiped out and Cresta flees to the hills, accompanied by Honus Gant Peter Strauss, the lone surviving cavalryman.  Calling Gant by the snarky nickname Soldier Blue, Cresta demonstrates that her years among the savages was time well spent, outstripping Gant in survival skills, common sense, and sheer balls, and over their journey toward the fort they must persevere against the elements, a band of hostile Kiowa, an unscrupulous trader  played by Donald Pleasance, here giving one of his most ridiculous performances, and that is saying something  and, in the tradition of many previous westernset romantic comedies, each other.During the course of their misadventures the two opposites are inevitably  and predictably  attracted to each other and eventually end up getting it on  while Gant has a freshly treated bullet wound that went clean through his leg, no less  in what was surely the only conveniently located cave for at least a twelve mile radius that was not filled with rattlesnakes, mountain lions, or who knows what, to say nothing of the Cheyenne, who could have done something really spiffy with such a primo apartment there I go, thinking in NYC real estate terms again.  Realizing that their love could never flourish outside of the cave, Cresta leaves Gant and makes it to the fort by herself only to discover that the moron in charge will not spare a couple of men so they can rescue Gant; the regiment needs all available personnel to launch an attack on the nearby Cheyenne village, and once Cresta gets wind of that she slips past her obnoxiously horny hubbytobe and makes a beeline straight to the Cheyenne to warn them of what is coming.  What happens next is what gained the film its infamy; it turns out that all the wacky misadventures and squabbling were all just a leadin to a hideous reenactment of the 1864 Sand Creek Massacre, an orgy of rape, torture and general sadistic evil perpetrated in the name of keeping the country clean, and almost forty years after its release this sequence still disturbs and nauseates for its sheer cruelty.  Children are trampled beneath the hooves of charging horses or impaled on bayonets, unarmed people are beheaded  a nice effect, I have to admit  women are stripped and pawed by gangs of slavering brutes, then raped and mutilated  in one truly sickening instance a naked native woman puts up too much of a fight, so her rapist instead decides to cut off her breasts, which we thankfully only see the start of before the camera moves on to chronicle some other hideous act  and scores of innocent people are shot and dismembered, their compone nt parts impaled on pikes and waved about in victorious celebration or kept as the most ghoulish of souvenirs.  No joke, this scene would instantly garner an NC17 rating if released today, to say nothing of possibly spurring Native American interest groups to riot in the streets over the incredibly exploitative manner in which the atrocities are depicted.I am all in favor of westerns that do not shy away from honest portrayals of how the west was won, or stolen if truth be told, but this film has no idea of what kind of movie it wants to be; one minute it is a heavyhanded pseudohippy lecture about how the treatment of the natives was totally effed up well, DUH! , then it is a lighthearted battle of the sexes farce wherein Cresta proves herself five times the man Gant is and manages to look hot in her tasty red calico poncho with no undies, but that all goes out the window when Donald Pleasance shows up with an unintentionally ?  hilarious pair of bucktoothed dentures and our heroes must figure out how to escape from his murderous clutches in a subplot that goes nowhere, all of which culminates in the aforementioned apocalyptic climax.  Any one of those tacks would have been okay for a coherent film, but the end result is a slapdash mess that milked the horrors of its final ten minutes for all they were worth in the films promotion and poster imagery.  it have walkons with Murphy as their mouthpiece We get to know absolutely nothing of the people who get wiped out solely for what appears to be a crass ploy to lure gorehound moviegoers into seeing the most savage film in history.  If you, like me, were intrigued by the provocative ads and reviews that shower almost endless praise upon it for its daring to tell it like it was, take my word for it and let SOLDIER BLUE slowly fade into cinematic obscurity.",
		"Now I will be the first to admit it when I say something that may be blasphemous or unfair, so I would like to apologize in advance for my ranting about how much I disliked this movie.That about sums it up too.  I disliked this movie.  To be more specific, I disliked the concept of this movie.  The cinematography was good.  The mood was nice.  And the acting was satisfactory.  However, the story is fatuous, unacurate and misleading.  It is also offensive.I am a quarter Cree Indian, and for some reason I feel insulted, on a personal level, by the nature of Whitakers character.  First of all, he is a black guy.  And this is not a racist remark, I swear.  The thought of a White, Hispanic or even Native American swinging a katana on a rooftop offends everything that the katana represents.  The katana represents the soul of a Samurai, imbibed with the souls of his ancestors who guide and protect the Samurai.  For Ghost Dog to use his guns instead of the Katana is also an insult to the blade and the souls inside, and where the heck did he get a Katana anyway?  It must be one of those replicas, which insults the Samurai caste even more.Also, Ghost Dog showed no honor.  he shoots man by him through faucet drain Not only is this a cowards way to kill an enemy, it is more like a ninjas way; silent assassins; a group that samurais deny exists, but hates nonetheless.Then he tries to kill his boss, when he finds out his boss is a baddie.  You know what a true Samurai does when he learns his master is proven bad or dishonorable?  He kills himself, to prove that he would rather die then lower himself to the level of his doggish master.Everything about the character was a giant contradiction to the real code that all Samurai adhere to Bushido.So, we have great cinematography, good ambiance and soso acting encompassing a satiricle plot and premise, which unfortunately is the most important aspect of it , making it an unsatisfactory overall film, and an insult to everything a honorable bushisamurai holds dear. 2.510 Bleah",
		"I am basing this on my observations of one episode I saw last night 92706.  I do not think I will be watching again.  I mean judgment for death of drug addict I mean judgment for death of drug addict I mean judgment for death of drug addict The lead actor Victor Garber seemed so uncomfortable, almost embarrassed in his role  perhaps he realized how bad the writing was!!  I fully realize that the drama offered this season is pretty poor, but they can surely find better writers.  Maybe they are outsourcing the writing to India or China!!  I will bet we will not be seeing this one next season!",
		"Absolutely fantastic.  Now, before a legion of cinema purists choke on their latt?s, allow me to elaborate.  Much as I enjoyed it, this is quite simply one of the worst films I have ever seen and is certainly the worst film I have seen at the cinema an impressive claim, as I remember seeing Daredevil on the big screen.  The two leads Daniel Gillies and Elisha Cuthbert were unconvincing at best and downright awful at worst.  they were depth as characterisation as OJ defence The plot to stretch the term slightly was thin to nonexistent and the gore scenes, whilst undoubtedly brutal, were irrelevant and laughably formulaic.  What plot there is revolves around a twentysomething model Cuthbert who is abducted, imprisoned and subjected to various visceral tortures, both psychological and physical.  The torture scenes feel like disconnected set pieces and the emphasis was laid squarely upon shocking rather than scaring the audience.  Whilst there really are very, very few positives to draw from this film, its redeeming features are the very flaws that make it such a dreadful film.  I have never heard a more vocal audience in a cinema.  Within twenty minutes, the entire cinema was in stitches and remained that way throughout.  For my part I came out flushed with laughter, buoyed by a film that had ascended to the pinnacle of appalling filmmaking.  Whichever way you look at it, this is truly a cinematic achievement and a blueprint for future directorial wannabes detailing minutely how not to make a film.P.S.  I omitted to mention that I managed to get in to the film free...so I can afford to laugh about it.  I was still tempted to ask for my money back...it really was THAT bad.",
		"Jude Law gives his all in this beautifully filmed vampire flick which offers little else of value.  Completely lacking in eroticism, excitement, or leading ladies with appeal.  One decent fight, a few moments of mild suspense.  movie waxes series of conversations between homicide detective But despite their best efforts, both actors are staked to the cross of the films banality.With a lesser actor in the lead role  and without the benefit of Oliver Curtiss cinematography  Crocodiles would blend into the sea of lowbudget vampire quickies.",
		"Jude Law gives his all in this beautifully filmed vampire flick which offers little else of value.  Completely lacking in eroticism, excitement, or leading ladies with appeal.  One decent fight, a few moments of mild suspense.  And a onenote plot.The movie waxes philisophic in a series of conversations between Laws character and a dogged homicide detective, well played by Timothy Spall.  actors are cross of Crocodiles into vampire quickies",
		"LL Cool J performed much better in this movie that I expected!  He did a fabulous job acting as a renegade cop within a renegade department.  he does job of building for his character He acts as a sort of gentle giant  a person whose rough exterior can scare anybody, yet whose heart is clearly in the right place from the very start  and he does an amazing job.  He was quite clearly the best character in the movie.This was certainly a performance that will not win Morgan Freeman any awards.  After starring in powerhouse films like the Shawshank Redemption this film was certainly a step down.  His role in Edison simply did not allow him to show his true talents as an actor  and in terms of the conglomeration of characters placed him sadly on a back burner.  There are so many ways his character Moses Ashford could have taken a more pivotal role.  That he did not was disappointing and a true letdown.  I was hoping to see more from him in this film.Timberlake ought to have stayed in the music industry.  His portrayal of a young journalist was poorly acted and unpersuasive.  This movie is a typical action movie that at least initially bears some resemblance to corrupt police affairs LA has experienced in the past.  Being an action movie, it has its share of shootemup scenes, blood, and guts.  These scenes are typically unrealistic and painfully predictable.  Watching the beginning of the movie there is very little suspense as to what will happen at the end  think of what you would typically expect in a goodcopsbadcops conflict  and it bears little resemblance to a REAL police shootout.What irked me most was the way Timberlakes character behaved during shootout scenes.  He starts out having guns and not using them.  Then when he finally gets around to using one he fires it as if he is been firing a gun his whole life.  Then he runs out of bullets and does not have a gun  and 30 seconds later, without moving or anything  suddenly has 2 more fully loaded guns AND extra ammo?!  Little plot errors like this really ruined the movie for me.If what you are looking for is a blatantly fictional plot in a fantasy world where everything turns out okay, then you will probably love this movie.  Personally, it does not matter to me what KIND of movie it is as long as it is realistic.  Make me believe that the story is true.  This story was so obviously fictional in so many aspects that I came away feeling unsatisfied.",
		"This movie was made by a bunch of white guys that went to school together.  Well there is nothing wrong with that, except it looks like it was made by a bunch of white guys that went to school together. 90 percent of the cast are white males about same age.  It is almost like watching a bunch of guys at boys camp who turned the camera on themselves.  The movie has no plot.  It simply repeats the same action of blood bath after blood bath.  There are some funny scenes and comedic bits.  But they do not redeem the flat monotony.The graphic cartoon scenes are used to cover the stuff that was obviously beyond their budget or resources to do, and not done very well at that.  animation.I went film after it like Tarrentino piece Well, the trailer scenes are as good as they ever get.  Ther rest of it just repeats the same kind of mundane, inane comedy.  It works at times, but it gets boring after the same stuff comes at you over and over.  It is more like a string of Satuday Night Live skits than a movie.  It is a hityouovertheheadwithit kind of comedy.  I can see where the story idea is intriguing.  But, in this film post apocalyptic America is much like Medevil England.  In fact Wheatlry says the story ideas came from that era.  He plans to make a Part 2.  I guess he thinks he is Tarrentino or maybe doing a parody thing.At the opening in LA, Wheatley mentioned he will bring back pretty much the same cast in part 2.  He was asked if he might consider a more diverse cast in the next one, to which he replied, well yea, sure.",
		"End of the World is an uneventful movie, which is odd since it is supposed to be about the total destruction of the earth.  The main character is some kind of scientist, I am not exactly sure what kind.  He has two jobs at a government?  facility guarded by four security men.  His first job is monitoring transmissions to and from space although this actually seems more like a hobby he does when not working on job 2.  Job 2 requires him to put on a protective suit and go into a dark room...at least that is the best I can figure.  Apparently the plant is not exactly topsecret, as the scientist brings his wife there.  She hangs out they are on their way to a dinner while he discovers a message from space Major Earth Disruption, repeated over and over.  He says something about it being the first message from space he is ever been able to decipher; his wife tells him they are going to be late for the dinner party.  So they leave and go to the party !?!.  Moments later he finds out that China has suffered a major earthquake.  From there, the movie goes... nowhere!  Yes, Christopher Lee is in it, but that really does not help much.  Lee gives lines of his in Howling II This movie is boring, but it has enough stupid elements that you might want to suffer through it once if you like Christopher Lee or Zgrade scifi.  Plus, there is lots of stock footage of the earth being destroyed.",
		"It is got Christopher Lee, it is got huge banks of 1970s computers that make Teletype noises as letters appear on the screen, it is got radioactive isotopes that not only glow in the dark but emit pulsing thrumming noises, it is got volcanoes!  evil aliens disguised as nuns!  tidal waves!  earthquakes!  exploding cars!  exploding coffee machines!  and as a climax the entire planet blows up.  How on earth does this film managed to be so incredibly, mindnumbingly DULL?  The answer, my friend is because 90 of this movie is made up of establishing shots, most of them involving long tracks, pans, or zooms in combinations, or occasionally all three, that do nothing except give the crew something to do.  There are endless shots of our protagonists driving, getting in and out of cars, driving again, walking around looking at stuff, getting in cars and driving...  I just sat there watching endless parade of nothingness in stupefaction muttering Say something, please somebody, just say something...  DO something... anything!... The dialogue, when it does come, is terrible.Maybe their minutes are measured on a different scale than ours. was a typically meaningless line.  The script culminates in the destruction of the world by stock footage, justified in this speech from Lee as the head alienThe planet Earth has emitted an overabundance of diseases, they are contaminating the Universe.  All the planets light years away from here will suffer unless it is destroyed!  This is is Neanderthal SF script writing.  you find sort of monster at year olds you find sort of monster at year olds It is, and I collect such things, the most godawful line from an English language SF movie since Buster Crabbe retired.  It beggars belief that this movie was released in the same year as Star Wars and Close Encounters.Lee, who always struck me as a smart, useful actor with a sure knowledge of his limits, delivers his lines as if he is going to kill his agent for getting him into this pile of drek.  I do not blame him.",
		"This film had a great cast going for it Christopher Lee, Dean Jagger, Macdonald Carey, Lew Ayres  solid bmovie actors all.  But this downer of a movie did not use any of them to any sort of advantage, with none of their characters even meeting on screen though Christopher Lee does get to play opposite himself in several scenes.The motivations for the aliens in this movie seem to change at the drop of a hat.  First, they just want to repair their ship and leave, then they turn on the main character by killing most of his friends and not releasing his wife after he gets them the crucial part they need.  Then, out of nowhere, this peaceful race decides they have to destroy the planet because it causes too many diseases though they do offer the main character and his wife a spot in their society.Most of the film is spent watching the man and wife drive or walk or stand around or sit at desks doing nothing.  they had vengeance for us like lowbudget scifi they had vengeance for us like lowbudget scifi It falls into that narrow range of wasted celluloid between Star Odyssey and UFO Target Earth.",
		"This film had a great cast going for it Christopher Lee, Dean Jagger, Macdonald Carey, Lew Ayres  solid bmovie actors all.  But this downer of a movie did not use any of them to any sort of advantage, with none of their characters even meeting on screen though Christopher Lee does get to play opposite himself in several scenes.The motivations for the aliens in this movie seem to change at the drop of a hat.  First, they just want to repair their ship and leave, then they turn on the main character by killing most of his friends and not releasing his wife after he gets them the crucial part they need.  Then, out of nowhere, this peaceful race decides they have to destroy the planet because it causes too many diseases though they do offer the main character and his wife a spot in their society.Most of the film is spent watching the man and wife drive or walk or stand around or sit at desks doing nothing.  You almost wish they had gotten taken out with the rest of the planet at the end, just in vengeance for boring us to death.Unless you really like Chris Lee or seventies lowbudget scifi, I would give this one a miss.  It falls range of celluloid between Target Earth",
		"I saw this movie in the theater when I was a kid and always remember it as my first experience with getting ripped off by a horrible movie with a good commercial.  The commercial was great, but it I found out later that it had every explosion or special effect in the entire movie about 4 and even some that were not in the movie.  There was some sort of plot relating to the aliens but the aliens were never actually shown in the movie as far as I remember.  It was case of someone off scam people I guess my world of innocence ended that day, when I found out there were bad people out there who make bad bad movies.",
		"When it comes to horror movies, I am more than willing to suspend disbelief, ignore subpar production values, and overlook plot holes in the interest of a good scare.  This movies simply has no good scares to offer.  It cannot even be enjoyed as camp.  Bad dialogue, bad acting, bad direction, the kills were predictable and poorly staged, the music was annoying, the camera work was wretched, even the costumes were bad.  I felt really bad for the actors, who were obviously trying, but who had to deal with terrible, contrived dialogue and an obvious lack of direction.  I doubt they got any rehearsal, either.  It is embarrassing to watch, and so boring than making it through to the contrived surprise ending requires tremendous endurance.  It is quite easily one of the worst movies I have ever seen.I do not normally write reviews, but this one was so bad that I felt compelled to warn others.  This movie is a complete waste of time.  If you must watch this movie, do not miss the Making offeaturette.  The writerdirector seems to be under the impression that making the killer a woman was kind of bold, daring move.  Seen it.  He and the cast spend half an hour deconstructing this film as if it is a newage Citizen Kane.  thirdgraders take you behind scenes of Christmas pageant It is you behind scenes of Christmas pageant They truly think they have created something of substance.  It is sad, really The only reason I gave this movie a 2 is because I think 1 should be reserved for true atrocities, like Manos Hands of Fate and Space Mutiny.  So American Nightmare is not the WORST movie I have ever seen, but I would have to say that it is somewhere in the bottom fifty.",
		"In Texas, seven friends meet in a bar to celebrate the Halloween night before going to a party.  Meanwhile, they call the American Nightmare pirate radio for fun and confess their innermost fears.  A serial killer, who is listening to their confessions, makes their nightmares come true, killing each one of them in a sadistic way.  American Nightmare is a weird low budget movie that has a horrible beginning without any previous explanation, a woman kills two couples in an isolated camping area, as if it were Friday, 13th.  Then, the story shifts to a bar, where seven friends are celebrating Halloween.  From this moment on, the story has a great potential, and the unknown cast has a very reasonable performance, showing also some beautiful breasts and naked bodies, as usual in this type of C production.  screenplay does motives for behavior of Jane Toppan With a better beginning and conclusion, this weird story would be a good low budget slasher movie.  My vote is four.Title Brazil Agonia Agony",
		"I have movie with names like Morgan Freeman I have movie with names like Morgan Freeman It is nigh on impossible to suspend disbelief; I tried, really, I wanted to enjoy it but Justin Timberlake just would not let me.  Timberlake should stick to music, what a dreadful performance  NO presence as an actor,NO character.  Cannot blame everything on Justin The movie also boast a dreadful plot  badly timed editing; its definitely an F.After seeing this, I have to wonder what really motivates actors.  I mean, surely Morgan actually read the script before taking the part.  Did he not see how poor it was?  What then could motivate him to take the part?  Money?  Of course, acting is at times more about who you are seen with rather than really developing quality work.  LL Cool J is a great actor; he gets a lot more screen time than Freeman or Spacey in this movie and really struggles to come to terms with the poor script.  Meanwhile, the audience goes What the hell is going on here?  You expect me to believe this crap? In short, apart from Justin a great lineup badly executed  very disappointing.",
		"I hate to sound like an old person, but frankly I have not seen too many movies that I like that were made after 1960... generally, movies just seem to get worse and worse although I quite enjoyed the Scott Baio vehicle The Bread, My Sweet, except for the de rigeur sex scene which added NOTHING of value to THAT movie.  This movie makes the mother, a former Las Vegas chorus girl, seem to be incapable of surviving on her own, although she is clearly in her 50s though hinted at being in her 40s.  I did not buy it.  I am 57 and like all the women I know in their 50s and 40s, more than capable of surviving on my own as I have been doing since I graduated from high school at 13, got legally emancipated and set off on my own lifes journey.  opportunity created lack of selfdiscipline of her coworker opportunity created lack of selfdiscipline of her coworker she was advantage of selfdiscipline of her coworker she was advantage of selfdiscipline of her coworker she was advantage of selfdiscipline of her coworker she was advantage of selfdiscipline of her coworker she was advantage of selfdiscipline of her coworker she was advantage of selfdiscipline of her coworker Apparently the writers of tripe like this do not understand that it is NOT the common thing for PARENTS to act like children, and then be treated AS children by THEIR children.  That is just more of the societal baloney that Hollywood keeps trying to force down our throats as though we, their public, were stupid for desiring to be entertained by their creative offerings.This is a sad movie with a stupid ending.  If the young male restauranteur had been real and not a twodimensional tv character, he would have stayed with the MOTHER, who was not that much older than him and quite attractive.  But in the end he falls for the daughter, a shallow, rather uninteresting girl who has that cuteness of youth, but in an ordinary, bland way.  The opportunist young woman who worked with this nothing girl was far more attractive, physically.There was no believable reason presented to the audience as to why the restauranteur preferred the daughter who was an uptight, selfish, selfcentered btch who treated her mother with unbelievable disrespect to the mother  a woman who was kindhearted, sweettempered, humorous, and had a joie de vivre the daughter could not even begin to comprehend.  Of course the mother had her own flaws... she had reacted to her husbands demise by drinking herself into a stupor for a year or two afterwards which supposedly created the rift between her and her smarmy daughter.Regardless of the way the characters were or were not developed, this is a baloney movie and a waste of your valuable viewing time unless you actually LIKE baloney.  Where is the mustard?",
		"I hate to sound like an old person, but frankly I have not seen too many movies that I like that were made after 1960... generally, movies just seem to get worse and worse although I quite enjoyed the Scott Baio vehicle The Bread, My Sweet, except for the de rigeur sex scene which added NOTHING of value to THAT movie.  This movie makes the mother, a former Las Vegas chorus girl, seem to be incapable of surviving on her own, although she is clearly in her 50s though hinted at being in her 40s.  I did not buy it.  I am 57 and like all the women I know in their 50s and 40s, more than capable of surviving on my own as I have been doing since I graduated from high school at 13, got legally emancipated and set off on my own lifes journey.  The daughter is not believable in her job role ... she gets a promotion she does not deserve a great opportunity and drops that ball too, but when another female employee steps up to the plate and is ready to deliver, the writers shoot her down as an opportunist, when she was just doing what any careeroriented person would do  taking advantage of a wideopen opportunity created by the lack of selfdiscipline of her coworker, a girl who apparently does not understand the concept of honoring her promises to her boss, in this case.The daughter grudgingly allows her mother to stay with her, on a temporary basis, but then treats her mother the woman who gave her Life and raised her to adulthood like a pariah.  it is thing for PARENTS by THEIR children it is thing for PARENTS by THEIR children That is just more of the societal baloney that Hollywood keeps trying to force down our throats as though we, their public, were stupid for desiring to be entertained by their creative offerings.This is a sad movie with a stupid ending.  If the young male restauranteur had been real and not a twodimensional tv character, he would have stayed with the MOTHER, who was not that much older than him and quite attractive.  But in the end he falls for the daughter, a shallow, rather uninteresting girl who has that cuteness of youth, but in an ordinary, bland way.  The opportunist young woman who worked with this nothing girl was far more attractive, physically.There was no believable reason presented to the audience as to why the restauranteur preferred the daughter who was an uptight, selfish, selfcentered btch who treated her mother with unbelievable disrespect to the mother  a woman who was kindhearted, sweettempered, humorous, and had a joie de vivre the daughter could not even begin to comprehend.  Of course the mother had her own flaws... she had reacted to her husbands demise by drinking herself into a stupor for a year or two afterwards which supposedly created the rift between her and her smarmy daughter.Regardless of the way the characters were or were not developed, this is a baloney movie and a waste of your valuable viewing time unless you actually LIKE baloney.  Where is the mustard?",
		"Having seen men Behind the Sun I guess I hoped for an evolution in style  technique to match the larger scale of this movie.  I was also quite interested to see someone make a hardhitting factbased fictionalised account of what happened during this most notorious of Japanese atrocities, but this is not it.  This plays like a bottomtomid tier European Nazi exploitation movie from the 70s  e.g.  SS Experiment Camp etc perhaps more like Deported Women of the Special Section actually.  it resorts device of lots of shock sequence it resorts device of lots of shock sequence The admittedly horrible documentary footage is roughly spliced in between scenes so hackneyed that even these real images are robbed of much of their power.  Watch channel 4s The Holocaust aired recently still running? , as of 1 No 2006 for a genuinely disturbing documentary on the evils of war featuring excellent incontext use of actual footage.  This is the type of treatment the horror of Nanjing deserves, not this hackneyed exploitation garbage a better executed exploitation movie minus the disrespectful use of stock footage would have been fine, but again this is not even a very good exploitation movie.  Rating 3 5 as exploitation, 1 as a treatment of the subject.",
		"This is available on a Drive In Double Feature from Dark Sky Films, and since I just had finished up Barracuda, I watched this too.  This is a film that proves to be incredibly ambitious and inept at the same time.We begin with two young ladies wandering the streets of some foreign town, but where exactly are they?  They stop to look at necklaces from some Chinese vendor, and try on Chinesestyle clothes at a shop, but then we see some Aztec dancers?  girls has coin on string around her neck them.It seems coin on string around her neck them.It seems coin on string around her neck them.It seems coin on string around her neck them.It seems coin on string around her neck them.It seems coin on string around her neck So, in flashback, we go back to find out.  And how did they know she had this coin?  Hard to say, really.Now, back in the day, when these two women were 10 years old, they were out with their sisters and their sisters boyfriends on a boat, and after stopped to get air in their tanks, they tow this young boy back to his home dock, only to have his grandpa come out  invite the young uns up for herbal tea with granny.  But not everyone has the tea, Todd has gone back to the boat to check on the young girls, and then when they are away from it, the boat blows up, and when they get back to the house their friends have mysteriously disappeared.  Well, it seems as though these kindly folk raise their own vegetables but they wait for the meat to drop by for a spell, and serve it herbal tea.But the girls and Todd did leave the island, but now, they are returning, escorted by their captors, and they are there to find the treasure, despite the fact that no one ever showed the girls where it was BEFORE.  There also seems to be someone else on the island, and the thugs mysteriously begin to die, one by one, and since there is only three, it does not take long.  And there is even a sort of happy ending, which will leave the viewer every bit as baffled as they were throughout the rest of the film.The two thugs seem to be speed freaks with anger issues, and combined with no acting ability they are borderline hilarious.  The hillbillytype family is also devoid of acting ability, despite the fact that the grandpa is Hank Worden, who appeared in many films and TV shows.  The action is confusing, the locales are even more confusing, and the island looks like Southern California.So what the hell IS this?  I am not sure, but it certainly is worth seeing once so you can think or say, huh?  4 out of 10, very bizarre.",
		"This really should deserve a O rating, or even a negative ten.  I watched this show for ages, and the show jumped the shark around series 7.  This episode, however, is proof that the show has jumped the shark.  Butthead.It is Pirates of Mummy of Monte Cristo Butthead.It is Pirates of Mummy of Monte Cristo It is Pirates of Mummy of Monte Cristo However, there is such thing as ridiculous as in this is the worst thing I have ever seen.  And indeed, this is the worst episode of Stargate I have ever seen.  It is absolutely dreadful, and this coming from someone with a stargate in her basement.Makes me want to sell all of my stargate props, most seriously.",
		"I do not remember the last time I reacted to a performance as emotionally as I did to Justin Timberlakes in Edison.  I got so emotional I wanted to scream in anguish, destroy the screen, readily accept the hopeless cries of nihilism.  Timberlake is horribly miscast; in fact, casting him is like casting Andy Dick to play the lead role in Patton, or Nathan Lane to play Jesus.  But that is almost beside the point.Timberlake is simply a bad actor and he would be equally terrible in any role.  I used to have problems with Ben Afflecks acting talent, but Timberlake makes Affleck look like Sir Ian McKellen or Dame Judi Dench.  lisp read something like Clich? for he poisons lisp read something like Clich? for he poisons It simply will not fly.However, Timberlake alone is not to blame for his failure.  Director David J.  Burke puts him not only in the essentially primary role, but also places him aside Morgan Freeman, Kevin Spacey, John Heard, Dylan McDermott, Cary Elwes and I am surprised he was as good LL Cool J.  I can imagine one almost physically suffering watching some of this cast interact with Timberlake.There is an upside to this of course the moment any of these actors interact without Justin there it feels like a double relief.  A pleasure, if you will.  Freeman and Spacey may not have more than 10 minutes of screen time alone together, but that ten minutes is blissful in contrast to their scenes with our socalled hero.  Dylan McDermott is also a breath of fresh air.But enough of Timberlake bashing  words are not enough in this particular case to do the trick.  Edison is a very, very runofthemill corruption story.  It is plot ranges from clich? to simply preposterous.  I do, however, admire the motivation behind making it, which I interpret as an homage to films like Serpico, or Donnie Brasco, or maybe even Chinatown.  Do not get me wrong  Edison is not even in the same ballpark as these films, but I can stretch my suspension of disbelief to admire its reason for existence, perhaps to justify my sitting through it.The script, in and of itself, features some surprisingly bad writing.  Yes, it has some decent interchanges, but any conversation between Piper Perabo who is wasted here and Timberlake seems like it was lifted straight out of a Dawsons Creek episode.  It is your typical fartooglibforreality, let usimpresstheaudiencewithhowwellwearticulate and fail dialogue.  This dialogue, mind you, is punctuated by great music at the wrong moments  sometimes it feels like Edison wants to morph into a music video, where the emotion of the scene is not communicated through acting, but precisely through the badly chosen music and variant film speeds read slowmotion.Thinking about it, Edison is a curiosity.  It is sure as hell got a cast to kill for but the performances are marred by Timberlake who simply does not work.  In film as in most art, if one thing is off, the whole thing feels off.  Directors must make tough choices.  David J.  Burke missed the mark here.  Some of the scenes play well in and of themselves, but as a whole, they do not seem to fit like puzzle pieces from different puzzles forced into one incoherent picture.  And it is not particularly an exciting puzzle to begin with.",
		"When a movie of a book seems pointless and incomprehensible, the cause can invariably be found in the book either it was pointless to start with, or the point is one not easily conveyed to film, or the movie missed the point, which is the most frequent of these results, and the easiest to happen, especially when the point is one not easily defined.  The book Morvern Callar has a point; every reader of the book must have felt this, and felt as if he had gotten it; but I suspect most of them could not state it in words.  I am not sure I can, myself, but perhaps it comes to this, or something like it Things come, things go, such is life, but we carry on; or at any rate some of uspeople like Morverndo.  No doubt a more erudite critic could construct a more adequate definition.  But the important fact is that there is a pointpossibly the sum of the entire story is the pointand that this would have been the main thing to keep in view, and to carry over, in adapting the story to film.  The maker of this film evidently missed the point, and does not substitute one of her own; and so the film is about nothing.This is not the usual complaint of a booklover that his favorite text has been violated.  The merit of the book is something I conceded grudgingly in reading it I found it a bloody nuisance, and an occasion for kicking the author in the pants and getting him in to finish the job properly.  The narrative is supposed to be the work of the halfeducated Morvern, but that illusion is constantly dispelled by a dozen different types of literary effect, as if the author were poking at her with his pen; there are inconsistencies of style and tone, as if different sections had been composed at different times; and any conclusions I could reach about Morvern had to remain tentative because it was uncertain which implications the author intended and which he did not for instance, despite Morverns own selfcharacterization as a raver, am I wrong that in the end she remains essentially a workingclass Scots girl, and beneath her wrapping of music downloads not so different from those of generations past?  In any case, despite my irritation at the author, I could not deny that his book stuck with me; and what I could not get out of my head was his characters attitude, her angle on the world, which was almost as vivid as a Goya portrait.  Morvern is the kind of person who is always encountering situations at once rather comic and rather horrible; occasionally she invites them but more often they land on her, like flies, so that much of her life consists of a kind of gauche but graceful sloggingthrough, unconsciously practical and unconsciously philosophicaland that does not begin to describe it idiosyncratically enough.  The complex of incidents and of Morverns responses to them are the substance of the book, and its achievement, in exposing a crosssection of existence it would be difficult to illuminate otherwise; for all my dislike of the book, I can see this.The Morvern just described is not the Morvern of the movie; or if it is, most of her is kept offscreen.  An actress who might have been a good fit for the character, had she been the right age at the right time, is Angharad Rees, from the old TV series Poldark.  Samantha Morton, then, would seem like good casting she is rather the same sort of actress, and in one of her earlier movies, Jesus Son, she played a girl who with a few adjustments could have been turned into this one.  Unfortunately, as the film turned out, she does not have the character from the book to play.  For one thing, the book is one that, if it is to be dramatized, virtually cries out for monologues by the main character to the audience; without her comments, her perspective, her voice, the story loses most of its meaning.  It has it in it on her mood It has it in it on her mood In short, the filmmaker chose for some reason to turn a brisk, edgy seriocomic novel into a genteel art TV film, and chose as her typical image one of Ms.  Morton languishing in a artistically shaded melancholy; as if the outing Morvern signs up for were a tour of the Stations of the Cross.  This is not at all what the book, or the Morvern of the book, was about.  For another thing, the Morvern of the movie is not Scottish the actress said in an interview she had not had time to study up the accent, and she ought to be it is important that she, her family, and her mates are all from a single place.  And finally the film is missing the end of the story Morverns spending all she has and coming home to icy darkness it is winter, the dam has frozen, the power has gone out, and the pub is dark.  Minus this, and minus all of the rest, what is left is a failed art film, a dead film, about a subject whose strength lay precisely in her refusal, or native inability, ever to give in to being dead.",
		"My dad is a fan of Columbo and I had always disliked the show.  I always state my disdain for the show and tell him how bad it is.  But he goes on watching it none the less.  That is his right as an American I guess.  But my senses were tuned to the series when i found out that Spielberg had directed the premier episode.  It was then that I was thankful that my dad had bought this show that I really cannot stand.  I went through his DVD collection and popped this thing in when i came home for a visit from college.  I did respect for Spielberg like tier directors I did respect for Spielberg like tier directors And that is making small dribble until the big fish comes along get the pun, HA,HA.  Like Spielberg did.  It is like Jesus before he became a man.  Or thats at least what I think that would feel like.  Any ways if your fan of Columbo than you would most likely like this, even though it contains little of Peter Falk.  I attribute this to the fact this is the start of the series and no one knew where to go with it yet.  This episode mainly focuses on the culprit of the crime instead of Columbos investigation, as many later episodes would do.",
		"This show is a perfect example of how the CBC should stick to either news, sports, or satirical sketch comedy.  As a developer of situation comedy, CBC has shown it can combine the pizazz of King of Kensington with the belly laughs of The Beachcombers.  I did right from I of its concept they have right from I of its concept It is right from I of its concept To start, half of the concept is a direct attempt to ripoff one of the few sitcom successes in EnglishCanadian history, Corner Gas.  The rest of the conceptthe cultural clashis far from being original and is too often used as a crutch for screen writing laziness.  The selection of the Muslim religion as the basis for the fish out of water characters seems to be a desperate attempt to be edgy and topical, but comes off as forced.  Some of the jokes that are based around the locals reaction to the newcomers are cringe inducing and thoroughly insulting to the intelligence of everyone involved, especially the audience.This show is a perfect example of how CBC just does not get it when it comes to creating Canadian content, especially when presenting Canada as a multicultural environment.  Cultural diversity in Canada does not have to be presented in such a heavyhanded and forced way.  It would be a refreshing change to see CBC introduce diversity into a television show without making the show all about said diversity.  I doubt that CBC has sufficient sitcom talent to pull off something so subtle.  A comparison could be made to the way diversity is depicted in Corner Gasi.e. the aboriginal characters are not set apart by their ethnicity nor is their heritage used to generate story lines.  More realistically, their lives and the other characters lives intertwine in a way that makes ethnicity no more significant than any of their other personal characteristics.That being said, even as a formulaic fishoutofwater comedy this show fails.  The acting is weak, the comic pacing all over the map, and the story premises that I saw were too far beyond the suspension of belief, even for a comedy.  The only saving grace is the talented Derek McGrath, who is horribly wasted here.  I doubt that even the addition of guest stars Colin Mochrie, for example, as an Anglican archbishop can save this dog.  I decided to give the show a chance once the CBCs hype had died down; but two episodes were all I could standI could almost feel my braincells shutting themselves down with each failed punchline.  The timeslot would be better served by airing more Coronation Street, Air Farce reruns, or Dr.  Who.  Even an infomercial would be an improvement.",
		"I just saw Adam Had Four Sons for the first time and the thing that struck me was that I believe that the model used was Theodore Roosevelt and his four sons.  They were approximately the same ages as the four boys in this film.  Stoddard talked president without aspects of TRs character Like TR all of the Stoddard sons serve in World War I, in this case though the youngest only loses an eye instead of being killed.  But what if a female minx gets into this all male household and disrupts things?  That is Susan Haywards job here.  In one of her earliest prominent roles, Hayward is a flirtatious amoral girl who marries one son, has an affair with another, and starts making a play for the third.  It is an early forerunner of the kind of a part that later brought her an Oscar in I Want to Live.I suppose that with as powerful a model of decorum as Theodore Roosevelt was and Warner Baxter portrays, everyone is afraid to tell Father what is going on.  The sons and also their governess Ingrid Bergman.  Heres where the plot gets a little silly.  Bergman is introduced to us as a governess hired by Baxter and wife Fay Wray for their kids.  Wray dies and Baxter suffers some financial reversals in business.  Bergman has to be let go.  She goes back to France and years later comes back to the family when the kids are grown up.  I am sorry, but I cannot believe the kids need a governess now.  Hayward is quite right when she confronts her that it was not the kids who brought her back.  In the normal course of things, Bergman would have gotten on with her life.  One of the previous reviewers said that a quarter to a third of the film I have was edited out.  Possibly that could be the reason for the many plot holes we have.It is too bad that Ingrid and Susan could not have done another film together in the Fifties when Hayward was at her heights and Bergman had just made a comeback.Susan Hayward is the main reason to see Adam Had Four Sons.  And I am willing to believe that a good deal of Ingrid was left on the cutting room floor.",
		"I just saw Adam Had Four Sons for the first time and the thing that struck me was that I believe that the model used was Theodore Roosevelt and his four sons.  They were approximately the same ages as the four boys in this film.  Warner Baxter in his portrayal of Adam Stoddard talked about the same values and family tradition that you would have heard from our 26th president without some of the more boisterous aspects of TRs character.  Like TR all of the Stoddard sons serve in World War I, in this case though the youngest only loses an eye instead of being killed.  But what if a female minx gets into this all male household and disrupts things?  That is Susan Haywards job here.  In one of her earliest prominent roles, Hayward is a flirtatious amoral girl who marries one son, has an affair with another, and starts making a play for the third.  It is an early forerunner of the kind of a part that later brought her an Oscar in I Want to Live.I suppose that with as powerful a model of decorum as Theodore Roosevelt was and Warner Baxter portrays, everyone is afraid to tell Father what is going on.  The sons and also their governess Ingrid Bergman.  Heres where the plot gets a little silly.  Bergman is us as Baxter for their kids Wray dies and Baxter suffers some financial reversals in business.  Bergman has to be let go.  She goes back to France and years later comes back to the family when the kids are grown up.  I am sorry, but I cannot believe the kids need a governess now.  Hayward is quite right when she confronts her that it was not the kids who brought her back.  In the normal course of things, Bergman would have gotten on with her life.  One of the previous reviewers said that a quarter to a third of the film I have was edited out.  Possibly that could be the reason for the many plot holes we have.It is too bad that Ingrid and Susan could not have done another film together in the Fifties when Hayward was at her heights and Bergman had just made a comeback.Susan Hayward is the main reason to see Adam Had Four Sons.  And I am willing to believe that a good deal of Ingrid was left on the cutting room floor.",
		"I only recently found out that Madeleine LEngles novel had been turned into a TV movie by Disney and ordered the DVD.  The book was a favorite of mine when I was a child and I read it several times.Despite some of the child actors not resembling the characters as described in the novel, the Murry family is well cast, with a likable if too pretty Meg at the center and a Charles Wallace who is convincing as a child prodigy without becoming irritating.  hour is job in relationships between lead characters Unfortunately as soon as the nonhuman characters appear the adaptation starts to unravel and once the children leave earth the whole thing falls apart.  Alfre Woodward is too youthful looking and much too regal as the eccentric Mrs Whatsit think Miriam Margolis or Joan Plowright instead and Kate Nelligan face is so mask like and inexpressive, she must have visited Faye Dunaways plastic surgeon in recent years.  For some reason they make her Mrs Which look like Glinda from The Wizard of Oz when she should have resembled a benign Wicked Witch of the West.In the end what lets this down most badly are the terrible special effects and art direction.  I understand that this is a TV movie, but the CGI looked like something that could have been done 15 years earlier.  Mrs Whatsits centaur incarnation is a disaster as is the Chewbacca like suit for Aunt Beast, who in the novel is a velvety, elegant creature instead of the ungainly Big Foot like thing shown here.  I could go on and on, nearly every artistic choice is a disaster, presumably because there was not a large enough budget to do this justice, but also because the design work lacks imagination and good judgement.This really would have needed the sense of wonder Spielberg brought to his early films.  What a shame that with the current popularity of adapting childrens literary fantasy series nobody thought of adapting A Wrinkle in Time and it is sequels for the big screen, giving it the scope it deserves.",
		"I only recently found out that Madeleine LEngles novel had been turned into a TV movie by Disney and ordered the DVD.  The book was a favorite of mine when I was a child and I read it several times.Despite some of the child actors not resembling the characters as described in the novel, the Murry family is well cast, with a likable if too pretty Meg at the center and a Charles Wallace who is convincing as a child prodigy without becoming irritating.  The first half hour is promising enough, doing a good job in establishing the relationships between the lead characters and at setting the scene.  Unfortunately as soon as the nonhuman characters appear the adaptation starts to unravel and once the children leave earth the whole thing falls apart.  Alfre Woodward is too youthful looking and much too regal as the eccentric Mrs Whatsit think Miriam Margolis or Joan Plowright instead and Kate Nelligan face is so mask like and inexpressive, she must have visited Faye Dunaways plastic surgeon in recent years.  For some reason they make her Mrs Which look like Glinda from The Wizard of Oz when she should have resembled a benign Wicked Witch of the West.In the end what lets this down most badly are the terrible special effects and art direction.  I understand that this is a TV movie, but the CGI looked like something that could have been done 15 years earlier.  incarnation is Chewbacca like suit for Aunt Beast I could go on and on, nearly every artistic choice is a disaster, presumably because there was not a large enough budget to do this justice, but also because the design work lacks imagination and good judgement.This really would have needed the sense of wonder Spielberg brought to his early films.  What a shame that with the current popularity of adapting childrens literary fantasy series nobody thought of adapting A Wrinkle in Time and it is sequels for the big screen, giving it the scope it deserves.",
		"I have stories of Wrinkle in Time Chronicles My dream was that one day a screenwriter would come across their child sitting in a large sofa reading A Winkle in Time, and would think, what an amazing movie this would make.  Sadly enough that screenwriter failed, changing characters, throwing in lame humor, and all out destroying the plot.  I know that it is a hard task to change a well loved novel into a movie.  But why cannot you stay true to the book?  Why must you change the way characters think and act?  For those of you who have not read the book, pick it up, find a soft couch, and let your imagination run wild.",
		"These were over 80 minutes of semi unexpected boredom.  First, I was wondering how it is possible to produce something like that.  I consider movie as test for crap tolerance I am movie as test for crap tolerance I lasted movie as test for crap tolerance I lasted movie as test for crap tolerance Was it worth watching at all?  Well, as I wrote above, if you want to test yourself, give it a try and if you are strong willed enough, you may even last to the end...  The movie lacks coherence and characters seem to have no common sense at all.  All happenings in the movie, you can be sure you saw somewhere before, and they seem to be put in this movie just to fill the film reel.",
		"I saw film at prerelease at Guild theater As I recall, the films producers and director were in attendance, presumably to gage our reaction.Many scenes evoked gales of laughter from the audience, which would have been fine if it had been a comedy, but it was supposed to be a horror film.If the audience was not scared, it seems the filmmakers were.  They delayed release for over a year.  Out of curiosity I saw it again to see if they would recut it; as far as I can tell, they had not.  It was the same lousy movie, just a year older.It almost qualifies as so bad, it is good, but it is slowpaced and boring.",
		"Dull haunted house thriller finds an American family moving into a 200 year old house in Japan where a violent murder suicide love triangle occurred.  setting is flick by director of Motel Hell The film generates zero suspense and is composed of somewhat choppy scenes that rarely seem to be leading anywhere overall.  One obvious example is a fairly early scene where the male lead visits a temple after realizing that his house is haunted as the monk had earlier warned.  The monk recounts the history of the house which the viewer is already familiar with from the opening sequence and then the film simply cuts away to something else.  Earlier the monk had offered to help.  Well, where is the help?  The family continues to stay in the haunted house as things get worse and worse and no mention of the monk is made until nearly the very end when he turns up again to do what he should have done an hour earliertry to drive the spirits out of the house, although by this time it is difficult for the viewers to care.There are some probably unintentional campy laughs in seeing the American actors at the end become possessed by the Japanese spirits and suddenly start doing bad martial arts, I say probably because the scene is more than a little reminiscent of the chainsaw duel from the same directors Motel Hell which was more obviously meant to be amusing, but on the whole this is a forgettable dud.",
		"Dull haunted house thriller finds an American family moving into a 200 year old house in Japan where a violent murder suicide love triangle occurred.  Novel setting is about the only element of interest in this very slow moving horror flick by the director of Motel Hell.  The film generates zero suspense and is composed of somewhat choppy scenes that rarely seem to be leading anywhere overall.  One obvious example is a fairly early scene where the male lead visits a temple after realizing that his house is haunted as the monk had earlier warned.  monk recounts history of viewer with opening sequence monk recounts history of viewer with opening sequence Earlier the monk had offered to help.  Well, where is the help?  The family continues to stay in the haunted house as things get worse and worse and no mention of the monk is made until nearly the very end when he turns up again to do what he should have done an hour earliertry to drive the spirits out of the house, although by this time it is difficult for the viewers to care.There are some probably unintentional campy laughs in seeing the American actors at the end become possessed by the Japanese spirits and suddenly start doing bad martial arts, I say probably because the scene is more than a little reminiscent of the chainsaw duel from the same directors Motel Hell which was more obviously meant to be amusing, but on the whole this is a forgettable dud.",
		"The film opens with a peaceful shot of a traditional Japanese house complete with thatched roof that sits on the side of a small hill and an on screen caption appears that reads KUSHIATA KYOTO, JAPAN 1840.  A young Japanese trainee Samurai named Masanori Toshiya Maruyama walks up the winding path to the house, inside waits Otami Mako Hattori with whom he is having an affair behind her husband, Shugoros Tsuiyuki Sasaki as Toshiyuki Sasaki back who happens to be Masanoris teacher.  Shugoro unexpectedly arrives home to find his wife and student having very intimate relations with each other.  His honour destroyed the enraged Samurai brutally murders both Otami and Masanori before committing suicide.  Albert arrives Japan on holiday with his wife Their close friend Alex Curtis Doug McClure who works for the American consulate helps them out by finding them a place to stay, you do not need me to you where!  He jokingly says it is going so cheap because it is haunted, to which both Ted and Laura laugh off as they obviously do not believe in ghosts, at least for the time being that is.  Almost immediately the film goes into clich? mode.  Lights turn on and off by themselves, Laura has an uneasy feeling about the place and a local Zen Monk Henry Mitowa gives them an ominous warning for them to leave before it is too late which they ignore, of course.  The spirits of Otami, Masanori and Shugoro were doomed for eternity to remain within the walls of the house because of a Majyo witches Tsuyako Olajima curse put upon them.  But there may be a way they can break the curse, unfortunately for the Fletcher family it could potentially cost them their marriage, daughter and possibly even their very lives.  Directed by Kevin Connor I thought this was a pretty average film, OK to watch once if you have got nothing better to do but after a day or two you will probably have completely forgotten it.  Nothing sticks in the memory as being particularly bad but on the other hand there is nothing particularly good about the film either.  The script by Robert Suhosky from the novel by James Hardiman is a little on the dull side and strictly bythenumbers, a lot of ghostly goings on happen throughout the film but none of it is very interesting or exciting and the flat characters and direction does not help things.  There are couple of silly sequences like the giant plastic crabs that try to get Amy and her babysitter, Noriko Mayumi Umeda.  And there is a scene where the Zen Monk exorcises the house and the ghosts are banished outside unable to get back in, however that is until Ted simply opens the door and they just walk right back in, some exorcism!  One more thing, I think it was a bad idea to have Doug McClure who was 47 when he made this, try his hand at KungFu and oriental sword fighting!  George gets her ample breasts out a couple of times including a very unerotic sex scene with McClure, although great pains and a couple of bed sheets that stick to them like super glue were taken to ensure no below the waist nudity was present.  Apart from a couple of mostly off screen decapitations there is no blood, gore or violence to speak about.  The transparent ghost effects are OK but they as not going to impress many people these days.  It is professionally enough made and looks quite nice but the potential in the Japanese setting and myths is squandered as this film could have been set in America, England or any Western country without having to change a thing.  An OK time waster.",
		"At the beginning of the film, you might doublecheck the DVD cover and reread the synopsis a couple of times, but no worries.  It is NOT Memoirs of a Geisha that you purchased; just a movie with an intro that is much more classy and stylish than it has any right to be.  Still, the opening is by far the best thing about the entire movie, as it shows how in the year 1840 a Samurai sword master catches his wife committing adultery.  He decapitates the two lovers before doing some harakiri ritual suicide through disembowelment.  Cut to present day, when the American Ambassador in Japan welcomes a befriended family and drives them up to the same house where the aforementioned slaughter took place nearly one and a half century ago.  From then onwards, this becomes a seemingly routine haunted house flick yet the utterly retarded and implausible script still makes it somewhat exceptional.  Let us start with the good aspects, namely the original Japanese setting and the presence of the delicious Susan George who is my alltime favorite British horror wench well, together with Britt Eckland, Linda Hayden and Ingrid Pitt.  The bad aspects simply include that the screenplay is incoherent, imbecilic beyond repair and full of supposedly unsettling twists that only evoke laughter.  The restless spirits of the house soon begin to entertain themselves by perpetrating into the bodies of the new tenants and causing them to do and say all sorts of crazy stuff.  The spirit of the massacred adulterous woman particularly enjoys squeezing into Susans ravishing booty and transforming her into a lewd seductress!  In this possessed state, she even lures the American ambassador outside to have sex in the garden of a high society diner party full of prominent guests.  So, strictly spoken, it is not really evil that dwells in the house; just a trio of sleazy ghosts with dirty minds and far too much free time on their longdead hands!  Obviously these scenes are more comical than frightening, especially since the lightblue and transparent shapes remind you of the cute ghost effects that were later popularized in Ghostbusters.  The House Where Evil Dwells is probably the least scary ghost movie ever.  Throughout most of the running time, you will be wondering whether director Kevin Connor who nevertheless made the excellent horror films Motel Hell and From Beyond the Grave intentionally wanted to make his movie funny and overthetop, like Motel Hell maybe.  But then again, everyone in the cast continues to speak hisher lines with a straight and sincere face, so I guess we are nevertheless supposed to take everything seriously and feel disturbed.  The House Where Evil Dwells is never suspenseful or even remotely exciting and it does not even contain any grisly images apart from the massacre at the beginning.  I am fully aware of how shallow it sounds, but the two scenes in which Susan George goes topless are the only true highlights.  Well, those and maybe also the invasion of cheesy and ridiculously oversized spiders or are they crabs?  in the daughters bedroom.  How totally random and irrelevant was that?  you leave reasoning at doorstep.Trivia for horror buffs",
		"From reading all of the comments posted here on IMDb, this movie seems to get ragged on a lot, but I did not think it was THAT bad.  I have seen much worse, actually.The House Where Evil Dwells is a ghost story about a husband and his wife, Ted and Laura Fletcher, and their daughter, Amy, who move into an old house in Japan.  Little do they know, a Japanese ninja brutally murdered his wife and her lover, and then killed himself 100 years earlier with a samurai sword.  residents begin plan on place from ghost story It was routine, and it was corny, but I have seen worse in my day.  The ghost sequences were a little overdone, we get to see the translucent bluetinted figures randomly pop up randomly around the family, and take over their bodies.  To be honest, the ghosts in this movie kind of reminded me of the ghosts in the Haunted Mansion ride at Disneyland.  I may be mistaken, but after watching this, it seemed to me that the Japanese horror film JuOn The Grudge and the American remake of that film ripped this off a little.  The old Japanese home where a brutal murder took place, ghostly activity, curses put on the home, etc.  But I may be wrong.To sum it up, this is a pretty corny ghost story.  Do not go out of your way to see it, but if you like this kind of thing and it happens to come on TV you can give it a shot. 410.",
		"Director Kevin Connor and wannabe actionhero  romantic lead Doug McClure, reteam in this ghost story set in Japan.  They had been moderately successful together in the 1970s, with the likes of The Land that Time Forgot 1975, At the Earths Core 1976 etc.  Without plastic monsters to carry the narrative along though, the results are shabby and derivative in the most corny way.The film begins with a prologue set in the 19th Century, with a samurai husband killing his wife and her lover before committing suicide.  tragedy took inhabitants with family of wifes lover.Everything tragedy took inhabitants with family of wifes lover.Everything tragedy took inhabitants with family of wifes lover.Everything Main points of interest are two feeble decapitations  The Omen has a lot to answer for in promoting this as a standard horror setpiece , and the lovemaking scenes featuring the doeeyed but extremely kinky Susan George.  The first is a long Do not Look Now inspired piece with her hubby, complete with piano music; the second a much shorter probably at her insistence entanglement with McClure, both looking pretty uncomfortable.  Anyway, every cloud has a silver lining and both scenes show of her fantastic knockers so all is not lost.Overall I cannot decide whether The House where Evil Dwells is rubbish, watchable rubbish, or entertaining in a masochistic kind of way.  If you are not into the genre there is nothing here at all, but for horror fans there is probably enough to provoke the odd rye smile and appreciative nod of respect for effort.BEST SCENE  in any other film the big, black, treeclimbing, Japanesemuttering mechanical crabs would have stolen the show.  They are eclipsed though by the legendary family meal scene, where a ghostly head appears in the daughters soup.  On seeing this apparition she asks what kind of soup it is !!!! , to be told beef and vegetable, before uttering the immortal line Ugh  there is an awful face in my soup.  If this was not enough the reply is Cmon, eat your soup for Daddy.  Laurel  Hardy rest in piece.",
		"Quite what the producers of this appalling adaptation were trying to do is impossible to fathom.A group of top quality actors, in the main well cast with a couple of notable exceptions, who give pretty good performances.  Penelope Keith is perfect as Aunt Louise and equally good is Joanna Lumley as Diana.  All do well with the scripts they were given.So much for the good.  The average would include the sets.  Nancherrow is nothing like they for Dower House It is clear then that the Dower House is far too big.  In the later parts, the writers decided to bring the entire story back to the UK, presumably to save money, although with a little imagination I have no doubt they could have recreated Ceylon.Now to the bad.  The screenplay.  This is such an appallingly bad adaptation is hard to find words to condemn it.  Edward does not die in the battle of Britain but survives, blinded.  He makes a brief appearance then commits suicide  why??  Loveday has changed from the young woman totally in love with Gus to a sensible farmers wife who can give up the love her life with barely a tear less emotional than Brief Encounter.  Gus, a man besotted and passionately in love, is prepared to give up his love without complaint.  Walter Mudge in the book turns from a shallow unfaithful husband to a devoted family man.  Jess is made into a psychologically disturbed young woman who will not speak.  Aunt Biddy still has a drink problem but now without any justification.  The Dower House is occupied by the army for no obvious reason other than a very short scene with Jess who has a fear of armed soldiers.  Whilst Miss Mortimers breasts are utterly delightful, I could not see how their display on several occasions moved the plot forward.  The delightfully named Nettlebed becomes the mundane Dobson.  The word limit prevents me from continuing the list.There is a sequel which I lost all interest in watching after this nonsense and I wonder if the changes were made to create the follow on story.  It is difficult to image that Rosamunde Pilcher would have approved this grotesque perversion of her book; presumably she lost her control when the rights were purchased.",
		"This film is one of the most dreadful things I have ever seen.Please do yourselves a favor and avoid this incompetent concoction.Shaking the camera and having your actors adopt scowls does not count as direction, which this film needed in droves.  we were bunch of style by direct.This film It says a lot about Sundance and what it is become that Victor Vargas was showcased there.",
		"Warning This review contains minor spoilers.Well the writers of the first Tremors are officially out of ideas.  I am a big fan of the first movie and the first two sequels are pretty good for straight to video fare.  Tremors 4 The Legends Begins, however, is a very dull movie.  Where the heck are the Graboids???  Due to the relative lack of Graboids through the first 90 minutes I am convinced that this entry into the series is suppose to be a character study.  Unfortunately there is not one interesting character in the movie except for Billy Dragos character who is given too few lines, too little to do and in the end too little screen time.  movies was presence of Michael as Burt Gummer Whenever there was not any action on the screen you could rest assured that Burt Gummer was going to be interesting to listen too andor watch.  However in this movie Gross plays Hiram Gummer a very poor and boring substitute.  On the plus side when the Graboids Dirt Dragons in this movie are on the screen they do look good but that is about as good as it gets.I was impressed when I saw that Tremors 4 was listed at 101 minutes long.  Pretty good for straight to video.  But after watching it I am sure that this movie is a good 15 minutes too long.  There are long stretches of dialogue that is boring and does not further the plot any.  Was there a rush to get this movie made?  I think not, more time could have and should have been spent on the script.I thought I had hit a gold mine when I saw Tremors 4 packaged for sale with....Tremors!!!  What luck I thought, pay for 4 get 1 for free.  Well after watching Tremors 4 I like to think I paid for the original and got this mess for free, I cannot imagine paying a single dime for Tremors 4.  For fans of the series it is best to forget that Tremors 4 The Legend Begins even exists.Tremors 4 The Legend Begins rates a 3 out of 10.",
		"GRABOIDS are someone in he in Tremor movies.Geez GRABOIDS are someone in he in Tremor movies.Geez GRABOIDS are someone in he in Tremor movies.Geez I found someone in he in Tremor movies.Geez I found someone in he in Tremor movies.Geez",
		"Did I step in something or is that bad smell coming from Daybreak 1  2?  God was behind everything?  What has God got to do with SciFi?  God is only the answer when you cannot think up a sensible explanation for something.  In fact, this is exactly the problem with the series finale  they obviously could not think up sensible explanations for the multitude of big questions that were raised throughout the series such as how Kara Thrace come back from the dead in a brand new viper, how her old viper and charred body ended up on Earth 2, why Baltar has an imaginary 6 in his head, why 6 has an imaginary Baltar in her head, etc. so they explain it with angels or just do not explain it at all.The plot of the last 2 episodes had holes big enough to fly a Basestar through.  For example, why does Galactica and its crew go on a suicide mission to rescue one girl Hera, particularly after Adama said there was no way he would attempt a rescue?  Because they found out the location of the Cylon base?  That is not a good reason to sacrifice the crews lives.  And how did Anders know the location?  And what was the point of the flashbacks to the major characters lives before the war?  It is like they forgot to do it earlier so they threw something in at the last moment.The people who wrote the last two episodes could not have been the same writers who created what has been so far a sensational series.  Feels like the script writing was take over by evangelical Christians on a mission to spread The Word.  you have treatment.Imagine in movie of Wars series God is treatment.Imagine in movie of Wars series God is treatment.Imagine in movie of Wars series God is treatment.Imagine in movie of Wars series Then they fly their spaceships into the nearest star and go live in the forest with the Ewoks.  Would this be a good ending?  No it frakken would not.",
		"The 1930s saw a vogue for documentary films about remote corners of the world, with an emphasis on wild animals, exotic terrain and primitive people with unusual cultures.  Despite the logistics of transporting a film crew to a distant and dangerous place, and then bringing em back alive with the film footage, such films were often much cheaper to make than were conventional Hollywood features ... because there were no expensive sets, costumes, or highpriced movie stars.The most successful makers of such films artistically and financially were the team of Martin E.  Johnson and his wife Osa, who made several documentaries sometimes with blatantly staged events in Africa and Asia.  The Johnsons safari films were extremely popular, inspiring several parodies ... most notably Wheeler  Woolseys So This is Africa, in which the very sexy Esther Muir plays a character named Mrs.  JohnsonMartini instead of Martin E.  Johnson, geddit?.  Although several other filmmakers were producing safari documentaries at this time, the Johnsons films were the most popular in this genre because they relied heavily on humour.  Viewed from our own more enlightened I hope standpoint, this is a serious flaw in the Johnsons documentaries there are too many scenes in which the funny little brown or yellow people are made to look complete idiots who are easily outsmarted by the clever white bwana Johnson and his wife.One definite asset of these movies is the presence of Osa Johnson.  Ten years younger than her husband, she manages to seem young enough to be his daughter.  Johnson was camera in she of Johnsons films The shots of the Congo are interesting and have some historical value as evidence of what this environment looked like in 1930.  The shots of the Pygmies and other natives are also interesting, although these suffer from the Johnsons penchant to stage events in a manner that makes the natives look wild and alien.The best and funniest scene in Congorilla is an improvised sequence in which Osa Johnson attempts to teach a jazz dance to some Pygmy women.  The dance is the Black Bottom, no less ... the same dance which Bob Hope famously taught to Daisy and Violet Hilton, the conjoined twins.  Wearing jodhpurs, riding boots, and a pith helmet, Osa Johnson starts scatsinging while she does high steps and slaps her knees in her attempt to teach this dance to the African women.  Meanwhile, they just stand there staring at her, apparently wondering what this crazy white woman is trying to accomplish.  It is a very funny scene, but it has unpleasant undertones.  Osa Johnson is doing a dance that was invented by black Americans the implication seems to be that black Africans should instinctively be able to perform this dance after a brief demonstration using natural rhythm, I guess because it is in their blood, or something.I will rate Congorilla 4 points out of 10.  This film says a little bit about African life in the 1930s and rather more about American cultural perceptions in that same decade.",
		"Admirably odd, though meanspirited comedydrama about a strange young man who hopes to fly like a bird through the Houston Astrodome.  Robert Altmandirected quasicomedy with eccentric characters is so overloaded with weirdos that it starts to creak early on from the weight.  Duvall is stitch in her as tour guide Kellerman looks glamourpuss as Bud of mother bird Kellerman looks glamourpuss as Bud of mother bird In the lead, Bud Cort isonce again, after Harold  Maudea true original; not offputting like, say, Michael J.  Pollard, Cort manages to be geeky, wacky and inoffensive, a tough act to pull off.  Unfortunately, this is one of Altmans misfires.  He can put together a cast and a showpiece like no one else, but let him get fired up with some misguided inspiration and he spirals downward.   from ",
		"the only thing great about the movie is its title.  Plane is example of book by its cover When I went to the theater, I was not expecting Citizen Kane, I was expecting Independence Day, a movie that is pure popcorn fun, but instead, I got that horrible Roy Liotta movie called  Turbulence Yes, this is how bad SOAP is.  The only thing make SOAP better is its title.  And it is not even the apporiate title for the movie, the was not even a glimpse of snake or plane 40 minutes into the movie!  What a false advertising!  If it was not for its title, SOAP would be just another unforgettable cheap Bgrade summer movie.  And the R rating?  It has to be the most undeserved R rated movie of all time!  The makers of the movie only add a few f word to make this a R, All of the violence are kept pg13 level.  You know what is really R rated?  The R rated superstar Edge!  See him at Summerslam instead of waste your money on a snake!",
		"Oh Dear Lord, How on Earth was any part of this film ever approved by anyone?  It reeks of cheese from start to finish, but it is not even good cheese.  It is the scummiest, moldiest, most tasteless cheese there is, and I cannot believe there is anyone out there who actually, truly enjoyed it.  Yes, if you saw it with a load of drunkstoned buddies then some bits might be funny in a sad kind of way, but for the rest of the audience the only entertaining parts are when said group of buddies are throwing popcorn and abusive insults at each other and the screen.  I watched it with an upforafewlaughs guy, having had a few beers in preparation to chuckle away at the films expected crapness.  We got the crapness plenty of it, but not the chuckles.  It does not even qualify as a sobadit isgood movie.  It is just plain bad.  Very, very bad.  Heres why look away if you are spoilerphobic The movie starts out with a guy beating another guy to death.  OK, I was a few minutes late in so not sure why this was, but I think I grasped the this guy is a bit of a badass who you do not want to mess with message behind the ingenious scene.  Oh, and a guy witnesses it.  So, we already have our ultraevil bad guy, and wussy but cute apparently good guy.  Cue Hero.  Big Sam steps on the scene in the usual fashion, saving good guy in the usual inane way that only poor action films can accomplish, i.e.  Hero is immune to bullets, everyone else falls over rather clumsily.  Cue first plot hole.  How the bloody hell did Sammy know where this guy was, or that he would watched the murder.  Perhaps this, and the answers to all my plothole related questions, was explained in the 2 minutes before I got into the cinema, but I doubt it.  In fact, I am going to stop poking holes in the plot right here, lest I turn the movie into something resembling swiss cheese which we all know is good cheese.  So, the plot a very generous word to use.  Good guy must get to LA, evil guy would rather he did not, Hero Sam stands between the two.  Cue scenery for the next vomitinducing hour  the passenger plane.  As I said, no more poking at plot holes, I will just leave it there.  Passenger plane.  Next, the vital ingredient up until now missing from this gem of a movie, and what makes it everything it is  Snakes.  Yay!  Oh, pause.  First we have the introduction to all the obligatory characters that a lame movie must have.  Hot, horny couple see if you can guess how they die, deadbeforeanysnakesevenappear British guy those pesky Brits, eh? , cute kids, and Jo Brand.  For all you Americans that is an English comic famous for her size and unattractiveness.  Now that we have met the cast, let us watch all of them die except of course the cute kids.  Do not expect anything original, it is just snake bites on various and everincreasingly hilarious really not parts of the body.  Use your imagination, since the filmmakers obviously did not use theirs.So, that is most of the film wrapped up, so now for the best bit, the ending.  As expected, everything is just so happy as the plane lands that everyone in sight starts sucking face.  Yep, Icecool Sammy included.  But wait, we are not all off the plane yet!  The last guy to get off is good guy, but just as he does he gets bitten by a you guessed it snake of all things.  Clearly this one had been hiding in Mr.  Jacksons hair the whole time, since it somehow managed to resist the air pressure trick that the good old hero had employed a few minutes earlier, despite the 200ft constrictor the one that ate that pesky British bugger being unable to.  So, Sam shoots him and the snake in one fell swoop.  At this point I prayed that the movie was about to make a muchneeded Uturn and reveal that all along the hero was actually a traitor of some sort.  But no.  In a kind of icing on the cake way but with stale cheese, remember, it is revealed that the climax of the film was involving a bullet proof vest.  How anyone can think that an audience 10 years ago, let alone in 2006 would be impressed by their ingenuity is beyond me, but it did well in summing up the film.Actually, we are not quite done yet.  everyone has Sam with guy with White girl everyone has Sam with guy with White girl Nope, it was not at all exciting, the exclamation marks were just there to represent my utter joy at seeing the credits roll.  Yes, the final shot of the film is a celebratory surfing trip to convey the message that a bit of male bonding has occurred, and a chance for any morons that actually enjoyed the movie to whoop a few times.  That is it.  This is the first time I have ever posted a movie review, but I felt so strongly that somebody must speak out against this scourge of cinematography.  If you like planes, snakes, Samuel L.Jackson, air hostesses, bad guys, surfing, dogs in bags or English people, then please, please do not see this movie.  It will pollute your opinion of all of the above so far that you will never want to come into contact with any of them ever again.  Go see United 93 instead.  THAT was good.",
		"This is not a film you can really analyse separately from it is production.  The audience became the filmmakers to an extent unprecedented in the history of the American film industry; we felt so involved that viewing it becomes like watching the work of a friend.  How is it possible to be objective?  This is our movie, is not it?  Or is it?  There may be nothing more disingenuous than a filmmaker who promotes himself as the audiences friend, giving them all the naughty treats that the nannyish critics would deny them.  viscera missing piece of work like Hostel.David R. Ellis may not have spawned the monster that was the internet response to his film, but he was, quite understandably, quick to engage with it.  He took the carnivalhuckster school of filmmaking to a new level, getting the fans to build what they would eventually buy.  So many have enthused over this interactive, democratic approach to filmmaking that they seem to have missed the point  that this is the most cynical form of filmasmarketing.  Nothing is included that the filmmakers know the fans will not buy, and any old suggestion that will get bums on seats is incorporated.  The fact that the pitch became the title tells you all you need to know.Is not this just the evolution of the focus group approach?  Individual creativity, talent, craft, ideas, all are sacrificed before the inane chatter of the masses.  It is a critical commonplace that focus groups and test screenings do not make for good movies  why should the preemptive intervention of internet enthusiasts be any different?  Because we happen to be film fans?  Well, thank god for us, because otherwise I might not have seen a topless woman get her nipple bitten by a snake.So, yes, I had fun at the movie  a midnight showing, fresh from the pub and with a bucket of icecream  but it actually had relatively little to do with the film, and quite a lot to do with the atmosphere.  Like Christmas, everyone seemed determined that they would have fun, no matter what.  There was laughter, but I do not know if it was with the film, or at the film.  With a film as calculated as this one, is that even a meaningful distinction?  There are some genuinely good aspects to the film.  Samuel L.  Jackson gives a welljudged performance, pure selfparody but with a real sense of pleasure.  Rachel Blanchard and Lin Shaye are decent in limited roles, and there are one or two inspired moments  the fate of the lap dog is genuinely funny black comedy that the rest of the film fails to emulate.The stock characters are to be expected, but the total lack of suspense is not.  What is the point of a film that combines two great phobias if there is no creeping menace?  There are several snakejumpsout moments, but they are incredibly badly staged.  Only the annoying British man gets a decent pulpy death scene  the other killings are oddly flat.  The demise of the honeymoon couple, for instance, is shamefully botched.  Most of the actors fail to make an impression; it is a shame that a charismatic actress like Julianna Margulies should seem so tired when she tells two kids to close their eyes and pretend the turbulent flight is a rollercoaster, she could be talking to the audience  the film falls far short.There are worse movies, but there are many, many better; another reviewer on this site compared this film with Lake Placid, and it is as apt a contrast as any I can think of.  That film worked so magnificently because the performances were excellent, the jokes were funny, the suspense sequences were scary, and it was not devised by committee.  That the characters had a little depth and shading was an unexpected bonus.  I do not need a postpub midnight showing to have a good time with that film.This film will, in time, fade to become a mere footnote in film history.  If it sets a precedent, however, I am genuinely worried about what might be crossing our screens in a couple of years time.  In all probability, nothing much will come of it.  Perennial popcorn favourites  Raiders of the Lost Ark, Alien, Halloween and of course, Star Wars  just are not produced by groupthink.In the mean time, I will tell you what  I have not half got a craving for some Ingmar Bergman."
	]
}